let recipes = {
    "奶奶的拐杖": {
        "type": "增强型工作台",
        "map": [[null, "橡木原木", null], [null, "橡木原木", null], [null, "橡木原木", null]],
        "ingredients": [["橡木原木", 3]]
    },
    "爷爷的拐杖": {
        "type": "增强型工作台",
        "map": [["皮革", "橡木原木", "皮革"], [null, "橡木原木", null], [null, "橡木原木", null]],
        "ingredients": [["皮革", 2], ["橡木原木", 3]]
    },
    "处决之剑": {
        "type": "增强型工作台",
        "map": [[null, "绿宝石", null], ["魔法结晶-II", "绿宝石", "魔法结晶-II"], [null, "烈焰棒", null]],
        "ingredients": [["绿宝石", 2], ["魔法结晶-II", 2], ["烈焰棒"]]
    },
    "吸血鬼之刀": {
        "type": "魔法工作台",
        "map": [[null, "凋灵骷髅头颅", null], [null, "凋灵骷髅头颅", null], [null, "烈焰棒", null]],
        "ingredients": [["凋灵骷髅头颅", 2], ["烈焰棒"]]
    },
    "地震斧": {
        "type": "魔法工作台",
        "map": [["硬化金属", "硬化金属", null], ["硬化金属", "元素法杖", null], [null, "元素法杖", null]],
        "ingredients": [["硬化金属", 3], ["元素法杖", 2]]
    },
    "灵魂绑定剑": {
        "type": "魔法工作台",
        "map": [[null, "来世精华", null], [null, "钻石剑", null], [null, "来世精华", null]],
        "ingredients": [["来世精华", 2], ["钻石剑"]]
    },
    "灵魂绑定三叉戟": {
        "type": "魔法工作台",
        "map": [[null, "来世精华", null], [null, "三叉戟", null], [null, "来世精华", null]],
        "ingredients": [["来世精华", 2], ["三叉戟"]]
    },
    "灵魂绑定弓": {
        "type": "魔法工作台",
        "map": [[null, "来世精华", null], [null, "弓", null], [null, "来世精华", null]],
        "ingredients": [["来世精华", 2], ["弓"]]
    },
    "爆裂之弓": {
        "type": "魔法工作台",
        "map": [[null, "木棍", "火药"], ["元素法杖-火", null, "硫酸盐"], [null, "木棍", "火药"]],
        "ingredients": [["木棍", 2], ["火药", 2], ["元素法杖-火"], ["硫酸盐"]]
    },
    "冰封之弓": {
        "type": "魔法工作台",
        "map": [[null, "木棍", "冰"], ["元素法杖-水", null, "浮冰"], [null, "木棍", "冰"]],
        "ingredients": [["木棍", 2], ["冰", 2], ["元素法杖-水"], ["浮冰"]]
    },
    "便携工作台": {
        "type": "增强型工作台",
        "map": [["书", "工作台", null], [null, null, null], [null, null, null]],
        "ingredients": [["书"], ["工作台"]]
    },
    "便携垃圾箱": {
        "type": "增强型工作台",
        "map": [["铁锭", "铁锭", "铁锭"], ["铁锭", null, "铁锭"], ["铁锭", "铁锭", "铁锭"]],
        "ingredients": [["铁锭", 8]]
    },
    "破布": {
        "type": "增强型工作台",
        "map": [["布", "布", "布"], ["线", null, "线"], ["布", "布", "布"]],
        "ingredients": [["布", 6], ["线", 2]]
    },
    "绷带": {
        "type": "增强型工作台",
        "map": [["破布", "线", "破布"], [null, null, null], [null, null, null]],
        "ingredients": [["破布", 2], ["线"]]
    },
    "夹板": {
        "type": "增强型工作台",
        "map": [[null, "铁锭", null], ["木棍", "木棍", "木棍"], [null, "铁锭", null]],
        "ingredients": [["铁锭", 2], ["木棍", 3]],
        "count": 4
    },
    "维他命": {
        "type": "增强型工作台",
        "map": [["锡罐", "苹果", "红色蘑菇"], ["糖", null, null], [null, null, null]],
        "ingredients": [["锡罐"], ["苹果"], ["红色蘑菇"], ["糖"]]
    },
    "药物": {
        "type": "增强型工作台",
        "map": [["维他命", "玻璃瓶", "浓奶油"], [null, null, null], [null, null, null]],
        "ingredients": [["维他命"], ["玻璃瓶"], ["浓奶油"]]
    },
    "小型背包": {
        "type": "增强型工作台",
        "map": [["皮革", null, "皮革"], ["金锭(6克拉)", "箱子", "金锭(6克拉)"], ["皮革", "皮革", "皮革"]],
        "ingredients": [["皮革", 5], ["金锭(6克拉)", 2], ["箱子"]]
    },
    "普通背包": {
        "type": "增强型工作台",
        "map": [["皮革", null, "皮革"], ["金锭(10克拉)", "小型背包", "金锭(10克拉)"], ["皮革", "皮革", "皮革"]],
        "ingredients": [["皮革", 5], ["金锭(10克拉)", 2], ["小型背包"]]
    },
    "中型背包": {
        "type": "增强型工作台",
        "map": [["皮革", null, "皮革"], ["金锭(14克拉)", "普通背包", "金锭(14克拉)"], ["皮革", "皮革", "皮革"]],
        "ingredients": [["皮革", 5], ["金锭(14克拉)", 2], ["普通背包"]]
    },
    "编织背包": {
        "type": "增强型工作台",
        "map": [["布", null, "布"], ["金锭(16克拉)", "中型背包", "金锭(16克拉)"], ["布", "布", "布"]],
        "ingredients": [["布", 5], ["金锭(16克拉)", 2], ["中型背包"]]
    },
    "镀金背包": {
        "type": "增强型工作台",
        "map": [["金锭(22克拉)", null, "金锭(22克拉)"], ["皮革", "编织背包", "皮革"], ["金锭(22克拉)", null, "金锭(22克拉)"]],
        "ingredients": [["金锭(22克拉)", 4], ["皮革", 2], ["编织背包"]]
    },
    "金光闪闪的背包": {
        "type": "增强型工作台",
        "map": [["金锭(24克拉)", null, "金锭(24克拉)"], ["皮革", "镀金背包", "皮革"], ["金锭(24克拉)", null, "金锭(24克拉)"]],
        "ingredients": [["金锭(24克拉)", 4], ["皮革", 2], ["镀金背包"]]
    },
    "灵魂绑定背包": {
        "type": "魔法工作台",
        "map": [["末影结晶-II", null, "末影结晶-II"], ["来世精华", "编织背包", "来世精华"], ["末影结晶-II", null, "末影结晶-II"]],
        "ingredients": [["末影结晶-II", 4], ["来世精华", 2], ["编织背包"]]
    },
    "小冰柜": {
        "type": "增强型工作台",
        "map": [["布", "布", "布"], ["铝锭", "冷却装置", "铝锭"], ["铝锭", "铝锭", "铝锭"]],
        "ingredients": [["布", 3], ["铝锭", 5], ["冷却装置"]]
    },
    "高级工作台": {"type": "多方块结构", "ingredients": [["工作台"], ["发射器"]]},
    "磨石": {
        "type": "多方块结构",
        "map": [[null, null, null], [null, "橡木栅栏", null], [null, "发射器 (朝上)", null]],
        "ingredients": [["橡木栅栏"], ["发射器 (朝上)"]]
    },
    "盔甲锻造台": {
        "type": "多方块结构",
        "map": [[null, null, null], [null, "铁砧", null], [null, "发射器 (朝上)", null]],
        "ingredients": [["铁砧"], ["发射器 (朝上)"]]
    },
    "矿石粉碎机": {
        "type": "多方块结构",
        "map": [[null, null, null], [null, "下界砖栅栏", null], ["铁栏杆", "发射器 (朝上)", "铁栏杆"]],
        "ingredients": [["下界砖栅栏"], ["铁栏杆", 2], ["发射器 (朝上)"]]
    },
    "压缩机": {
        "type": "增强型工作台",
        "map": [["活塞", "电动马达", "活塞"], [null, "中型储能电容", null], ["大马士革钢锭", "大马士革钢锭", "大马士革钢锭"]],
        "ingredients": [["活塞", 2], ["电动马达"], ["中型储能电容"], ["大马士革钢锭", 3]]
    },
    "冶炼炉": {
        "type": "多方块结构",
        "map": [[null, "下界砖栅栏", null], ["下界砖块", "发射器 (朝上)", "下界砖块"], [null, "打火石", null]],
        "ingredients": [["下界砖栅栏"], ["下界砖块", 2], ["发射器 (朝上)"], ["打火石"]]
    },
    "压力机": {
        "type": "多方块结构",
        "map": [["平滑石头台阶", "发射器 (朝下)", "平滑石头台阶"], ["活塞", "玻璃", "活塞"], ["活塞", "炼药锅", "活塞"]],
        "ingredients": [["平滑石头台阶", 2], ["发射器 (朝下)"], ["活塞", 4], ["玻璃"], ["炼药锅"]]
    },
    "魔法工作台": {
        "type": "多方块结构",
        "map": [[null, null, null], [null, null, null], ["书架", "工作台", "发射器"]],
        "ingredients": [["书架"], ["工作台"], ["发射器"]]
    },
    "洗矿机": {
        "type": "多方块结构",
        "map": [[null, "发射器", null], [null, "橡木栅栏", null], [null, "炼药锅", null]],
        "ingredients": [["发射器"], ["橡木栅栏"], ["炼药锅"]]
    },
    "台锯": {
        "type": "多方块结构",
        "map": [[null, null, null], ["平滑石头台阶", "切石机", "平滑石头台阶"], [null, "铁块", null]],
        "ingredients": [["平滑石头台阶", 2], ["切石机"], ["铁块"]]
    },
    "挖矿机": {"type": "多方块结构", "ingredients": [["铁块", 4], ["太阳能板", 2], ["箱子"], ["漏斗"], ["发射器"]]},
    "高级挖矿机": {
        "type": "多方块结构",
        "ingredients": [["金块(24克拉)", 4], ["太阳能板", 2], ["箱子"], ["漏斗"], ["发射器"]]
    },
    "自动淘金机": {
        "type": "多方块结构",
        "map": [[null, null, null], [null, "橡木活板门", null], [null, "炼药锅", null]],
        "ingredients": [["橡木活板门"], ["炼药锅"]]
    },
    "榨汁机": {
        "type": "多方块结构",
        "map": [[null, "玻璃", null], [null, "下界砖栅栏", null], [null, "发射器 (朝上)", null]],
        "ingredients": [["玻璃"], ["下界砖栅栏"], ["发射器 (朝上)"]]
    },
    "物品输出箱": {
        "type": "增强型工作台",
        "map": [["铅锭", "漏斗", "铅锭"], ["铅锭", "箱子", "铅锭"], [null, "铅锭", null]],
        "ingredients": [["铅锭", 5], ["漏斗"], ["箱子"]]
    },
    "自动点火机": {
        "type": "增强型工作台",
        "map": [["铁锭", "打火石", "铁锭"], ["铁锭", "基础电路板", "铁锭"], [null, "侦测器", null]],
        "ingredients": [["铁锭", 4], ["打火石"], ["基础电路板"], ["侦测器"]]
    },
    "搅拌机": {
        "type": "增强型工作台",
        "map": [["橡木台阶", null, "橡木台阶"], ["橡木台阶", null, "橡木台阶"], ["橡木台阶", "炼药锅", "橡木台阶"]],
        "ingredients": [["橡木台阶", 6], ["炼药锅"]]
    },
    "坩埚": {
        "type": "增强型工作台",
        "map": [["陶瓦", null, "陶瓦"], ["陶瓦", null, "陶瓦"], ["陶瓦", "打火石", "陶瓦"]],
        "ingredients": [["陶瓦", 6], ["打火石"]]
    },
    "强化熔炉-I": {
        "type": "增强型工作台",
        "map": [[null, "钢锭", null], ["基础电路板", "熔炉", "加热线圈"], [null, "电动马达", null]],
        "ingredients": [["钢锭"], ["基础电路板"], ["熔炉"], ["加热线圈"], ["电动马达"]]
    },
    "强化熔炉-II": {
        "type": "增强型工作台",
        "map": [[null, "钢锭", null], ["基础电路板", "强化熔炉-I", "加热线圈"], [null, "电动马达", null]],
        "ingredients": [["钢锭"], ["基础电路板"], ["强化熔炉-I"], ["加热线圈"], ["电动马达"]]
    },
    "强化熔炉-III": {
        "type": "增强型工作台",
        "map": [[null, "钢锭", null], ["基础电路板", "强化熔炉-II", "加热线圈"], [null, "电动马达", null]],
        "ingredients": [["钢锭"], ["基础电路板"], ["强化熔炉-II"], ["加热线圈"], ["电动马达"]]
    },
    "强化熔炉-IV": {
        "type": "增强型工作台",
        "map": [[null, "钢锭", null], ["基础电路板", "强化熔炉-III", "加热线圈"], [null, "电动马达", null]],
        "ingredients": [["钢锭"], ["基础电路板"], ["强化熔炉-III"], ["加热线圈"], ["电动马达"]]
    },
    "强化熔炉-V": {
        "type": "增强型工作台",
        "map": [[null, "钢锭", null], ["基础电路板", "强化熔炉-IV", "加热线圈"], [null, "电动马达", null]],
        "ingredients": [["钢锭"], ["基础电路板"], ["强化熔炉-IV"], ["加热线圈"], ["电动马达"]]
    },
    "强化熔炉-VI": {
        "type": "增强型工作台",
        "map": [[null, "钢锭", null], ["基础电路板", "强化熔炉-V", "加热线圈"], [null, "电动马达", null]],
        "ingredients": [["钢锭"], ["基础电路板"], ["强化熔炉-V"], ["加热线圈"], ["电动马达"]]
    },
    "强化熔炉-VII": {
        "type": "增强型工作台",
        "map": [[null, "钢锭", null], ["基础电路板", "强化熔炉-VI", "加热线圈"], [null, "电动马达", null]],
        "ingredients": [["钢锭"], ["基础电路板"], ["强化熔炉-VI"], ["加热线圈"], ["电动马达"]]
    },
    "强化熔炉-VIII": {
        "type": "增强型工作台",
        "map": [[null, "钢锭", null], ["基础电路板", "强化熔炉-VII", "加热线圈"], [null, "电动马达", null]],
        "ingredients": [["钢锭"], ["基础电路板"], ["强化熔炉-VII"], ["加热线圈"], ["电动马达"]]
    },
    "强化熔炉-IX": {
        "type": "增强型工作台",
        "map": [[null, "钢锭", null], ["基础电路板", "强化熔炉-VIII", "加热线圈"], [null, "电动马达", null]],
        "ingredients": [["钢锭"], ["基础电路板"], ["强化熔炉-VIII"], ["加热线圈"], ["电动马达"]]
    },
    "强化熔炉-X": {
        "type": "增强型工作台",
        "map": [[null, "钢锭", null], ["基础电路板", "强化熔炉-IX", "加热线圈"], [null, "电动马达", null]],
        "ingredients": [["钢锭"], ["基础电路板"], ["强化熔炉-IX"], ["加热线圈"], ["电动马达"]]
    },
    "强化熔炉-XI": {
        "type": "增强型工作台",
        "map": [[null, "钢锭", null], ["基础电路板", "强化熔炉-X", "加热线圈"], [null, "电动马达", null]],
        "ingredients": [["钢锭"], ["基础电路板"], ["强化熔炉-X"], ["加热线圈"], ["电动马达"]]
    },
    "强化合金熔炉": {
        "type": "增强型工作台",
        "map": [["强化合金锭", "基础电路板", "强化合金锭"], ["加热线圈", "强化熔炉-XI", "加热线圈"], ["强化合金锭", "电动马达", "强化合金锭"]],
        "ingredients": [["强化合金锭", 4], ["基础电路板"], ["加热线圈", 2], ["强化熔炉-XI"], ["电动马达"]]
    },
    "黑金刚石镶边熔炉": {
        "type": "增强型工作台",
        "map": [["黑金刚石", "基础电路板", "黑金刚石"], ["加热线圈", "强化合金熔炉", "加热线圈"], ["黑金刚石", "电动马达", "黑金刚石"]],
        "ingredients": [["黑金刚石", 4], ["基础电路板"], ["加热线圈", 2], ["强化合金熔炉"], ["电动马达"]]
    },
    "方块放置机": {
        "type": "增强型工作台",
        "map": [["金锭(4克拉)", "活塞", "金锭(4克拉)"], ["铁锭", "电动马达", "铁锭"], ["金锭(4克拉)", "活塞", "金锭(4克拉)"]],
        "ingredients": [["金锭(4克拉)", 4], ["活塞", 2], ["铁锭", 2], ["电动马达"]]
    },
    "淘金盘": {
        "type": "增强型工作台",
        "map": [[null, null, null], ["石头", "碗", "石头"], ["石头", "石头", "石头"]],
        "ingredients": [["石头", 5], ["碗"]]
    },
    "下界淘金盘": {
        "type": "增强型工作台",
        "map": [[null, null, null], ["下界砖", "淘金盘", "下界砖"], ["下界砖", "下界砖", "下界砖"]],
        "ingredients": [["下界砖", 5], ["淘金盘"]]
    },
    "抓钩": {
        "type": "增强型工作台",
        "map": [[null, null, "钩子"], [null, "锁链", null], ["锁链", null, null]],
        "ingredients": [["钩子"], ["锁链", 2]]
    },
    "熔炉镐": {
        "type": "增强型工作台",
        "map": [["岩浆水晶", "岩浆水晶", "岩浆水晶"], [null, "硅铁", null], [null, "硅铁", null]],
        "ingredients": [["岩浆水晶", 3], ["硅铁", 2]]
    },
    "伐木斧": {
        "type": "魔法工作台",
        "map": [["人造钻石", "人造钻石", null], ["人造绿宝石", "镀金铁锭", null], [null, "镀金铁锭", null]],
        "ingredients": [["人造钻石", 2], ["人造绿宝石"], ["镀金铁锭", 2]]
    },
    "刷怪笼之镐": {
        "type": "魔法工作台",
        "map": [["硅铁", "硅铁", "硅铁"], [null, "镀金铁锭", null], [null, "镀金铁锭", null]],
        "ingredients": [["硅铁", 3], ["镀金铁锭", 2]]
    },
    "赫拉克勒斯之镐": {"type": "魔法工作台", "ingredients": [["硬化金属", 3], ["硅铁", 2]]},
    "爆炸镐": {
        "type": "魔法工作台",
        "map": [["TNT", "人造钻石", "TNT"], [null, "硅铁", null], [null, "硅铁", null]],
        "ingredients": [["TNT", 2], ["人造钻石"], ["硅铁", 2]]
    },
    "爆炸铲": {
        "type": "魔法工作台",
        "map": [[null, "人造钻石", null], [null, "TNT", null], [null, "硅铁", null]],
        "ingredients": [["人造钻石"], ["TNT"], ["硅铁"]]
    },
    "寻矿镐": {
        "type": "魔法工作台",
        "map": [["指南针", "人造钻石", "指南针"], [null, "硅铁", null], [null, "硅铁", null]],
        "ingredients": [["指南针", 2], ["人造钻石"], ["硅铁", 2]]
    },
    "钴镐": {
        "type": "增强型工作台",
        "map": [["钴锭", "钴锭", "钴锭"], [null, "镍锭", null], [null, "镍锭", null]],
        "ingredients": [["钴锭", 3], ["镍锭", 2]]
    },
    "矿脉镐": {
        "type": "魔法工作台",
        "map": [["绿宝石矿石", "人造钻石", "绿宝石矿石"], [null, "镀金铁锭", null], [null, "镀金铁锭", null]],
        "ingredients": [["绿宝石矿石", 2], ["人造钻石"], ["镀金铁锭", 2]]
    },
    "灵魂绑定镐": {
        "type": "魔法工作台",
        "map": [[null, "来世精华", null], [null, "钻石镐", null], [null, "来世精华", null]],
        "ingredients": [["来世精华", 2], ["钻石镐"]]
    },
    "灵魂绑定斧": {
        "type": "魔法工作台",
        "map": [[null, "来世精华", null], [null, "钻石斧", null], [null, "来世精华", null]],
        "ingredients": [["来世精华", 2], ["钻石斧"]]
    },
    "灵魂绑定铲": {
        "type": "魔法工作台",
        "map": [[null, "来世精华", null], [null, "钻石锹", null], [null, "来世精华", null]],
        "ingredients": [["来世精华", 2], ["钻石锹"]]
    },
    "灵魂绑定锄": {
        "type": "魔法工作台",
        "map": [[null, "来世精华", null], [null, "钻石锄", null], [null, "来世精华", null]],
        "ingredients": [["来世精华", 2], ["钻石锄"]]
    },
    "强化合金锭": {
        "type": "冶炼炉",
        "map": [["大马士革钢锭", "硬化金属", "科林斯青铜锭"], ["焊锡锭", "银铜合金锭", "金锭(24克拉)"], [null, null, null]],
        "ingredients": [["大马士革钢锭"], ["硬化金属"], ["科林斯青铜锭"], ["焊锡锭"], ["银铜合金锭"], ["金锭(24克拉)"]]
    },
    "硬化金属": {
        "type": "冶炼炉",
        "map": [["大马士革钢锭", "硬铝锭", "压缩碳"], ["铝青铜锭", null, null], [null, null, null]],
        "ingredients": [["大马士革钢锭"], ["硬铝锭"], ["压缩碳"], ["铝青铜锭"]]
    },
    "大马士革钢锭": {
        "type": "冶炼炉",
        "map": [["钢锭", "铁粉", "碳"], ["铁锭", null, null], [null, null, null]],
        "ingredients": [["钢锭"], ["铁粉"], ["碳"], ["铁锭"]]
    },
    "钢锭": {
        "type": "冶炼炉",
        "map": [["铁粉", "碳", "铁锭"], [null, null, null], [null, null, null]],
        "ingredients": [["铁粉"], ["碳"], ["铁锭"]]
    },
    "青铜锭": {
        "type": "冶炼炉",
        "map": [["铜粉", "锡粉", "铜锭"], [null, null, null], [null, null, null]],
        "ingredients": [["铜粉"], ["锡粉"], ["铜锭"]]
    },
    "硬铝锭": {
        "type": "冶炼炉",
        "map": [["铝粉", "铜粉", "铝锭"], [null, null, null], [null, null, null]],
        "ingredients": [["铝粉"], ["铜粉"], ["铝锭"]]
    },
    "银铜合金锭": {
        "type": "冶炼炉",
        "map": [["银粉", "铜粉", "银锭"], [null, null, null], [null, null, null]],
        "ingredients": [["银粉"], ["铜粉"], ["银锭"]]
    },
    "黄铜锭": {
        "type": "冶炼炉",
        "map": [["铜粉", "锌粉", "铜锭"], [null, null, null], [null, null, null]],
        "ingredients": [["铜粉"], ["锌粉"], ["铜锭"]]
    },
    "铝黄铜锭": {
        "type": "冶炼炉",
        "map": [["铝粉", "黄铜锭", "铝锭"], [null, null, null], [null, null, null]],
        "ingredients": [["铝粉"], ["黄铜锭"], ["铝锭"]]
    },
    "铝青铜锭": {
        "type": "冶炼炉",
        "map": [["铝粉", "青铜锭", "铝锭"], [null, null, null], [null, null, null]],
        "ingredients": [["铝粉"], ["青铜锭"], ["铝锭"]]
    },
    "科林斯青铜锭": {
        "type": "冶炼炉",
        "map": [["银粉", "金粉", "铜粉"], ["青铜锭", null, null], [null, null, null]],
        "ingredients": [["银粉"], ["金粉"], ["铜粉"], ["青铜锭"]]
    },
    "焊锡锭": {
        "type": "冶炼炉",
        "map": [["铅粉", "锡粉", "铅锭"], [null, null, null], [null, null, null]],
        "ingredients": [["铅粉"], ["锡粉"], ["铅锭"]]
    },
    "人造蓝宝石": {
        "type": "冶炼炉",
        "map": [["铝粉", "玻璃", "玻璃板"], ["铝锭", "青金石", null], [null, null, null]],
        "ingredients": [["铝粉"], ["玻璃"], ["玻璃板"], ["铝锭"], ["青金石"]]
    },
    "黑金刚石原矿": {
        "type": "冶炼炉",
        "map": [["人造钻石", "碳块", "玻璃板"], [null, null, null], [null, null, null]],
        "ingredients": [["人造钻石"], ["碳块"], ["玻璃板"]]
    },
    "镍锭": {
        "type": "冶炼炉",
        "map": [["铁粉", "铁锭", "铜粉"], [null, null, null], [null, null, null]],
        "ingredients": [["铁粉"], ["铁锭"], ["铜粉"]]
    },
    "钴锭": {
        "type": "冶炼炉",
        "map": [["铁粉", "铜粉", "镍锭"], [null, null, null], [null, null, null]],
        "ingredients": [["铁粉"], ["铜粉"], ["镍锭"]]
    },
    "硅铁": {
        "type": "冶炼炉",
        "map": [["铁锭", "铁粉", "硅"], [null, null, null], [null, null, null]],
        "ingredients": [["铁锭"], ["铁粉"], ["硅"]]
    },
    "镀金铁锭": {
        "type": "冶炼炉",
        "map": [["金锭(24克拉)", "铁粉", null], [null, null, null], [null, null, null]],
        "ingredients": [["金锭(24克拉)"], ["铁粉"]]
    },
    "人造绿宝石": {
        "type": "冶炼炉",
        "map": [["人造蓝宝石", "铝粉", "铝锭"], ["玻璃板", null, null], [null, null, null]],
        "ingredients": [["人造蓝宝石"], ["铝粉"], ["铝锭"], ["玻璃板"]]
    },
    "红石合金锭": {
        "type": "冶炼炉",
        "map": [["红石粉", "红石块", "硅铁"], ["硬化金属", null, null], [null, null, null]],
        "ingredients": [["红石粉"], ["红石块"], ["硅铁"], ["硬化金属"]]
    },
    "人造钻石": {
        "type": "压力机",
        "map": [["碳块", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["碳块"]]
    },
    "黑金刚石": {
        "type": "压力机",
        "map": [["黑金刚石原矿", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["黑金刚石原矿"]]
    },
    "铜锭": {
        "type": "冶炼炉",
        "map": [["铜粉", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["铜粉"]]
    },
    "锡锭": {
        "type": "冶炼炉",
        "map": [["锡粉", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["锡粉"]]
    },
    "银锭": {
        "type": "冶炼炉",
        "map": [["银粉", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["银粉"]]
    },
    "铅锭": {
        "type": "冶炼炉",
        "map": [["铅粉", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["铅粉"]]
    },
    "铝锭": {
        "type": "冶炼炉",
        "map": [["铝粉", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["铝粉"]]
    },
    "锌锭": {
        "type": "冶炼炉",
        "map": [["锌粉", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["锌粉"]]
    },
    "镁锭": {
        "type": "冶炼炉",
        "map": [["镁粉", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["镁粉"]]
    },
    "硫酸盐": {
        "type": "矿石粉碎机",
        "map": [["下界岩", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["下界岩", 16]]
    },
    "碳": {
        "type": "压缩机",
        "map": [["煤炭", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["煤炭", 8]]
    },
    "压缩碳": {
        "type": "压缩机",
        "map": [["碳", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["碳", 4]]
    },
    "碳块": {
        "type": "增强型工作台",
        "map": [["压缩碳", "压缩碳", "压缩碳"], ["压缩碳", "燧石", "压缩碳"], ["压缩碳", "压缩碳", "压缩碳"]],
        "ingredients": [["压缩碳", 8], ["燧石"]]
    },
    "金锭(24克拉)": {
        "type": "冶炼炉",
        "map": [["金粉", "金锭(22克拉)", null], [null, null, null], [null, null, null]],
        "ingredients": [["金粉"], ["金锭(22克拉)"]]
    },
    "金锭(22克拉)": {
        "type": "冶炼炉",
        "map": [["金粉", "金锭(20克拉)", null], [null, null, null], [null, null, null]],
        "ingredients": [["金粉"], ["金锭(20克拉)"]]
    },
    "金锭(20克拉)": {
        "type": "冶炼炉",
        "map": [["金粉", "金锭(18克拉)", null], [null, null, null], [null, null, null]],
        "ingredients": [["金粉"], ["金锭(18克拉)"]]
    },
    "金锭(18克拉)": {
        "type": "冶炼炉",
        "map": [["金粉", "金锭(16克拉)", null], [null, null, null], [null, null, null]],
        "ingredients": [["金粉"], ["金锭(16克拉)"]]
    },
    "金锭(16克拉)": {
        "type": "冶炼炉",
        "map": [["金粉", "金锭(14克拉)", null], [null, null, null], [null, null, null]],
        "ingredients": [["金粉"], ["金锭(14克拉)"]]
    },
    "金锭(14克拉)": {
        "type": "冶炼炉",
        "map": [["金粉", "金锭(12克拉)", null], [null, null, null], [null, null, null]],
        "ingredients": [["金粉"], ["金锭(12克拉)"]]
    },
    "金锭(12克拉)": {
        "type": "冶炼炉",
        "map": [["金粉", "金锭(10克拉)", null], [null, null, null], [null, null, null]],
        "ingredients": [["金粉"], ["金锭(10克拉)"]]
    },
    "金锭(10克拉)": {
        "type": "冶炼炉",
        "map": [["金粉", "金锭(8克拉)", null], [null, null, null], [null, null, null]],
        "ingredients": [["金粉"], ["金锭(8克拉)"]]
    },
    "金锭(8克拉)": {
        "type": "冶炼炉",
        "map": [["金粉", "金锭(6克拉)", null], [null, null, null], [null, null, null]],
        "ingredients": [["金粉"], ["金锭(6克拉)"]]
    },
    "金锭(6克拉)": {
        "type": "冶炼炉",
        "map": [["金粉", "金锭(4克拉)", null], [null, null, null], [null, null, null]],
        "ingredients": [["金粉"], ["金锭(4克拉)"]]
    },
    "金锭(4克拉)": {
        "type": "冶炼炉",
        "map": [["金粉", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["金粉"]]
    },
    "硅": {
        "type": "冶炼炉",
        "map": [["石英块", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["石英块"]]
    },
    "铀": {
        "type": "增强型工作台",
        "map": [["一小块铀", "一小块铀", null], ["一小块铀", "一小块铀", null], [null, null, null]],
        "ingredients": [["一小块铀", 4]]
    },
    "镁盐": {
        "type": "加热压力舱",
        "map": [["镁粉", "盐", null], [null, null, null], [null, null, null]],
        "ingredients": [["镁粉"], ["盐"]]
    },
    "原油桶": {
        "type": "原油泵",
        "map": [[null, null, null], [null, "铁桶", null], [null, null, null]],
        "ingredients": [["铁桶"]]
    },
    "燃料桶": {
        "type": "炼油机",
        "map": [[null, null, null], [null, "原油桶", null], [null, null, null]],
        "ingredients": [["原油桶"]]
    },
    "起泡锭(33%)": {
        "type": "加热压力舱",
        "map": [["金锭(24克拉)", "铀", null], [null, null, null], [null, null, null]],
        "ingredients": [["金锭(24克拉)"], ["铀"]]
    },
    "起泡锭(66%)": {
        "type": "加热压力舱",
        "map": [["起泡锭(33%)", "黑金刚石", null], [null, null, null], [null, null, null]],
        "ingredients": [["起泡锭(33%)"], ["黑金刚石"]]
    },
    "起泡锭": {
        "type": "加热压力舱",
        "map": [["起泡锭(66%)", "下界之星", null], [null, null, null], [null, null, null]],
        "ingredients": [["起泡锭(66%)"], ["下界之星"]]
    },
    "浓缩下界冰": {
        "type": "加热压力舱",
        "map": [["下界冰", "钚", null], [null, null, null], [null, null, null]],
        "ingredients": [["下界冰"], ["钚"]]
    },
    "镎": {
        "type": "核反应堆",
        "map": [["铀", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["铀"]]
    },
    "钚": {
        "type": "核反应堆",
        "map": [["镎", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["镎"]]
    },
    "高纯度铀": {"type": "加热压力仓", "ingredients": [["钚"], ["铀"]]},
    "幸运饼干": {
        "type": "增强型工作台",
        "map": [["曲奇", "纸", null], [null, null, null], [null, null, null]],
        "ingredients": [["曲奇"], ["纸"]]
    },
    "减肥曲奇": {
        "type": "魔法工作台",
        "map": [["曲奇", "鞘翅鳞片", null], [null, null, null], [null, null, null]],
        "ingredients": [["曲奇"], ["鞘翅鳞片"]]
    },
    "牛肉干": {
        "type": "增强型工作台",
        "map": [["盐", "牛排", null], [null, null, null], [null, null, null]],
        "ingredients": [["盐"], ["牛排"]]
    },
    "猪肉干": {
        "type": "增强型工作台",
        "map": [["盐", "熟猪排", null], [null, null, null], [null, null, null]],
        "ingredients": [["盐"], ["熟猪排"]]
    },
    "鸡肉干": {
        "type": "增强型工作台",
        "map": [["盐", "熟鸡肉", null], [null, null, null], [null, null, null]],
        "ingredients": [["盐"], ["熟鸡肉"]]
    },
    "羊肉干": {
        "type": "增强型工作台",
        "map": [["盐", "熟羊肉", null], [null, null, null], [null, null, null]],
        "ingredients": [["盐"], ["熟羊肉"]]
    },
    "兔肉干": {
        "type": "增强型工作台",
        "map": [["盐", "熟兔肉", null], [null, null, null], [null, null, null]],
        "ingredients": [["盐"], ["熟兔肉"]]
    },
    "鱼干": {
        "type": "增强型工作台",
        "map": [["盐", "熟鳕鱼", null], [null, null, null], [null, null, null]],
        "ingredients": [["盐"], ["熟鳕鱼"]]
    },
    "魔法糖": {
        "type": "增强型工作台",
        "map": [["糖", "红石粉", "荧石粉"], [null, null, null], [null, null, null]],
        "ingredients": [["糖"], ["红石粉"], ["荧石粉"]]
    },
    "怪物肉干": {
        "type": "增强型工作台",
        "map": [["盐", "腐肉", null], [null, null, null], [null, null, null]],
        "ingredients": [["盐"], ["腐肉"]]
    },
    "苹果汁": {
        "type": "榨汁机",
        "map": [["苹果", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["苹果"]]
    },
    "胡萝卜汁": {
        "type": "榨汁机",
        "map": [["胡萝卜", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["胡萝卜"]]
    },
    "西瓜汁": {
        "type": "榨汁机",
        "map": [["西瓜片", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["西瓜片"]]
    },
    "南瓜汁": {
        "type": "榨汁机",
        "map": [["南瓜", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["南瓜"]]
    },
    "浆果汁": {
        "type": "榨汁机",
        "map": [["甜浆果", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["甜浆果"]]
    },
    "金苹果汁": {
        "type": "榨汁机",
        "map": [["金苹果", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["金苹果"]]
    },
    "魔法因子-I": {"type": "磨石", "ingredients": [["地狱疣"]], "count": 2},
    "魔法因子-II": {"type": "高级工作台", "ingredients": [["魔法因子-I", 4]]},
    "魔法因子-III": {"type": "高级工作台", "ingredients": [["魔法因子-II", 4]]},
    "末影因子-I": {"type": "高级工作台", "ingredients": [["末影之眼"]], "count": 2},
    "末影因子-II": {"type": "高级工作台", "ingredients": [["末影因子-I", 4]]},
    "末影因子-III": {"type": "高级工作台", "ingredients": [["末影因子-II", 4]]},
    "魔法书皮": {
        "type": "增强型工作台",
        "map": [[null, "魔法结晶-II", null], ["魔法结晶-II", "书", "魔法结晶-II"], [null, "魔法结晶-II", null]],
        "ingredients": [["魔法结晶-II", 4], ["书"]]
    },
    "岩浆水晶": {
        "type": "增强型工作台",
        "map": [["魔法结晶-I", "烈焰粉", "魔法结晶-I"], ["烈焰粉", "古代符文[火]", "烈焰粉"], ["魔法结晶-I", "烈焰粉", "魔法结晶-I"]],
        "ingredients": [["魔法结晶-I", 4], ["烈焰粉", 4], ["古代符文[火]"]]
    },
    "普通护身符": {
        "type": "魔法工作台",
        "map": [["魔法结晶-II", "金锭(8克拉)", "魔法结晶-II"], [null, "绿宝石", null], ["魔法结晶-II", "金锭(8克拉)", "魔法结晶-II"]],
        "ingredients": [["魔法结晶-II", 4], ["金锭(8克拉)", 2], ["绿宝石"]]
    },
    "坏死颅骨": {
        "type": "魔法工作台",
        "map": [["魔法结晶-III", null, "魔法结晶-III"], [null, "凋灵骷髅头颅", null], ["魔法结晶-III", null, "魔法结晶-III"]],
        "ingredients": [["魔法结晶-III", 4], ["凋灵骷髅头颅"]]
    },
    "来世精华": {
        "type": "古代祭坛",
        "map": [["末影结晶-III", "古代符文[气]", "末影结晶-III"], ["古代符文[地]", "坏死颅骨", "古代符文[火]"], ["末影结晶-III", "古代符文[水]", "末影结晶-III"]],
        "ingredients": [["末影结晶-III", 4], ["古代符文[气]"], ["古代符文[地]"], ["坏死颅骨"], ["古代符文[火]"], ["古代符文[水]"]]
    },
    "古代基座": {
        "type": "魔法工作台",
        "map": [["黑曜石", "金锭(8克拉)", "黑曜石"], [null, "石头", null], ["黑曜石", "金锭(8克拉)", "黑曜石"]],
        "ingredients": [["黑曜石", 4], ["金锭(8克拉)", 2], ["石头"]],
        "count": 4
    },
    "空白符文": {
        "type": "古代祭坛",
        "map": [["石头", "魔法结晶-I", "石头"], ["魔法结晶-I", "黑曜石", "魔法结晶-I"], ["石头", "魔法结晶-I", "石头"]],
        "ingredients": [["石头", 4], ["魔法结晶-I", 4], ["黑曜石"]]
    },
    "古代符文[气]": {
        "type": "古代祭坛",
        "map": [["羽毛", "魔法结晶-I", "羽毛"], ["恶魂之泪", "空白符文", "恶魂之泪"], ["羽毛", "魔法结晶-I", "羽毛"]],
        "ingredients": [["羽毛", 4], ["魔法结晶-I", 2], ["恶魂之泪", 2], ["空白符文"]],
        "count": 4
    },
    "古代符文[地]": {
        "type": "古代祭坛",
        "map": [["泥土", "魔法结晶-I", "石头"], ["黑曜石", "空白符文", "黑曜石"], ["石头", "魔法结晶-I", "泥土"]],
        "ingredients": [["泥土", 2], ["魔法结晶-I", 2], ["石头", 2], ["黑曜石", 2], ["空白符文"]],
        "count": 4
    },
    "古代符文[火]": {
        "type": "古代祭坛",
        "map": [["火焰弹", "魔法结晶-II", "火焰弹"], ["烈焰粉", "古代符文[地]", "打火石"], ["火焰弹", "魔法结晶-II", "火焰弹"]],
        "ingredients": [["火焰弹", 4], ["魔法结晶-II", 2], ["烈焰粉"], ["古代符文[地]"], ["打火石"]],
        "count": 4
    },
    "古代符文[水]": {
        "type": "古代祭坛",
        "map": [["生鲑鱼", "魔法结晶-II", "水桶"], ["沙子", "空白符文", "沙子"], ["水桶", "魔法结晶-II", "生鳕鱼"]],
        "ingredients": [["生鲑鱼"], ["魔法结晶-II", 2], ["水桶", 2], ["沙子", 2], ["空白符文"], ["生鳕鱼"]],
        "count": 4
    },
    "古代符文[末影]": {
        "type": "古代祭坛",
        "map": [["末影珍珠", "末影结晶-III", "末影珍珠"], ["末影之眼", "空白符文", "末影之眼"], ["末影珍珠", "末影结晶-III", "末影珍珠"]],
        "ingredients": [["末影珍珠", 4], ["末影结晶-III", 2], ["末影之眼", 2], ["空白符文"]],
        "count": 6
    },
    "古代符文[雷]": {
        "type": "古代祭坛",
        "map": [["铁锭", "魔法结晶-III", "铁锭"], ["古代符文[气]", "幻翼膜", "古代符文[水]"], ["铁锭", "魔法结晶-III", "铁锭"]],
        "ingredients": [["铁锭", 4], ["魔法结晶-III", 2], ["古代符文[气]"], ["幻翼膜"], ["古代符文[水]"]],
        "count": 4
    },
    "古代符文[虹]": {
        "type": "古代祭坛",
        "map": [["红色染料", "魔法结晶-III", "青色染料"], ["白色羊毛", "古代符文[末影]", "白色羊毛"], ["黄色染料", "末影结晶-III", "品红色染料"]],
        "ingredients": [["红色染料"], ["魔法结晶-III"], ["青色染料"], ["白色羊毛", 2], ["古代符文[末影]"], ["黄色染料"], ["末影结晶-III"], ["品红色染料"]]
    },
    "古代符文[灵魂绑定]": {
        "type": "古代祭坛",
        "map": [["魔法结晶-III", "来世精华", "魔法结晶-III"], ["末影结晶-III", "古代符文[末影]", "末影结晶-III"], ["魔法结晶-III", "来世精华", "魔法结晶-III"]],
        "ingredients": [["魔法结晶-III", 4], ["来世精华", 2], ["末影结晶-III", 2], ["古代符文[末影]"]]
    },
    "末影头盔": {
        "type": "盔甲锻造台",
        "map": [["末影结晶-I", "末影之眼", "末影结晶-I"], ["黑曜石", null, "黑曜石"], [null, null, null]],
        "ingredients": [["末影结晶-I", 2], ["末影之眼"], ["黑曜石", 2]]
    },
    "末影胸甲": {
        "type": "盔甲锻造台",
        "map": [["末影结晶-I", null, "末影结晶-I"], ["黑曜石", "末影之眼", "黑曜石"], ["黑曜石", "黑曜石", "黑曜石"]],
        "ingredients": [["末影结晶-I", 2], ["黑曜石", 5], ["末影之眼"]]
    },
    "末影护腿": {
        "type": "盔甲锻造台",
        "map": [["末影结晶-I", "末影之眼", "末影结晶-I"], ["黑曜石", null, "黑曜石"], ["黑曜石", null, "黑曜石"]],
        "ingredients": [["末影结晶-I", 2], ["末影之眼"], ["黑曜石", 4]]
    },
    "末影靴子": {
        "type": "盔甲锻造台",
        "map": [[null, null, null], ["末影结晶-I", null, "末影结晶-I"], ["黑曜石", null, "黑曜石"]],
        "ingredients": [["末影结晶-I", 2], ["黑曜石", 2]]
    },
    "史莱姆头盔": {
        "type": "盔甲锻造台",
        "map": [["黏液球", "钢板", "黏液球"], ["黏液球", null, "黏液球"], [null, null, null]],
        "ingredients": [["黏液球", 4], ["钢板"]]
    },
    "史莱姆胸甲": {
        "type": "盔甲锻造台",
        "map": [["黏液球", null, "黏液球"], ["黏液球", "钢板", "黏液球"], ["黏液球", "黏液球", "黏液球"]],
        "ingredients": [["黏液球", 7], ["钢板"]]
    },
    "史莱姆护腿": {
        "type": "盔甲锻造台",
        "map": [["黏液球", "钢板", "黏液球"], ["黏液球", null, "黏液球"], ["黏液球", null, "黏液球"]],
        "ingredients": [["黏液球", 6], ["钢板"]]
    },
    "史莱姆靴子": {
        "type": "盔甲锻造台",
        "map": [[null, null, null], ["黏液球", null, "黏液球"], ["黏液球", "钢板", "黏液球"]],
        "ingredients": [["黏液球", 4], ["钢板"]]
    },
    "萤石头盔": {
        "type": "盔甲锻造台",
        "map": [["荧石", "荧石", "荧石"], ["荧石", null, "荧石"], [null, null, null]],
        "ingredients": [["荧石", 5]]
    },
    "萤石胸甲": {
        "type": "盔甲锻造台",
        "map": [["荧石", null, "荧石"], ["荧石", "荧石", "荧石"], ["荧石", "荧石", "荧石"]],
        "ingredients": [["荧石", 8]]
    },
    "萤石护腿": {
        "type": "盔甲锻造台",
        "map": [["荧石", "荧石", "荧石"], ["荧石", null, "荧石"], ["荧石", null, "荧石"]],
        "ingredients": [["荧石", 7]]
    },
    "萤石靴子": {
        "type": "盔甲锻造台",
        "map": [[null, null, null], ["荧石", null, "荧石"], ["荧石", null, "荧石"]],
        "ingredients": [["荧石", 4]]
    },
    "农夫的靴子": {
        "type": "盔甲锻造台",
        "map": [[null, null, null], ["干草捆", null, "干草捆"], ["干草捆", null, "干草捆"]],
        "ingredients": [["干草捆", 4]]
    },
    "践踏者之靴": {
        "type": "盔甲锻造台",
        "map": [[null, null, null], ["黄色羊毛", null, "黄色羊毛"], ["活塞", null, "活塞"]],
        "ingredients": [["黄色羊毛", 2], ["活塞", 2]]
    },
    "灵魂绑定头盔": {
        "type": "魔法工作台",
        "map": [[null, "来世精华", null], [null, "钻石头盔", null], [null, "来世精华", null]],
        "ingredients": [["来世精华", 2], ["钻石头盔"]]
    },
    "灵魂绑定胸甲": {
        "type": "魔法工作台",
        "map": [[null, "来世精华", null], [null, "钻石胸甲", null], [null, "来世精华", null]],
        "ingredients": [["来世精华", 2], ["钻石胸甲"]]
    },
    "灵魂绑定护腿": {
        "type": "魔法工作台",
        "map": [[null, "来世精华", null], [null, "钻石护腿", null], [null, "来世精华", null]],
        "ingredients": [["来世精华", 2], ["钻石护腿"]]
    },
    "灵魂绑定靴子": {
        "type": "魔法工作台",
        "map": [[null, "来世精华", null], [null, "钻石靴子", null], [null, "来世精华", null]],
        "ingredients": [["来世精华", 2], ["钻石靴子"]]
    },
    "磁铁": {
        "type": "冶炼炉",
        "map": [["镍锭", "铝粉", "铁粉"], ["钴锭", null, null], [null, null, null]],
        "ingredients": [["镍锭"], ["铝粉"], ["铁粉"], ["钴锭"]]
    },
    "高级电路板": {"type": "高级工作台", "ingredients": [["红石块", 2], ["青金石块", 6], ["基础电路板"]]},
    "电池": {
        "type": "增强型工作台",
        "map": [[null, "红石粉", null], ["锌锭", "硫酸盐", "铜锭"], ["锌锭", "硫酸盐", "铜锭"]],
        "ingredients": [["红石粉"], ["锌锭", 2], ["硫酸盐", 2], ["铜锭", 2]]
    },
    "钢推进器": {
        "type": "增强型工作台",
        "map": [[null, "红石粉", null], ["铝青铜锭", "铝青铜锭", "铝青铜锭"], ["钢板", "火焰弹", "钢板"]],
        "ingredients": [["红石粉"], ["铝青铜锭", 3], ["钢板", 2], ["火焰弹"]]
    },
    "能量水晶": {
        "type": "增强型工作台",
        "map": [["红石粉", "人造蓝宝石", "红石粉"], ["人造蓝宝石", "人造钻石", "人造蓝宝石"], ["红石粉", "人造蓝宝石", "红石粉"]],
        "ingredients": [["红石粉", 4], ["人造蓝宝石", 4], ["人造钻石"]]
    },
    "太阳能板": {"type": "高级工作台", "ingredients": [["玻璃", 3], ["硅", 3], ["硅铁", 3]]},
    "电磁铁": {
        "type": "增强型工作台",
        "map": [["镍锭", "磁铁", "钴锭"], [null, "电池", null], [null, null, null]],
        "ingredients": [["镍锭"], ["磁铁"], ["钴锭"], ["电池"]]
    },
    "电动马达": {
        "type": "增强型工作台",
        "map": [["铜线", "铜线", "铜线"], [null, "电磁铁", null], ["铜线", "铜线", "铜线"]],
        "ingredients": [["铜线", 6], ["电磁铁"]]
    },
    "加热线圈": {
        "type": "增强型工作台",
        "map": [["铜线", "铜线", "铜线"], ["铜线", "电动马达", "铜线"], ["铜线", "铜线", "铜线"]],
        "ingredients": [["铜线", 8], ["电动马达"]]
    },
    "铜线": {
        "type": "增强型工作台",
        "map": [[null, null, null], ["铜锭", "铜锭", "铜锭"], [null, null, null]],
        "ingredients": [["铜锭", 3]],
        "count": 8
    },
    "钢化玻璃": {
        "type": "增强型工作台",
        "map": [["玻璃", "玻璃", "玻璃"], ["玻璃", "钢筋板", "玻璃"], ["玻璃", "玻璃", "玻璃"]],
        "ingredients": [["玻璃", 8], ["钢筋板"]],
        "count": 16
    },
    "太阳能阵列": {"type": "高级工作台", "ingredients": [["钢化玻璃", 6], ["太阳能板", 3]]},
    "冷却装置": {
        "type": "增强型工作台",
        "map": [["冰", "冰", "冰"], ["铝锭", "电动马达", "铝锭"], ["冰", "冰", "冰"]],
        "ingredients": [["冰", 6], ["铝锭", 2], ["电动马达"]]
    },
    "防凋灵黑曜石": {
        "type": "增强型工作台",
        "map": [["铅锭", "黑曜石", "铅锭"], ["黑曜石", "钢化玻璃", "黑曜石"], ["铅锭", "黑曜石", "铅锭"]],
        "ingredients": [["铅锭", 4], ["黑曜石", 4], ["钢化玻璃"]],
        "count": 4
    },
    "防凋灵玻璃": {
        "type": "增强型工作台",
        "map": [["铅锭", "防凋灵黑曜石", "铅锭"], ["防凋灵黑曜石", "钢化玻璃", "防凋灵黑曜石"], ["铅锭", "防凋灵黑曜石", "铅锭"]],
        "ingredients": [["铅锭", 4], ["防凋灵黑曜石", 4], ["钢化玻璃"]],
        "count": 4
    },
    "反应堆冷却剂": {
        "type": "冰箱",
        "map": [["蓝冰", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["蓝冰"]]
    },
    "下界冰冷却剂": {
        "type": "加热压力舱",
        "map": [["浓缩下界冰", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["浓缩下界冰"]]
    },
    "筛矿": {
        "type": "淘金盘",
        "map": [["沙砾", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["沙砾"]]
    },
    "小麦粉": {
        "type": "磨石",
        "map": [["小麦", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["小麦"]]
    },
    "钢板": {
        "type": "压缩机",
        "map": [["钢锭", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["钢锭", 8]]
    },
    "锁链": {
        "type": "增强型工作台",
        "map": [[null, null, "钢锭"], [null, "钢锭", null], ["钢锭", null, null]],
        "ingredients": [["钢锭", 3]],
        "count": 8
    },
    "钩子": {
        "type": "增强型工作台",
        "map": [[null, "钢锭", null], ["钢锭", null, "钢锭"], [null, null, null]],
        "ingredients": [["钢锭", 3]]
    },
    "石块": {
        "type": "洗矿机",
        "map": [["筛矿", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["筛矿"]]
    },
    "盐": {
        "type": "洗矿机",
        "map": [["沙子", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["沙子", 2]]
    },
    "浓奶油": {
        "type": "增强型工作台",
        "map": [["奶桶", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["奶桶"]]
    },
    "黄油": {
        "type": "增强型工作台",
        "map": [["浓奶油", "盐", null], [null, null, null], [null, null, null]],
        "ingredients": [["浓奶油"], ["盐"]]
    },
    "奶酪": {
        "type": "增强型工作台",
        "map": [["奶桶", "盐", null], [null, null, null], [null, null, null]],
        "ingredients": [["奶桶"], ["盐"]]
    },
    "已粉碎的矿石": {
        "type": "矿石粉碎机",
        "map": [["筛矿", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["筛矿"]]
    },
    "粉末状的矿石": {
        "type": "矿石粉碎机",
        "map": [["已粉碎的矿石", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["已粉碎的矿石"]]
    },
    "纯矿簇": {
        "type": "洗矿机",
        "map": [["粉末状的矿石", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["粉末状的矿石"]]
    },
    "一小块铀": {
        "type": "增强型工作台",
        "map": [["一小撮铀", "一小撮铀", "一小撮铀"], ["一小撮铀", "一小撮铀", "一小撮铀"], ["一小撮铀", "一小撮铀", "一小撮铀"]],
        "ingredients": [["一小撮铀", 9]]
    },
    "一小堆铀": {"type": "高级工作台", "ingredients": [["一小块铀", 9]]},
    "布": {
        "type": "增强型工作台",
        "map": [["白色羊毛", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["白色羊毛"]],
        "count": 8
    },
    "锡罐": {
        "type": "增强型工作台",
        "map": [["锡锭", "锡锭", "锡锭"], ["锡锭", null, "锡锭"], ["锡锭", "锡锭", "锡锭"]],
        "ingredients": [["锡锭", 8]],
        "count": 4
    },
    "金块(24克拉)": {
        "type": "增强型工作台",
        "map": [["金锭(24克拉)", "金锭(24克拉)", "金锭(24克拉)"], ["金锭(24克拉)", "金锭(24克拉)", "金锭(24克拉)"], ["金锭(24克拉)", "金锭(24克拉)", "金锭(24克拉)"]],
        "ingredients": [["金锭(24克拉)", 9]]
    },
    "钢筋板": {
        "type": "压缩机",
        "map": [["强化合金锭", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["强化合金锭", 8]]
    },
    "强力胶布": {
        "type": "增强型工作台",
        "map": [["铝粉", "铝粉", "铝粉"], ["黏液球", "白色羊毛", "黏液球"], ["纸", "纸", "纸"]],
        "ingredients": [["铝粉", 3], ["黏液球", 2], ["白色羊毛"], ["纸", 3]],
        "count": 2
    },
    "塑料纸": {
        "type": "加热压力舱",
        "map": [[null, null, null], [null, "原油桶", null], [null, null, null]],
        "ingredients": [["原油桶"]]
    },
    "机器人内存核心": {
        "type": "增强型工作台",
        "map": [["黄铜锭", "橙色染色玻璃", "黄铜锭"], ["能量水晶", "锡粉", "能量水晶"], ["黄铜锭", "橙色染色玻璃", "黄铜锭"]],
        "ingredients": [["黄铜锭", 4], ["橙色染色玻璃", 2], ["能量水晶", 2], ["锡粉"]]
    },
    "有机肥料": {
        "type": "食品堆肥器",
        "map": [["有机食物", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["有机食物"]]
    },
    "大马士革钢头盔": {
        "type": "盔甲锻造台",
        "map": [["大马士革钢锭", "大马士革钢锭", "大马士革钢锭"], ["大马士革钢锭", null, "大马士革钢锭"], [null, null, null]],
        "ingredients": [["大马士革钢锭", 5]]
    },
    "大马士革钢胸甲": {
        "type": "盔甲锻造台",
        "map": [["大马士革钢锭", null, "大马士革钢锭"], ["大马士革钢锭", "大马士革钢锭", "大马士革钢锭"], ["大马士革钢锭", "大马士革钢锭", "大马士革钢锭"]],
        "ingredients": [["大马士革钢锭", 8]]
    },
    "大马士革钢护腿": {
        "type": "盔甲锻造台",
        "map": [["大马士革钢锭", "大马士革钢锭", "大马士革钢锭"], ["大马士革钢锭", null, "大马士革钢锭"], ["大马士革钢锭", null, "大马士革钢锭"]],
        "ingredients": [["大马士革钢锭", 7]]
    },
    "大马士革钢靴子": {
        "type": "盔甲锻造台",
        "map": [[null, null, null], ["大马士革钢锭", null, "大马士革钢锭"], ["大马士革钢锭", null, "大马士革钢锭"]],
        "ingredients": [["大马士革钢锭", 4]]
    },
    "强化合金头盔": {
        "type": "盔甲锻造台",
        "map": [["强化合金锭", "强化合金锭", "强化合金锭"], ["强化合金锭", null, "强化合金锭"], [null, null, null]],
        "ingredients": [["强化合金锭", 5]]
    },
    "强化合金胸甲": {
        "type": "盔甲锻造台",
        "map": [["强化合金锭", null, "强化合金锭"], ["强化合金锭", "强化合金锭", "强化合金锭"], ["强化合金锭", "强化合金锭", "强化合金锭"]],
        "ingredients": [["强化合金锭", 8]]
    },
    "强化合金护腿": {
        "type": "盔甲锻造台",
        "map": [["强化合金锭", "强化合金锭", "强化合金锭"], ["强化合金锭", null, "强化合金锭"], ["强化合金锭", null, "强化合金锭"]],
        "ingredients": [["强化合金锭", 7]]
    },
    "强化合金靴子": {
        "type": "盔甲锻造台",
        "map": [[null, null, null], ["强化合金锭", null, "强化合金锭"], ["强化合金锭", null, "强化合金锭"]],
        "ingredients": [["强化合金锭", 4]]
    },
    "仙人掌头盔": {
        "type": "盔甲锻造台",
        "map": [["仙人掌", "仙人掌", "仙人掌"], ["仙人掌", null, "仙人掌"], [null, null, null]],
        "ingredients": [["仙人掌", 5]]
    },
    "仙人掌胸甲": {
        "type": "盔甲锻造台",
        "map": [["仙人掌", null, "仙人掌"], ["仙人掌", "仙人掌", "仙人掌"], ["仙人掌", "仙人掌", "仙人掌"]],
        "ingredients": [["仙人掌", 8]]
    },
    "仙人掌护腿": {
        "type": "盔甲锻造台",
        "map": [["仙人掌", "仙人掌", "仙人掌"], ["仙人掌", null, "仙人掌"], ["仙人掌", null, "仙人掌"]],
        "ingredients": [["仙人掌", 7]]
    },
    "仙人掌靴子": {
        "type": "盔甲锻造台",
        "map": [[null, null, null], ["仙人掌", null, "仙人掌"], ["仙人掌", null, "仙人掌"]],
        "ingredients": [["仙人掌", 4]]
    },
    "锁链头盔": {
        "type": "盔甲锻造台",
        "map": [["锁链", "锁链", "锁链"], ["锁链", null, "锁链"], [null, null, null]],
        "ingredients": [["锁链", 5]]
    },
    "锁链胸甲": {
        "type": "盔甲锻造台",
        "map": [["锁链", null, "锁链"], ["锁链", "锁链", "锁链"], ["锁链", "锁链", "锁链"]],
        "ingredients": [["锁链", 8]]
    },
    "锁链护腿": {
        "type": "盔甲锻造台",
        "map": [["锁链", "锁链", "锁链"], ["锁链", null, "锁链"], ["锁链", null, "锁链"]],
        "ingredients": [["锁链", 7]]
    },
    "锁链靴子": {
        "type": "盔甲锻造台",
        "map": [[null, null, null], ["锁链", null, "锁链"], ["锁链", null, "锁链"]],
        "ingredients": [["锁链", 4]]
    },
    "镀金铁头盔": {
        "type": "盔甲锻造台",
        "map": [["镀金铁锭", "镀金铁锭", "镀金铁锭"], ["镀金铁锭", null, "镀金铁锭"], [null, null, null]],
        "ingredients": [["镀金铁锭", 5]]
    },
    "镀金铁胸甲": {
        "type": "盔甲锻造台",
        "map": [["镀金铁锭", null, "镀金铁锭"], ["镀金铁锭", "镀金铁锭", "镀金铁锭"], ["镀金铁锭", "镀金铁锭", "镀金铁锭"]],
        "ingredients": [["镀金铁锭", 8]]
    },
    "镀金铁护腿": {
        "type": "盔甲锻造台",
        "map": [["镀金铁锭", "镀金铁锭", "镀金铁锭"], ["镀金铁锭", null, "镀金铁锭"], ["镀金铁锭", null, "镀金铁锭"]],
        "ingredients": [["镀金铁锭", 7]]
    },
    "镀金铁靴子": {
        "type": "盔甲锻造台",
        "map": [[null, null, null], ["镀金铁锭", null, "镀金铁锭"], ["镀金铁锭", null, "镀金铁锭"]],
        "ingredients": [["镀金铁锭", 4]]
    },
    "潜水头盔": {"type": "盔甲锻造台", "ingredients": [["橙色羊毛", 3], ["黑色羊毛", 2], ["玻璃板"]]},
    "防化服": {"type": "盔甲锻造台", "ingredients": [["橙色羊毛", 5], ["黑色羊毛", 3]]},
    "防化护腿": {"type": "盔甲锻造台", "ingredients": [["橙色羊毛", 4], ["黑色羊毛", 3]]},
    "橡胶靴": {"type": "盔甲锻造台", "ingredients": [["黑色羊毛", 4]]},
    "金头盔": {
        "type": "盔甲锻造台",
        "map": [["金锭(12克拉)", "金锭(12克拉)", "金锭(12克拉)"], ["金锭(12克拉)", null, "金锭(12克拉)"], [null, null, null]],
        "ingredients": [["金锭(12克拉)", 5]]
    },
    "金胸甲": {
        "type": "盔甲锻造台",
        "map": [["金锭(12克拉)", null, "金锭(12克拉)"], ["金锭(12克拉)", "金锭(12克拉)", "金锭(12克拉)"], ["金锭(12克拉)", "金锭(12克拉)", "金锭(12克拉)"]],
        "ingredients": [["金锭(12克拉)", 8]]
    },
    "金护腿": {
        "type": "盔甲锻造台",
        "map": [["金锭(12克拉)", "金锭(12克拉)", "金锭(12克拉)"], ["金锭(12克拉)", null, "金锭(12克拉)"], ["金锭(12克拉)", null, "金锭(12克拉)"]],
        "ingredients": [["金锭(12克拉)", 7]]
    },
    "金靴子": {
        "type": "盔甲锻造台",
        "map": [[null, null, null], ["金锭(12克拉)", null, "金锭(12克拉)"], ["金锭(12克拉)", null, "金锭(12克拉)"]],
        "ingredients": [["金锭(12克拉)", 4]]
    },
    "铁砧护身符": {
        "type": "魔法工作台",
        "map": [["魔法结晶-III", null, "魔法结晶-III"], ["铁砧", "普通护身符", "铁砧"], ["魔法结晶-III", null, "魔法结晶-III"]],
        "ingredients": [["魔法结晶-III", 4], ["铁砧", 2], ["普通护身符"]],
        "count": 4
    },
    "矿工护身符": {
        "type": "魔法工作台",
        "map": [["魔法结晶-III", null, "魔法结晶-III"], ["人造蓝宝石", "普通护身符", "筛矿"], ["魔法结晶-III", null, "魔法结晶-III"]],
        "ingredients": [["魔法结晶-III", 4], ["人造蓝宝石"], ["普通护身符"], ["筛矿"]]
    },
    "猎人护身符": {
        "type": "魔法工作台",
        "map": [["魔法结晶-III", null, "魔法结晶-III"], ["人造蓝宝石", "普通护身符", "怪物肉干"], ["魔法结晶-III", null, "魔法结晶-III"]],
        "ingredients": [["魔法结晶-III", 4], ["人造蓝宝石"], ["普通护身符"], ["怪物肉干"]]
    },
    "岩浆行者护身符": {
        "type": "魔法工作台",
        "map": [["魔法结晶-III", null, "魔法结晶-III"], ["岩浆水晶", "普通护身符", "熔岩桶"], ["魔法结晶-III", null, "魔法结晶-III"]],
        "ingredients": [["魔法结晶-III", 4], ["岩浆水晶"], ["普通护身符"], ["熔岩桶"]],
        "count": 4
    },
    "潜水者护身符": {
        "type": "魔法工作台",
        "map": [["魔法结晶-III", null, "魔法结晶-III"], ["水桶", "普通护身符", "钓鱼竿"], ["魔法结晶-III", null, "魔法结晶-III"]],
        "ingredients": [["魔法结晶-III", 4], ["水桶"], ["普通护身符"], ["钓鱼竿"]],
        "count": 4
    },
    "天使护身符": {
        "type": "魔法工作台",
        "map": [["魔法结晶-III", null, "魔法结晶-III"], ["羽毛", "普通护身符", "羽毛"], ["魔法结晶-III", null, "魔法结晶-III"]],
        "ingredients": [["魔法结晶-III", 4], ["羽毛", 2], ["普通护身符"]]
    },
    "消防员护身符": {
        "type": "魔法工作台",
        "map": [["魔法结晶-III", null, "魔法结晶-III"], ["岩浆水晶", "普通护身符", "岩浆水晶"], ["魔法结晶-III", null, "魔法结晶-III"]],
        "ingredients": [["魔法结晶-III", 4], ["岩浆水晶", 2], ["普通护身符"]],
        "count": 4
    },
    "魔法师护身符": {
        "type": "魔法工作台",
        "map": [["末影结晶-III", null, "末影结晶-III"], ["附魔台", "普通护身符", "附魔台"], ["末影结晶-III", null, "末影结晶-III"]],
        "ingredients": [["末影结晶-III", 4], ["附魔台", 2], ["普通护身符"]]
    },
    "旅行者护身符": {
        "type": "魔法工作台",
        "map": [["魔法结晶-III", null, "魔法结晶-III"], ["元素法杖-风", "天使护身符", "元素法杖-风"], ["魔法结晶-III", null, "魔法结晶-III"]],
        "ingredients": [["魔法结晶-III", 4], ["元素法杖-风", 2], ["天使护身符"]]
    },
    "战士护身符": {
        "type": "魔法工作台",
        "map": [["魔法结晶-III", null, "魔法结晶-III"], ["强化合金锭", "普通护身符", "强化合金锭"], ["魔法结晶-III", null, "魔法结晶-III"]],
        "ingredients": [["魔法结晶-III", 4], ["强化合金锭", 2], ["普通护身符"]],
        "count": 4
    },
    "骑士护身符": {
        "type": "魔法工作台",
        "map": [["魔法结晶-III", null, "魔法结晶-III"], ["镀金铁锭", "战士护身符", "镀金铁锭"], ["魔法结晶-III", null, "魔法结晶-III"]],
        "ingredients": [["魔法结晶-III", 4], ["镀金铁锭", 2], ["战士护身符"]],
        "count": 4
    },
    "旋风护身符": {
        "type": "魔法工作台",
        "map": [["魔法结晶-III", null, "魔法结晶-III"], ["元素法杖-风", "旅行者护身符", "元素法杖-风"], ["魔法结晶-III", null, "魔法结晶-III"]],
        "ingredients": [["魔法结晶-III", 4], ["元素法杖-风", 2], ["旅行者护身符"]]
    },
    "巫师护身符": {
        "type": "魔法工作台",
        "map": [["末影结晶-III", null, "末影结晶-III"], ["魔法末影之眼", "魔法师护身符", "魔法末影之眼"], ["末影结晶-III", null, "末影结晶-III"]],
        "ingredients": [["末影结晶-III", 4], ["魔法末影之眼", 2], ["魔法师护身符"]]
    },
    "末影背包": {
        "type": "魔法工作台",
        "map": [["末影结晶-II", "皮革", "末影结晶-II"], ["皮革", "箱子", "皮革"], ["末影结晶-II", "皮革", "末影结晶-II"]],
        "ingredients": [["末影结晶-II", 4], ["皮革", 4], ["箱子"]]
    },
    "魔法末影之眼": {
        "type": "魔法工作台",
        "map": [["末影结晶-II", "末影珍珠", "末影结晶-II"], ["末影珍珠", "末影之眼", "末影珍珠"], ["末影结晶-II", "末影珍珠", "末影结晶-II"]],
        "ingredients": [["末影结晶-II", 4], ["末影珍珠", 4], ["末影之眼"]]
    },
    "元素法杖": {
        "type": "魔法工作台",
        "map": [[null, "魔法书皮", "魔法结晶-III"], [null, "木棍", "魔法书皮"], ["魔法结晶-III", null, null]],
        "ingredients": [["魔法书皮", 2], ["魔法结晶-III", 2], ["木棍"]]
    },
    "元素法杖-风": {
        "type": "魔法工作台",
        "map": [[null, "羽毛", "末影结晶-III"], [null, "元素法杖", "羽毛"], ["元素法杖", null, null]],
        "ingredients": [["羽毛", 2], ["末影结晶-III"], ["元素法杖", 2]]
    },
    "元素法杖-水": {
        "type": "魔法工作台",
        "map": [[null, "睡莲", "魔法结晶-II"], [null, "元素法杖", "睡莲"], ["元素法杖", null, null]],
        "ingredients": [["睡莲", 2], ["魔法结晶-II"], ["元素法杖", 2]]
    },
    "元素法杖-火": {
        "type": "魔法工作台",
        "map": [[null, null, "岩浆水晶"], [null, "元素法杖", null], ["元素法杖", null, null]],
        "ingredients": [["岩浆水晶"], ["元素法杖", 2]]
    },
    "元素法杖-雷": {
        "type": "古代祭坛",
        "map": [["古代符文[雷]", "末影结晶-III", "古代符文[雷]"], ["元素法杖-水", "魔法糖", "元素法杖-风"], ["古代符文[雷]", "末影结晶-III", "古代符文[雷]"]],
        "ingredients": [["古代符文[雷]", 4], ["末影结晶-III", 2], ["元素法杖-水"], ["魔法糖"], ["元素法杖-风"]]
    },
    "吸入磁铁": {
        "type": "魔法工作台",
        "map": [["魔法结晶-III", null, "魔法结晶-III"], ["末影结晶-II", "磁铁", "末影结晶-II"], ["魔法结晶-III", null, "魔法结晶-III"]],
        "ingredients": [["魔法结晶-III", 4], ["末影结晶-II", 2], ["磁铁"]]
    },
    "已修复的刷怪笼": {
        "type": "古代祭坛",
        "map": [["古代符文[末影]", "学识之瓶(满)", "来世精华"], ["学识之瓶(满)", "已损坏的刷怪笼", "学识之瓶(满)"], ["来世精华", "学识之瓶(满)", "古代符文[末影]"]],
        "ingredients": [["古代符文[末影]", 2], ["学识之瓶(满)", 4], ["来世精华", 2], ["已损坏的刷怪笼"]]
    },
    "维度传送卷轴": {
        "type": "魔法工作台",
        "map": [[null, "末影结晶-III", "魔法末影之眼"], ["末影结晶-III", "魔法书皮", "末影结晶-III"], ["魔法末影之眼", "末影结晶-III", null]],
        "ingredients": [["末影结晶-III", 4], ["魔法末影之眼", 2], ["魔法书皮"]]
    },
    "知识共享之书": {"type": "魔法工作台", "ingredients": [["羽毛"], ["玻璃瓶"], ["墨囊"], ["书与笔"], ["魔法书皮"]]},
    "学识之瓶": {
        "type": "魔法工作台",
        "map": [[null, null, null], ["魔法结晶-II", "玻璃板", "魔法结晶-II"], [null, "魔法结晶-II", null]],
        "ingredients": [["魔法结晶-II", 3], ["玻璃板"]],
        "count": 8
    },
    "古代祭坛": {
        "type": "魔法工作台",
        "map": [[null, "附魔台", null], ["魔法结晶-III", "金锭(8克拉)", "魔法结晶-III"], ["黑曜石", "金锭(8克拉)", "黑曜石"]],
        "ingredients": [["附魔台"], ["魔法结晶-III", 2], ["金锭(8克拉)", 2], ["黑曜石", 2]]
    },
    "地狱骨粉": {
        "type": "古代祭坛",
        "map": [["下界疣", "古代符文[地]", "下界疣"], ["魔法结晶-II", "骨粉", "魔法结晶-II"], ["下界疣", "烈焰粉", "下界疣"]],
        "ingredients": [["下界疣", 4], ["古代符文[地]"], ["魔法结晶-II", 2], ["骨粉"], ["烈焰粉"]]
    },
    "鞘翅鳞片": {
        "type": "古代祭坛",
        "map": [["末影结晶-III", "古代符文[气]", "末影结晶-III"], ["幻翼膜", "羽毛", "幻翼膜"], ["末影结晶-III", "古代符文[气]", "末影结晶-III"]],
        "ingredients": [["末影结晶-III", 4], ["古代符文[气]", 2], ["幻翼膜", 2], ["羽毛"]]
    },
    "鞘翅": {
        "type": "古代祭坛",
        "map": [["鞘翅鳞片", "古代符文[气]", "鞘翅鳞片"], ["古代符文[气]", "皮革外套", "古代符文[气]"], ["鞘翅鳞片", "古代符文[气]", "鞘翅鳞片"]],
        "ingredients": [["鞘翅鳞片", 4], ["古代符文[气]", 4], ["皮革外套"]]
    },
    "经验修补鞘翅": {"type": "古代祭坛", "ingredients": [["学识之瓶", 6], ["鞘翅鳞片", 2], ["鞘翅"]]},
    "灵魂绑定鞘翅": {"type": "古代祭坛", "ingredients": [["学识之瓶", 4], ["鞘翅鳞片", 2], ["来世精华"], ["鞘翅"]]},
    "不死图腾": {
        "type": "古代祭坛",
        "map": [["来世精华", "绿宝石块", "来世精华"], ["魔法结晶-III", "普通护身符", "魔法结晶-III"], ["来世精华", "绿宝石块", "来世精华"]],
        "ingredients": [["来世精华", 4], ["绿宝石块", 2], ["魔法结晶-III", 2], ["普通护身符"]]
    },
    "彩虹羊毛": {
        "type": "古代祭坛",
        "map": [["白色羊毛", "白色羊毛", "白色羊毛"], ["白色羊毛", "古代符文[虹]", "白色羊毛"], ["白色羊毛", "白色羊毛", "白色羊毛"]],
        "ingredients": [["白色羊毛", 8], ["古代符文[虹]"]],
        "count": 8
    },
    "彩虹玻璃": {
        "type": "古代祭坛",
        "map": [["白色染色玻璃", "白色染色玻璃", "白色染色玻璃"], ["白色染色玻璃", "古代符文[虹]", "白色染色玻璃"], ["白色染色玻璃", "白色染色玻璃", "白色染色玻璃"]],
        "ingredients": [["白色染色玻璃", 8], ["古代符文[虹]"]],
        "count": 8
    },
    "彩虹玻璃板": {
        "type": "古代祭坛",
        "map": [["白色染色玻璃板", "白色染色玻璃板", "白色染色玻璃板"], ["白色染色玻璃板", "古代符文[虹]", "白色染色玻璃板"], ["白色染色玻璃板", "白色染色玻璃板", "白色染色玻璃板"]],
        "ingredients": [["白色染色玻璃板", 8], ["古代符文[虹]"]],
        "count": 8
    },
    "彩虹粘土块": {
        "type": "古代祭坛",
        "map": [["白色陶瓦", "白色陶瓦", "白色陶瓦"], ["白色陶瓦", "古代符文[虹]", "白色陶瓦"], ["白色陶瓦", "白色陶瓦", "白色陶瓦"]],
        "ingredients": [["白色陶瓦", 8], ["古代符文[虹]"]],
        "count": 8
    },
    "吸入漏斗": {
        "type": "古代祭坛",
        "map": [["黑曜石", "古代符文[地]", "漏斗"], ["古代符文[末影]", "吸入磁铁", "古代符文[末影]"], ["漏斗", "古代符文[地]", "黑曜石"]],
        "ingredients": [["黑曜石", 2], ["古代符文[地]", 2], ["漏斗", 2], ["古代符文[末影]", 2], ["吸入磁铁"]]
    },
    "电力喷射背包-I": {
        "type": "高级工作台",
        "ingredients": [["硬铝锭", 4], ["钢推进器", 2], ["能量水晶"], ["小型储能电容"]]
    },
    "电力喷射背包-II": {
        "type": "高级工作台",
        "ingredients": [["焊锡锭", 4], ["钢推进器", 2], ["能量水晶"], ["小型储能电容"]]
    },
    "电力喷射背包-III": {
        "type": "高级工作台",
        "ingredients": [["银铜合金锭", 4], ["钢推进器", 2], ["能量水晶"], ["小型储能电容"]]
    },
    "电力喷射背包-IV": {
        "type": "高级工作台",
        "ingredients": [["钢锭", 4], ["钢推进器", 2], ["能量水晶"], ["小型储能电容"]]
    },
    "电力喷射背包-V": {
        "type": "高级工作台",
        "ingredients": [["大马士革钢锭", 4], ["钢推进器", 2], ["能量水晶"], ["小型储能电容"]]
    },
    "电力喷射背包-VI": {
        "type": "高级工作台",
        "ingredients": [["强化合金锭", 4], ["钢推进器", 2], ["能量水晶"], ["中型储能电容"]]
    },
    "电力喷射背包-VII": {
        "type": "高级工作台",
        "ingredients": [["黑金刚石", 4], ["钢推进器", 2], ["能量水晶"], ["巨型储能电容"]]
    },
    "降落伞": {
        "type": "增强型工作台",
        "map": [["布", "布", "布"], ["锁链", null, "锁链"], [null, null, null]],
        "ingredients": [["布", 3], ["锁链", 2]]
    },
    "全息投影仪": {
        "type": "增强型工作台",
        "map": [[null, "能量水晶", null], ["铝黄铜锭", "电动马达", "铝黄铜锭"], [null, "铝黄铜锭", null]],
        "ingredients": [["能量水晶"], ["铝黄铜锭", 3], ["电动马达"]],
        "count": 3
    },
    "多功能工具-I": {
        "type": "增强型工作台",
        "map": [["硬铝锭", null, "硬铝锭"], ["硬铝锭", "小型储能电容", "硬铝锭"], [null, "硬铝锭", null]],
        "ingredients": [["硬铝锭", 5], ["小型储能电容"]]
    },
    "多功能工具-II": {
        "type": "增强型工作台",
        "map": [["焊锡锭", null, "焊锡锭"], ["焊锡锭", "小型储能电容", "焊锡锭"], [null, "焊锡锭", null]],
        "ingredients": [["焊锡锭", 5], ["小型储能电容"]]
    },
    "多功能工具-III": {
        "type": "增强型工作台",
        "map": [["银铜合金锭", null, "银铜合金锭"], ["银铜合金锭", "小型储能电容", "银铜合金锭"], [null, "银铜合金锭", null]],
        "ingredients": [["银铜合金锭", 5], ["小型储能电容"]]
    },
    "多功能工具-IV": {
        "type": "增强型工作台",
        "map": [["钢锭", null, "钢锭"], ["钢锭", "小型储能电容", "钢锭"], [null, "钢锭", null]],
        "ingredients": [["钢锭", 5], ["小型储能电容"]]
    },
    "多功能工具-V": {
        "type": "增强型工作台",
        "map": [["大马士革钢锭", null, "大马士革钢锭"], ["大马士革钢锭", "小型储能电容", "大马士革钢锭"], [null, "大马士革钢锭", null]],
        "ingredients": [["大马士革钢锭", 5], ["小型储能电容"]]
    },
    "多功能工具-VI": {
        "type": "增强型工作台",
        "map": [["强化合金锭", null, "强化合金锭"], ["强化合金锭", "中型储能电容", "强化合金锭"], [null, "强化合金锭", null]],
        "ingredients": [["强化合金锭", 5], ["中型储能电容"]]
    },
    "多功能工具-VII": {
        "type": "增强型工作台",
        "map": [["黑金刚石", null, "黑金刚石"], ["黑金刚石", "巨型储能电容", "黑金刚石"], [null, "黑金刚石", null]],
        "ingredients": [["黑金刚石", 5], ["巨型储能电容"]]
    },
    "太阳能头盔": {
        "type": "增强型工作台",
        "map": [["强化合金锭", "光伏电池", "强化合金锭"], ["强化合金锭", null, "强化合金锭"], ["中型储能电容", null, "中型储能电容"]],
        "ingredients": [["强化合金锭", 4], ["光伏电池"], ["中型储能电容", 2]]
    },
    "夜视眼镜": {
        "type": "盔甲锻造台",
        "map": [["煤炭块", "煤炭块", "煤炭块"], ["黄绿色染色玻璃板", "煤炭块", "黄绿色染色玻璃板"], ["煤炭块", null, "煤炭块"]],
        "ingredients": [["煤炭块", 6], ["黄绿色染色玻璃板", 2]]
    },
    "喷气靴-I": {
        "type": "增强型工作台",
        "map": [[null, null, null], ["硬铝锭", "能量水晶", "硬铝锭"], ["钢推进器", "小型储能电容", "钢推进器"]],
        "ingredients": [["硬铝锭", 2], ["能量水晶"], ["钢推进器", 2], ["小型储能电容"]]
    },
    "喷气靴-II": {
        "type": "增强型工作台",
        "map": [[null, null, null], ["焊锡锭", "能量水晶", "焊锡锭"], ["钢推进器", "小型储能电容", "钢推进器"]],
        "ingredients": [["焊锡锭", 2], ["能量水晶"], ["钢推进器", 2], ["小型储能电容"]]
    },
    "喷气靴-III": {
        "type": "增强型工作台",
        "map": [[null, null, null], ["银铜合金锭", "能量水晶", "银铜合金锭"], ["钢推进器", "小型储能电容", "钢推进器"]],
        "ingredients": [["银铜合金锭", 2], ["能量水晶"], ["钢推进器", 2], ["小型储能电容"]]
    },
    "喷气靴-IV": {
        "type": "增强型工作台",
        "map": [[null, null, null], ["钢锭", "能量水晶", "钢锭"], ["钢推进器", "小型储能电容", "钢推进器"]],
        "ingredients": [["钢锭", 2], ["能量水晶"], ["钢推进器", 2], ["小型储能电容"]]
    },
    "喷气靴-V": {
        "type": "增强型工作台",
        "map": [[null, null, null], ["大马士革钢锭", "能量水晶", "大马士革钢锭"], ["钢推进器", "小型储能电容", "钢推进器"]],
        "ingredients": [["大马士革钢锭", 2], ["能量水晶"], ["钢推进器", 2], ["小型储能电容"]]
    },
    "喷气靴-VI": {
        "type": "增强型工作台",
        "map": [[null, null, null], ["强化合金锭", "能量水晶", "强化合金锭"], ["钢推进器", "中型储能电容", "钢推进器"]],
        "ingredients": [["强化合金锭", 2], ["能量水晶"], ["钢推进器", 2], ["中型储能电容"]]
    },
    "喷气靴-VII": {
        "type": "增强型工作台",
        "map": [[null, null, null], ["黑金刚石", "能量水晶", "黑金刚石"], ["钢推进器", "巨型储能电容", "钢推进器"]],
        "ingredients": [["黑金刚石", 2], ["能量水晶"], ["钢推进器", 2], ["巨型储能电容"]]
    },
    "装甲喷气靴": {
        "type": "增强型工作台",
        "map": [[null, null, null], ["钢板", "能量水晶", "钢板"], ["钢推进器", "中型储能电容", "钢推进器"]],
        "ingredients": [["钢板", 2], ["能量水晶"], ["钢推进器", 2], ["中型储能电容"]]
    },
    "末影铁砧护身符": {
        "type": "魔法工作台",
        "map": [["末影结晶-III", null, "末影结晶-III"], [null, "铁砧护身符", null], ["末影结晶-III", null, "末影结晶-III"]],
        "ingredients": [["末影结晶-III", 4], ["铁砧护身符"]],
        "count": 4
    },
    "末影矿工护身符": {
        "type": "魔法工作台",
        "map": [["末影结晶-III", null, "末影结晶-III"], [null, "矿工护身符", null], ["末影结晶-III", null, "末影结晶-III"]],
        "ingredients": [["末影结晶-III", 4], ["矿工护身符"]]
    },
    "末影猎人护身符": {
        "type": "魔法工作台",
        "map": [["末影结晶-III", null, "末影结晶-III"], [null, "猎人护身符", null], ["末影结晶-III", null, "末影结晶-III"]],
        "ingredients": [["末影结晶-III", 4], ["猎人护身符"]]
    },
    "末影岩浆行者护身符": {
        "type": "魔法工作台",
        "map": [["末影结晶-III", null, "末影结晶-III"], [null, "岩浆行者护身符", null], ["末影结晶-III", null, "末影结晶-III"]],
        "ingredients": [["末影结晶-III", 4], ["岩浆行者护身符"]],
        "count": 4
    },
    "末影潜水者护身符": {
        "type": "魔法工作台",
        "map": [["末影结晶-III", null, "末影结晶-III"], [null, "潜水者护身符", null], ["末影结晶-III", null, "末影结晶-III"]],
        "ingredients": [["末影结晶-III", 4], ["潜水者护身符"]],
        "count": 4
    },
    "末影天使护身符": {
        "type": "魔法工作台",
        "map": [["末影结晶-III", null, "末影结晶-III"], [null, "天使护身符", null], ["末影结晶-III", null, "末影结晶-III"]],
        "ingredients": [["末影结晶-III", 4], ["天使护身符"]]
    },
    "末影消防员护身符": {
        "type": "魔法工作台",
        "map": [["末影结晶-III", null, "末影结晶-III"], [null, "消防员护身符", null], ["末影结晶-III", null, "末影结晶-III"]],
        "ingredients": [["末影结晶-III", 4], ["消防员护身符"]],
        "count": 4
    },
    "末影魔法师护身符": {
        "type": "魔法工作台",
        "map": [["末影结晶-III", null, "末影结晶-III"], [null, "魔法师护身符", null], ["末影结晶-III", null, "末影结晶-III"]],
        "ingredients": [["末影结晶-III", 4], ["魔法师护身符"]]
    },
    "末影旅行者护身符": {
        "type": "魔法工作台",
        "map": [["末影结晶-III", null, "末影结晶-III"], [null, "旅行者护身符", null], ["末影结晶-III", null, "末影结晶-III"]],
        "ingredients": [["末影结晶-III", 4], ["旅行者护身符"]]
    },
    "末影战士护身符": {
        "type": "魔法工作台",
        "map": [["末影结晶-III", null, "末影结晶-III"], [null, "战士护身符", null], ["末影结晶-III", null, "末影结晶-III"]],
        "ingredients": [["末影结晶-III", 4], ["战士护身符"]],
        "count": 4
    },
    "末影骑士护身符": {
        "type": "魔法工作台",
        "map": [["末影结晶-III", null, "末影结晶-III"], [null, "骑士护身符", null], ["末影结晶-III", null, "末影结晶-III"]],
        "ingredients": [["末影结晶-III", 4], ["骑士护身符"]],
        "count": 4
    },
    "末影旋风护身符": {
        "type": "魔法工作台",
        "map": [["末影结晶-III", null, "末影结晶-III"], [null, "旋风护身符", null], ["末影结晶-III", null, "末影结晶-III"]],
        "ingredients": [["末影结晶-III", 4], ["旋风护身符"]]
    },
    "末影巫师护身符": {
        "type": "魔法工作台",
        "map": [["末影结晶-III", null, "末影结晶-III"], [null, "巫师护身符", null], ["末影结晶-III", null, "末影结晶-III"]],
        "ingredients": [["末影结晶-III", 4], ["巫师护身符"]]
    },
    "能源调节器": {
        "type": "增强型工作台",
        "map": [["银锭", "大马士革钢锭", "银锭"], ["大马士革钢锭", "电动马达", "大马士革钢锭"], ["银锭", "大马士革钢锭", "银锭"]],
        "ingredients": [["银锭", 4], ["大马士革钢锭", 4], ["电动马达"]]
    },
    "小型储能电容": {
        "type": "增强型工作台",
        "map": [["硬铝锭", "硫酸盐", "硬铝锭"], ["红石合金锭", "能源连接器", "红石合金锭"], ["硬铝锭", "红石粉", "硬铝锭"]],
        "ingredients": [["硬铝锭", 4], ["硫酸盐"], ["红石合金锭", 2], ["能源连接器"], ["红石粉"]]
    },
    "中型储能电容": {
        "type": "增强型工作台",
        "map": [["银铜合金锭", "红石合金锭", "银铜合金锭"], ["红石粉", "小型储能电容", "红石粉"], ["银铜合金锭", "红石合金锭", "银铜合金锭"]],
        "ingredients": [["银铜合金锭", 4], ["红石合金锭", 2], ["红石粉", 2], ["小型储能电容"]]
    },
    "大型储能电容": {
        "type": "增强型工作台",
        "map": [["钢锭", "红石合金锭", "钢锭"], ["红石粉", "中型储能电容", "红石粉"], ["钢锭", "红石合金锭", "钢锭"]],
        "ingredients": [["钢锭", 4], ["红石合金锭", 2], ["红石粉", 2], ["中型储能电容"]]
    },
    "巨型储能电容": {
        "type": "增强型工作台",
        "map": [["强化合金锭", "红石合金锭", "强化合金锭"], ["红石粉", "大型储能电容", "红石粉"], ["强化合金锭", "红石合金锭", "强化合金锭"]],
        "ingredients": [["强化合金锭", 4], ["红石合金锭", 2], ["红石粉", 2], ["大型储能电容"]]
    },
    "黑金刚石镶边储能电容": {
        "type": "增强型工作台",
        "map": [["黑金刚石", "红石合金锭", "黑金刚石"], ["红石粉", "巨型储能电容", "红石粉"], ["黑金刚石", "红石合金锭", "黑金刚石"]],
        "ingredients": [["黑金刚石", 4], ["红石合金锭", 2], ["红石粉", 2], ["巨型储能电容"]]
    },
    "太阳能发电机": {"type": "高级工作台", "ingredients": [["太阳能板", 3], ["铝锭", 3], ["电动马达"]]},
    "高级太阳能发电机": {"type": "高级工作台", "ingredients": [["太阳能发电机", 4], ["铝锭", 4], ["红石粉"]]},
    "黑金刚石太阳能发电机": {"type": "高级工作台", "ingredients": [["高级太阳能发电机", 4], ["铝锭", 4], ["黑金刚石"]]},
    "充能太阳能发电机": {"type": "高级工作台", "ingredients": [["黑金刚石太阳能发电机", 4], ["起泡锭", 4], ["电磁铁"]]},
    "充电台": {
        "type": "增强型工作台",
        "map": [[null, "电磁铁", null], ["电池", "工作台", "电池"], [null, "小型储能电容", null]],
        "ingredients": [["电磁铁"], ["电池", 2], ["工作台"], ["小型储能电容"]]
    },
    "电炉": {
        "type": "增强型工作台",
        "map": [[null, "熔炉", null], ["镀金铁锭", "加热线圈", "镀金铁锭"], ["镀金铁锭", "电动马达", "镀金铁锭"]],
        "ingredients": [["熔炉"], ["镀金铁锭", 4], ["加热线圈"], ["电动马达"]]
    },
    "电炉-II": {
        "type": "增强型工作台",
        "map": [[null, "电动马达", null], ["镀金铁锭", "电炉", "镀金铁锭"], ["镀金铁锭", "加热线圈", "镀金铁锭"]],
        "ingredients": [["电动马达"], ["镀金铁锭", 4], ["电炉"], ["加热线圈"]]
    },
    "电炉-III": {
        "type": "增强型工作台",
        "map": [[null, "电动马达", null], ["钢锭", "电炉-II", "钢锭"], ["镀金铁锭", "加热线圈", "镀金铁锭"]],
        "ingredients": [["电动马达"], ["钢锭", 2], ["电炉-II"], ["镀金铁锭", 2], ["加热线圈"]]
    },
    "电动淘金机": {
        "type": "增强型工作台",
        "map": [[null, "淘金盘", null], ["燧石", "电动马达", "燧石"], ["铝锭", "铝锭", "铝锭"]],
        "ingredients": [["淘金盘"], ["燧石", 2], ["电动马达"], ["铝锭", 3]]
    },
    "电动淘金机-II": {"type": "高级工作台", "ingredients": [["硬铝锭", 3], ["铁锭", 2], ["淘金盘"], ["电动淘金机"]]},
    "电动淘金机-III": {
        "type": "高级工作台",
        "ingredients": [["钴锭", 2], ["电动马达", 2], ["起泡锭"], ["淘金盘"], ["电动淘金机-II"]]
    },
    "电动洗矿机": {
        "type": "增强型工作台",
        "map": [[null, "水桶", null], ["电磁铁", "电动淘金机", "电磁铁"], ["铜锭", "铜锭", "铜锭"]],
        "ingredients": [["水桶"], ["电磁铁", 2], ["电动淘金机"], ["铜锭", 3]]
    },
    "电动洗矿机-II": {
        "type": "高级工作台",
        "ingredients": [["大马士革钢锭", 3], ["电磁铁", 2], ["水桶"], ["电动洗矿机"]]
    },
    "电动洗矿机-III": {
        "type": "高级工作台",
        "ingredients": [["科林斯青铜锭", 2], ["电磁铁", 2], ["水桶"], ["起泡锭"], ["电动洗矿机-II"]]
    },
    "电动铸锭机": {
        "type": "增强型工作台",
        "map": [[null, "打火石", null], ["加热线圈", "电动洗矿机", "加热线圈"], ["大马士革钢锭", "电动马达", "大马士革钢锭"]],
        "ingredients": [["打火石"], ["加热线圈", 2], ["电动洗矿机"], ["大马士革钢锭", 2], ["电动马达"]]
    },
    "电动铸锭机-II": {
        "type": "高级工作台",
        "ingredients": [["镀金铁锭", 2], ["黄铜锭", 2], ["加热线圈", 2], ["电动马达"], ["打火石"], ["电动铸锭机"]]
    },
    "电动铸锭机-III": {
        "type": "高级工作台",
        "ingredients": [["镀金铁锭", 2], ["黄铜锭", 2], ["加热线圈", 2], ["起泡锭"], ["打火石"], ["电动铸锭机-II"]]
    },
    "电动坩埚": {
        "type": "增强型工作台",
        "map": [["铅锭", "坩埚", "铅锭"], ["大马士革钢锭", "加热线圈", "大马士革钢锭"], ["铅锭", "巨型储能电容", "铅锭"]],
        "ingredients": [["铅锭", 4], ["坩埚"], ["大马士革钢锭", 2], ["加热线圈"], ["巨型储能电容"]]
    },
    "电动坩埚-II": {
        "type": "增强型工作台",
        "map": [["科林斯青铜锭", "电动坩埚", "科林斯青铜锭"], ["大马士革钢锭", "电动马达", "大马士革钢锭"], ["铅锭", "加热线圈", "铅锭"]],
        "ingredients": [["科林斯青铜锭", 2], ["电动坩埚"], ["大马士革钢锭", 2], ["电动马达"], ["铅锭", 2], ["加热线圈"]]
    },
    "电动坩埚-III": {
        "type": "增强型工作台",
        "map": [["科林斯青铜锭", "电动坩埚-II", "科林斯青铜锭"], ["钢板", "能量水晶", "钢板"], ["铅锭", "铅锭", "铅锭"]],
        "ingredients": [["科林斯青铜锭", 2], ["电动坩埚-II"], ["钢板", 2], ["能量水晶"], ["铅锭", 3]]
    },
    "电力碎矿机": {
        "type": "增强型工作台",
        "map": [[null, "钻石镐", null], ["镀金铁锭", "加热线圈", "镀金铁锭"], ["镀金铁锭", "电动马达", "镀金铁锭"]],
        "ingredients": [["钻石镐"], ["镀金铁锭", 4], ["加热线圈"], ["电动马达"]]
    },
    "电力碎矿机-II": {
        "type": "高级工作台",
        "ingredients": [["镀金铁锭", 2], ["加热线圈", 2], ["起泡锭"], ["钻石镐"], ["电力碎矿机"]]
    },
    "加热压力仓": {"type": "高级工作台", "ingredients": [["铅锭", 6], ["加热线圈"], ["电动马达"], ["玻璃"]]},
    "加热压力仓-II": {
        "type": "高级工作台",
        "ingredients": [["铅锭", 4], ["强化合金锭", 2], ["加热线圈"], ["电动马达"], ["加热压力仓"]]
    },
    "电力打粉机": {
        "type": "增强型工作台",
        "map": [[null, "电力碎矿机", null], ["铅锭", "中型储能电容", "铅锭"], ["铅锭", "加热线圈", "铅锭"]],
        "ingredients": [["电力碎矿机"], ["铅锭", 4], ["中型储能电容"], ["加热线圈"]]
    },
    "煤发电机": {
        "type": "增强型工作台",
        "map": [["加热线圈", "熔炉", "加热线圈"], ["镍锭", "电动马达", "镍锭"], [null, "镍锭", null]],
        "ingredients": [["加热线圈", 2], ["熔炉"], ["镍锭", 3], ["电动马达"]]
    },
    "煤发电机-II": {
        "type": "高级工作台",
        "ingredients": [["硬化金属", 2], ["岩浆块", 2], ["电动马达"], ["加热线圈"], ["煤发电机"]]
    },
    "生物反应器": {"type": "高级工作台", "ingredients": [["铝黄铜锭", 3], ["加热线圈", 2], ["电动马达"], ["搅拌机"]]},
    "自动烘干机": {
        "type": "增强型工作台",
        "map": [[null, null, null], ["加热线圈", "烟熏炉", "加热线圈"], [null, "营火", null]],
        "ingredients": [["加热线圈", 2], ["烟熏炉"], ["营火"]]
    },
    "电力碳压机": {
        "type": "高级工作台",
        "ingredients": [["大马士革钢锭", 3], ["活塞", 2], ["电动马达"], ["中型储能电容"]]
    },
    "电力碳压机-II": {
        "type": "高级工作台",
        "ingredients": [["大马士革钢锭", 5], ["粘性活塞", 2], ["电力碳压机"], ["大型储能电容"]]
    },
    "镁盐发电机": {"type": "高级工作台", "ingredients": [["硬铝锭", 3], ["压缩碳", 2], ["电动马达"], ["水桶"]]},
    "自动附魔机": {
        "type": "增强型工作台",
        "map": [[null, "附魔台", null], ["黑金刚石", "电动马达", "黑金刚石"], ["防凋灵黑曜石", "防凋灵黑曜石", "防凋灵黑曜石"]],
        "ingredients": [["附魔台"], ["黑金刚石", 2], ["电动马达"], ["防凋灵黑曜石", 3]]
    },
    "自动袪魔机": {
        "type": "高级工作台",
        "ingredients": [["防凋灵黑曜石", 3], ["黑金刚石", 2], ["红石粉", 2], ["铁砧"], ["自动附魔机"]]
    },
    "自动铁砧": {
        "type": "增强型工作台",
        "map": [[null, "铁砧", null], ["强化合金锭", "电动马达", "强化合金锭"], ["铁块", "铁块", "铁块"]],
        "ingredients": [["铁砧"], ["强化合金锭", 2], ["电动马达"], ["铁块", 3]]
    },
    "自动铁砧-II": {"type": "高级工作台", "ingredients": [["铁块", 3], ["钢板", 2], ["加热线圈"], ["自动铁砧"]]},
    "万用表": {
        "type": "增强型工作台",
        "map": [["铜锭", null, "铜锭"], [null, "红石合金锭", null], [null, "金锭(6克拉)", null]],
        "ingredients": [["铜锭", 2], ["红石合金锭"], ["金锭(6克拉)"]]
    },
    "可编程式机器人(普通)": {
        "type": "增强型工作台",
        "map": [["塑料纸", "机器人内存核心", "塑料纸"], ["煤发电机", "电动马达", "箱子"], ["塑料纸", "塑料纸", "塑料纸"]],
        "ingredients": [["塑料纸", 5], ["机器人内存核心"], ["煤发电机"], ["电动马达"], ["箱子"]]
    },
    "可编程式机器人(矿工)": {
        "type": "增强型工作台",
        "map": [[null, null, null], ["钻石镐", "可编程式机器人(普通)", "钻石镐"], [null, "电动马达", null]],
        "ingredients": [["钻石镐", 2], ["可编程式机器人(普通)"], ["电动马达"]]
    },
    "可编程式机器人(农夫)": {
        "type": "增强型工作台",
        "map": [[null, null, null], ["钻石锄", "可编程式机器人(普通)", "钻石锄"], [null, "电动马达", null]],
        "ingredients": [["钻石锄", 2], ["可编程式机器人(普通)"], ["电动马达"]]
    },
    "可编程式机器人(樵夫)": {
        "type": "增强型工作台",
        "map": [[null, null, null], ["钻石斧", "可编程式机器人(普通)", "钻石斧"], [null, "电动马达", null]],
        "ingredients": [["钻石斧", 2], ["可编程式机器人(普通)"], ["电动马达"]]
    },
    "可编程式机器人(渔夫)": {
        "type": "增强型工作台",
        "map": [[null, null, null], ["钓鱼竿", "可编程式机器人(普通)", "钓鱼竿"], [null, "电动马达", null]],
        "ingredients": [["钓鱼竿", 2], ["可编程式机器人(普通)"], ["电动马达"]]
    },
    "可编程式机器人(屠夫)": {
        "type": "增强型工作台",
        "map": [[null, "GPS发射器", null], ["钻石剑", "可编程式机器人(普通)", "钻石剑"], [null, "电动马达", null]],
        "ingredients": [["GPS发射器"], ["钻石剑", 2], ["可编程式机器人(普通)"], ["电动马达"]]
    },
    "机器人交互接口(物品)": {
        "type": "增强型工作台",
        "map": [["塑料纸", "钢锭", "塑料纸"], ["钢锭", "基础电路板", "蓝色染色玻璃"], ["塑料纸", "钢锭", "塑料纸"]],
        "ingredients": [["塑料纸", 4], ["钢锭", 3], ["基础电路板"], ["蓝色染色玻璃"]]
    },
    "机器人交互接口(燃料)": {
        "type": "增强型工作台",
        "map": [["塑料纸", "钢锭", "塑料纸"], ["红色染色玻璃", "基础电路板", "钢锭"], ["塑料纸", "钢锭", "塑料纸"]],
        "ingredients": [["塑料纸", 4], ["钢锭", 3], ["红色染色玻璃"], ["基础电路板"]]
    },
    "高级可编程式机器人(普通)": {
        "type": "增强型工作台",
        "map": [["塑料纸", "机器人内存核心", "塑料纸"], ["燃烧反应机", "可编程式机器人(普通)", "箱子"], ["塑料纸", "能量水晶", "塑料纸"]],
        "ingredients": [["塑料纸", 4], ["机器人内存核心"], ["燃烧反应机"], ["可编程式机器人(普通)"], ["箱子"], ["能量水晶"]]
    },
    "高级可编程式机器人(渔夫)": {
        "type": "增强型工作台",
        "map": [[null, null, null], ["钓鱼竿", "高级可编程式机器人(普通)", "钓鱼竿"], [null, "电动马达", null]],
        "ingredients": [["钓鱼竿", 2], ["高级可编程式机器人(普通)"], ["电动马达"]]
    },
    "高级可编程式机器人(屠夫)": {
        "type": "增强型工作台",
        "map": [[null, "GPS发射器", null], ["钻石剑", "高级可编程式机器人(普通)", "钻石剑"], [null, "电动马达", null]],
        "ingredients": [["GPS发射器"], ["钻石剑", 2], ["高级可编程式机器人(普通)"], ["电动马达"]]
    },
    "高级可编程式机器人(农夫)": {
        "type": "增强型工作台",
        "map": [[null, "GPS发射器", null], ["钻石锄", "高级可编程式机器人(普通)", "钻石锄"], [null, "电动马达", null]],
        "ingredients": [["GPS发射器"], ["钻石锄", 2], ["高级可编程式机器人(普通)"], ["电动马达"]]
    },
    "可授权式可编程式机器人(普通)": {
        "type": "增强型工作台",
        "map": [["塑料纸", "机器人内存核心", "塑料纸"], ["核反应堆", "高级可编程式机器人(普通)", "箱子"], ["起泡锭", "能量水晶", "起泡锭"]],
        "ingredients": [["塑料纸", 2], ["机器人内存核心"], ["核反应堆"], ["高级可编程式机器人(普通)"], ["箱子"], ["起泡锭", 2], ["能量水晶"]]
    },
    "可授权式可编程式机器人(渔夫)": {
        "type": "增强型工作台",
        "map": [[null, null, null], ["钓鱼竿", "可授权式可编程式机器人(普通)", "钓鱼竿"], [null, "电动马达", null]],
        "ingredients": [["钓鱼竿", 2], ["可授权式可编程式机器人(普通)"], ["电动马达"]]
    },
    "可授权式可编程式机器人(屠夫)": {
        "type": "增强型工作台",
        "map": [[null, "黑金刚石GPS发射器", null], ["钻石剑", "可授权式可编程式机器人(普通)", "钻石剑"], [null, "电动马达", null]],
        "ingredients": [["黑金刚石GPS发射器"], ["钻石剑", 2], ["可授权式可编程式机器人(普通)"], ["电动马达"]]
    },
    "炼油厂": {"type": "高级工作台", "ingredients": [["钢化玻璃", 4], ["红石合金锭", 2], ["活塞", 2], ["电动马达"]]},
    "岩浆发电机": {
        "type": "增强型工作台",
        "map": [[null, "金锭(16克拉)", null], ["大马士革钢锭", "电动马达", "大马士革钢锭"], ["加热线圈", "大马士革钢锭", "加热线圈"]],
        "ingredients": [["金锭(16克拉)"], ["大马士革钢锭", 3], ["电动马达"], ["加热线圈", 2]]
    },
    "岩浆发电机-II": {
        "type": "高级工作台",
        "ingredients": [["科林斯青铜锭", 3], ["压缩碳", 3], ["加热线圈", 2], ["岩浆发电机"]]
    },
    "燃烧反应机": {
        "type": "增强型工作台",
        "map": [[null, "钢锭", null], ["钢锭", "电动马达", "钢锭"], ["加热线圈", "钢锭", "加热线圈"]],
        "ingredients": [["钢锭", 4], ["电动马达"], ["加热线圈", 2]]
    },
    "食品加工机": {
        "type": "增强型工作台",
        "map": [["银铜合金锭", "银锭", "银铜合金锭"], ["锡罐", "小型储能电容", "锡罐"], [null, "电动马达", null]],
        "ingredients": [["银铜合金锭", 2], ["银锭"], ["锡罐", 2], ["小型储能电容"], ["电动马达"]]
    },
    "自动喂食机": {
        "type": "增强型工作台",
        "map": [["金锭(18克拉)", "锡罐", "金锭(18克拉)"], ["电动马达", "干草捆", "电动马达"], ["铅锭", "食品加工机", "铅锭"]],
        "ingredients": [["金锭(18克拉)", 2], ["锡罐"], ["电动马达", 2], ["干草捆"], ["铅锭", 2], ["食品加工机"]]
    },
    "动物生长加速器": {
        "type": "增强型工作台",
        "map": [[null, "起泡锭", null], ["电动马达", "有机食物", "电动马达"], ["强化合金锭", "自动喂食机", "强化合金锭"]],
        "ingredients": [["起泡锭"], ["电动马达", 2], ["有机食物"], ["强化合金锭", 2], ["自动喂食机"]]
    },
    "经验收集器": {
        "type": "增强型工作台",
        "map": [[null, "起泡锭", null], ["防凋灵黑曜石", "自动附魔机", "防凋灵黑曜石"], ["铝青铜锭", "电动马达", "铝青铜锭"]],
        "ingredients": [["起泡锭"], ["防凋灵黑曜石", 2], ["自动附魔机"], ["铝青铜锭", 2], ["电动马达"]]
    },
    "食品堆肥器": {
        "type": "增强型工作台",
        "map": [["大马士革钢锭", "食品加工机", "大马士革钢锭"], ["锡罐", "中型储能电容", "锡罐"], [null, "电动马达", null]],
        "ingredients": [["大马士革钢锭", 2], ["食品加工机"], ["锡罐", 2], ["中型储能电容"], ["电动马达"]]
    },
    "食品堆肥器-II": {
        "type": "高级工作台",
        "ingredients": [["硬化金属", 2], ["电动马达", 2], ["强化合金锭"], ["电磁铁"], ["食品堆肥器"]]
    },
    "作物生长加速器": {
        "type": "增强型工作台",
        "map": [[null, "起泡锭", null], ["电动马达", "可编程式机器人(农夫)", "电动马达"], ["电磁铁", "动物生长加速器", "电磁铁"]],
        "ingredients": [["起泡锭"], ["电动马达", 2], ["可编程式机器人(农夫)"], ["电磁铁", 2], ["动物生长加速器"]]
    },
    "作物生长加速器-II": {
        "type": "高级工作台",
        "ingredients": [["电动马达", 2], ["电磁铁", 2], ["起泡锭"], ["高级电路板"], ["作物生长加速器"]]
    },
    "冰箱": {
        "type": "增强型工作台",
        "map": [[null, "银锭", null], ["电动马达", "浮冰", "电动马达"], ["冷却装置", "中型储能电容", "冷却装置"]],
        "ingredients": [["银锭"], ["电动马达", 2], ["浮冰"], ["冷却装置", 2], ["中型储能电容"]]
    },
    "冰箱-II": {
        "type": "高级工作台",
        "ingredients": [["冷却装置", 2], ["电磁铁", 2], ["银锭"], ["铝黄铜锭"], ["冰箱"]]
    },
    "核反应堆": {
        "type": "增强型工作台",
        "map": [["起泡锭", "黑金刚石镶边储能电容", "起泡锭"], ["钢筋板", "冷却装置", "钢筋板"], ["铅锭", "钢筋板", "铅锭"]],
        "ingredients": [["起泡锭", 2], ["黑金刚石镶边储能电容"], ["钢筋板", 3], ["冷却装置"], ["铅锭", 2]]
    },
    "下界之星反应堆": {
        "type": "增强型工作台",
        "map": [["钚铀混合氧化物核燃料", "黑金刚石镶边储能电容", "钚铀混合氧化物核燃料"], ["钢筋板", "下界之星", "钢筋板"], ["科林斯青铜锭", "钢筋板", "科林斯青铜锭"]],
        "ingredients": [["钚铀混合氧化物核燃料", 2], ["黑金刚石镶边储能电容"], ["钢筋板", 3], ["下界之星"], ["科林斯青铜锭", 2]]
    },
    "自动合成机": {"type": "高级工作台", "ingredients": [["货运马达", 2], ["起泡锭"], ["电动马达"], ["工作台"]]},
    "反应堆访问接口": {
        "type": "增强型工作台",
        "map": [[null, "起泡锭", null], ["铅锭", "货运马达", "铅锭"], [null, "电动马达", null]],
        "ingredients": [["起泡锭"], ["铅锭", 2], ["货运马达"], ["电动马达"]]
    },
    "流体泵": {
        "type": "增强型工作台",
        "map": [[null, "中型储能电容", null], ["铁桶", "货运马达", "铁桶"], [null, "原油泵", null]],
        "ingredients": [["中型储能电容"], ["铁桶", 2], ["货运马达"], ["原油泵"]]
    },
    "碳压机": {
        "type": "增强型工作台",
        "map": [["碳", "电动马达", "碳"], ["碳", "加热压力舱", "碳"], ["加热线圈", "黑金刚石", "加热线圈"]],
        "ingredients": [["碳", 4], ["电动马达"], ["加热压力舱"], ["加热线圈", 2], ["黑金刚石"]]
    },
    "碳压机-II": {
        "type": "增强型工作台",
        "map": [["黑金刚石", "电动马达", "黑金刚石"], ["碳", "碳压机", "碳"], ["加热线圈", "电磁铁", "加热线圈"]],
        "ingredients": [["黑金刚石", 2], ["电动马达"], ["碳", 2], ["碳压机"], ["加热线圈", 2], ["电磁铁"]]
    },
    "碳压机-III": {
        "type": "增强型工作台",
        "map": [["黑金刚石", "电动马达", "黑金刚石"], ["强化合金锭", "碳压机-II", "强化合金锭"], ["加热线圈", "电磁铁", "加热线圈"]],
        "ingredients": [["黑金刚石", 2], ["电动马达"], ["强化合金锭", 2], ["碳压机-II"], ["加热线圈", 2], ["电磁铁"]]
    },
    "电力冶炼机": {
        "type": "高级工作台",
        "ingredients": [["地狱砖块", 2], ["镀金铁锭", 2], ["加热线圈", 2], ["电动马达", 2], ["电动铸锭机"]]
    },
    "电力冶炼机-II": {
        "type": "高级工作台",
        "ingredients": [["大马士革钢锭", 2], ["镀金铁锭", 2], ["加热线圈", 2], ["电动马达"], ["能量水晶"], ["电力冶炼机"]]
    },
    "凋灵汇编器": {
        "type": "高级工作台",
        "ingredients": [["起泡锭", 2], ["防凋灵黑曜石", 2], ["强化合金锭"], ["机器人内存核心"], ["电动马达"], ["下界之星"], ["黑金刚石镶边储能电容"]]
    },
    "GPS发射器": {
        "type": "增强型工作台",
        "map": [[null, null, "电磁铁"], ["钢锭", "高级电路板", "钢锭"], ["钢锭", "电动马达", "钢锭"]],
        "ingredients": [["电磁铁"], ["钢锭", 4], ["高级电路板"], ["电动马达"]]
    },
    "高级GPS发射器": {
        "type": "增强型工作台",
        "map": [["GPS发射器", "青铜锭", "GPS发射器"], ["青铜锭", "碳", "青铜锭"], ["GPS发射器", "青铜锭", "GPS发射器"]],
        "ingredients": [["GPS发射器", 4], ["青铜锭", 4], ["碳"]]
    },
    "充能GPS发射器": {
        "type": "增强型工作台",
        "map": [["黑金刚石GPS发射器", "起泡锭", "黑金刚石GPS发射器"], ["镍锭", "黑金刚石", "镍锭"], ["黑金刚石GPS发射器", "起泡锭", "黑金刚石GPS发射器"]],
        "ingredients": [["黑金刚石GPS发射器", 4], ["起泡锭", 2], ["镍锭", 2], ["黑金刚石"]]
    },
    "GPS控制面板": {
        "type": "增强型工作台",
        "map": [[null, null, "电磁铁"], ["钴锭", "高级电路板", "钴锭"], ["铝黄铜锭", "铝黄铜锭", "铝黄铜锭"]],
        "ingredients": [["电磁铁"], ["钴锭", 2], ["高级电路板"], ["铝黄铜锭", 3]]
    },
    "GPS设置路径点工具": {
        "type": "增强型工作台",
        "map": [[null, "电磁铁", null], ["青金石", "基础电路板", "青金石"], ["红石粉", "红石合金锭", "红石粉"]],
        "ingredients": [["电磁铁"], ["青金石", 2], ["基础电路板"], ["红石粉", 2], ["红石合金锭"]]
    },
    "GPS应急发射器": {
        "type": "增强型工作台",
        "map": [[null, "电磁铁", null], [null, "GPS发射器", null], [null, "来世精华", null]],
        "ingredients": [["电磁铁"], ["GPS发射器"], ["来世精华"]]
    },
    "GPS地形扫描器": {
        "type": "增强型工作台",
        "map": [[null, null, "电磁铁"], [null, "钢锭", "钢锭"], ["电磁铁", "电动马达", "电磁铁"]],
        "ingredients": [["电磁铁", 3], ["钢锭", 2], ["电动马达"]]
    },
    "便携式资源扫描器": {
        "type": "增强型工作台",
        "map": [["电磁铁", "指南针", "电磁铁"], ["钢锭", "GPS设置路径点工具", "钢锭"], ["焊锡锭", "电动马达", "焊锡锭"]],
        "ingredients": [["电磁铁", 2], ["指南针"], ["钢锭", 2], ["GPS设置路径点工具"], ["焊锡锭", 2], ["电动马达"]]
    },
    "原油泵": {
        "type": "增强型工作台",
        "map": [["钢锭", "中型储能电容", "钢锭"], ["钢锭", "电动马达", "钢锭"], [null, "铁桶", null]],
        "ingredients": [["钢锭", 4], ["中型储能电容"], ["电动马达"], ["铁桶"]]
    },
    "GEO矿机": {
        "type": "高级工作台",
        "ingredients": [["钻石镐", 2], ["强化合金锭", 2], ["电动马达"], ["原油泵"], ["中型储能电容"]]
    },
    "GPS传送塔": {"type": "高级工作台", "ingredients": [["锌锭", 4], ["玻璃", 4], ["加热线圈"]], "count": 8},
    "GPS传送矩阵": {
        "type": "增强型工作台",
        "map": [["GPS信号塔", "强化合金锭", "GPS信号塔"], ["电磁铁", "GPS控制面板", "电磁铁"], ["GPS信号塔", "强化合金锭", "GPS信号塔"]],
        "ingredients": [["GPS信号塔", 4], ["强化合金锭", 2], ["电磁铁", 2], ["GPS控制面板"]]
    },
    "GPS激活设备(公共)": {
        "type": "增强型工作台",
        "map": [[null, "石头压力板", null], ["红石粉", "GPS发射器", "红石粉"], ["银铜合金锭", "银铜合金锭", "银铜合金锭"]],
        "ingredients": [["石头压力板"], ["红石粉", 2], ["GPS发射器"], ["银铜合金锭", 3]]
    },
    "GPS激活设备(私人)": {
        "type": "增强型工作台",
        "map": [[null, "铅锭", null], ["钴锭", "GPS激活设备(公共)", "钴锭"], [null, "铅锭", null]],
        "ingredients": [["铅锭", 2], ["钴锭", 2], ["GPS激活设备(公共)"]]
    },
    "电梯板": {
        "type": "增强型工作台",
        "map": [[null, "石头压力板", null], ["活塞", "电动马达", "活塞"], ["铝青铜锭", "铝青铜锭", "铝青铜锭"]],
        "ingredients": [["石头压力板"], ["活塞", 2], ["电动马达"], ["铝青铜锭", 3]],
        "count": 2
    },
    "货运马达": {
        "type": "增强型工作台",
        "map": [["钢化玻璃", "电磁铁", "钢化玻璃"], ["银锭", "电动马达", "银锭"], ["钢化玻璃", "电磁铁", "钢化玻璃"]],
        "ingredients": [["钢化玻璃", 4], ["电磁铁", 2], ["银锭", 2], ["电动马达"]],
        "count": 4
    },
    "货运管理器": {
        "type": "增强型工作台",
        "map": [[null, "全息投影仪", null], ["钢筋板", "货运马达", "钢筋板"], ["铝青铜锭", "机器人内存核心", "铝青铜锭"]],
        "ingredients": [["全息投影仪"], ["钢筋板", 2], ["货运马达"], ["铝青铜锭", 2], ["机器人内存核心"]]
    },
    "货运节点(连接器)": {
        "type": "增强型工作台",
        "map": [["青铜锭", "银锭", "青铜锭"], ["银锭", "货运马达", "银锭"], ["青铜锭", "银锭", "青铜锭"]],
        "ingredients": [["青铜锭", 4], ["银锭", 4], ["货运马达"]],
        "count": 4
    },
    "货运节点(输入)": {
        "type": "增强型工作台",
        "map": [[null, "漏斗", null], ["银铜合金锭", "货运节点(连接器)", "银铜合金锭"], [null, "漏斗", null]],
        "ingredients": [["漏斗", 2], ["银铜合金锭", 2], ["货运节点(连接器)"]],
        "count": 2
    },
    "货运节点(输出)": {
        "type": "增强型工作台",
        "map": [[null, "漏斗", null], ["黄铜锭", "货运节点(连接器)", "黄铜锭"], [null, "漏斗", null]],
        "ingredients": [["漏斗", 2], ["黄铜锭", 2], ["货运节点(连接器)"]],
        "count": 2
    },
    "高级货运节点(输出)": {
        "type": "增强型工作台",
        "map": [[null, "货运马达", null], ["钴锭", "货运节点(输出)", "钴锭"], [null, "货运马达", null]],
        "ingredients": [["货运马达", 2], ["钴锭", 2], ["货运节点(输出)"]]
    },
    "垃圾箱": {
        "type": "增强型工作台",
        "map": [[null, "便携垃圾箱", null], ["铅锭", "货运马达", "铅锭"], ["铝锭", "铅锭", "铝锭"]],
        "ingredients": [["便携垃圾箱"], ["铅锭", 3], ["货运马达"], ["铝锭", 2]]
    },
    "增强型工作台": {
        "type": "多方块结构",
        "map": [[null, null, null], [null, "工作台", null], [null, "发射器", null]],
        "ingredients": [["工作台"], ["发射器"]]
    },
    "海带曲奇": {
        "type": "增强型工作台",
        "map": [[null, "干海带", null], ["干海带", "糖", "干海带"], [null, "干海带", null]],
        "ingredients": [["干海带", 4], ["糖"]]
    },
    "魔法结晶-I": {
        "type": "磨石",
        "map": [["下界疣", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["下界疣"]]
    },
    "魔法结晶-II": {
        "type": "增强型工作台",
        "map": [["魔法结晶-I", "魔法结晶-I", null], ["魔法结晶-I", "魔法结晶-I", null], [null, null, null]],
        "ingredients": [["魔法结晶-I", 4]]
    },
    "魔法结晶-III": {
        "type": "增强型工作台",
        "map": [["魔法结晶-II", "魔法结晶-II", null], ["魔法结晶-II", "魔法结晶-II", null], [null, null, null]],
        "ingredients": [["魔法结晶-II", 4]]
    },
    "末影结晶-I": {
        "type": "磨石",
        "map": [["末影之眼", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["末影之眼"]]
    },
    "末影结晶-II": {
        "type": "增强型工作台",
        "map": [["末影结晶-I", "末影结晶-I", null], ["末影结晶-I", "末影结晶-I", null], [null, null, null]],
        "ingredients": [["末影结晶-I", 4]]
    },
    "末影结晶-III": {
        "type": "增强型工作台",
        "map": [["末影结晶-II", "末影结晶-II", null], ["末影结晶-II", "末影结晶-II", null], [null, null, null]],
        "ingredients": [["末影结晶-II", 4]]
    },
    "魔法玻璃": {
        "type": "魔法工作台",
        "map": [["魔法结晶-II", "金粉", "魔法结晶-II"], ["学识之瓶(满)", "玻璃板", "学识之瓶(满)"], ["魔法结晶-II", "学识之瓶(满)", "魔法结晶-II"]],
        "ingredients": [["魔法结晶-II", 4], ["金粉"], ["学识之瓶(满)", 3], ["玻璃板"]]
    },
    "简易冶炼炉": {
        "type": "多方块结构",
        "map": [[null, "橡木栅栏", null], ["红砖块", "发射器 (朝上)", "红砖块"], [null, "打火石", null]],
        "ingredients": [["橡木栅栏"], ["红砖块", 2], ["发射器 (朝上)"], ["打火石"]]
    },
    "彩虹头盔": {
        "type": "盔甲锻造台",
        "map": [["彩虹皮革", "彩虹皮革", "彩虹皮革"], ["彩虹皮革", null, "彩虹皮革"], [null, null, null]],
        "ingredients": [["彩虹皮革", 5]]
    },
    "彩虹胸甲": {
        "type": "盔甲锻造台",
        "map": [["彩虹皮革", null, "彩虹皮革"], ["彩虹皮革", "彩虹皮革", "彩虹皮革"], ["彩虹皮革", "彩虹皮革", "彩虹皮革"]],
        "ingredients": [["彩虹皮革", 8]]
    },
    "彩虹护腿": {
        "type": "盔甲锻造台",
        "map": [["彩虹皮革", "彩虹皮革", "彩虹皮革"], ["彩虹皮革", null, "彩虹皮革"], ["彩虹皮革", null, "彩虹皮革"]],
        "ingredients": [["彩虹皮革", 7]]
    },
    "彩虹靴子": {
        "type": "盔甲锻造台",
        "map": [[null, null, null], ["彩虹皮革", null, "彩虹皮革"], ["彩虹皮革", null, "彩虹皮革"]],
        "ingredients": [["彩虹皮革", 4]]
    },
    "铁粉": {
        "type": "矿石粉碎机",
        "map": [["铁矿石", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["铁矿石"]]
    },
    "金粉": {
        "type": "矿石粉碎机",
        "map": [["金矿石", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["金矿石"]]
    },
    "铜粉": {
        "type": "洗矿机",
        "map": [["筛矿", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["筛矿"]]
    },
    "锡粉": {
        "type": "洗矿机",
        "map": [["筛矿", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["筛矿"]]
    },
    "银粉": {
        "type": "洗矿机",
        "map": [["筛矿", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["筛矿"]]
    },
    "铅粉": {
        "type": "洗矿机",
        "map": [["筛矿", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["筛矿"]]
    },
    "铝粉": {
        "type": "洗矿机",
        "map": [["筛矿", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["筛矿"]]
    },
    "锌粉": {
        "type": "洗矿机",
        "map": [["筛矿", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["筛矿"]]
    },
    "镁粉": {
        "type": "洗矿机",
        "map": [["筛矿", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["筛矿"]]
    },
    "电力喷气背包-I": {
        "type": "增强型工作台",
        "map": [["硬铝锭", null, "硬铝锭"], ["硬铝锭", "能量水晶", "硬铝锭"], ["钢推进器", "小型储能电容", "钢推进器"]],
        "ingredients": [["硬铝锭", 4], ["能量水晶"], ["钢推进器", 2], ["小型储能电容"]]
    },
    "电力喷气背包-II": {
        "type": "增强型工作台",
        "map": [["焊锡锭", null, "焊锡锭"], ["焊锡锭", "能量水晶", "焊锡锭"], ["钢推进器", "小型储能电容", "钢推进器"]],
        "ingredients": [["焊锡锭", 4], ["能量水晶"], ["钢推进器", 2], ["小型储能电容"]]
    },
    "电力喷气背包-III": {
        "type": "增强型工作台",
        "map": [["银铜合金锭", null, "银铜合金锭"], ["银铜合金锭", "能量水晶", "银铜合金锭"], ["钢推进器", "小型储能电容", "钢推进器"]],
        "ingredients": [["银铜合金锭", 4], ["能量水晶"], ["钢推进器", 2], ["小型储能电容"]]
    },
    "电力喷气背包-IV": {
        "type": "增强型工作台",
        "map": [["钢锭", null, "钢锭"], ["钢锭", "能量水晶", "钢锭"], ["钢推进器", "小型储能电容", "钢推进器"]],
        "ingredients": [["钢锭", 4], ["能量水晶"], ["钢推进器", 2], ["小型储能电容"]]
    },
    "电力喷气背包-V": {
        "type": "增强型工作台",
        "map": [["大马士革钢锭", null, "大马士革钢锭"], ["大马士革钢锭", "能量水晶", "大马士革钢锭"], ["钢推进器", "小型储能电容", "钢推进器"]],
        "ingredients": [["大马士革钢锭", 4], ["能量水晶"], ["钢推进器", 2], ["小型储能电容"]]
    },
    "电力喷气背包-VI": {
        "type": "增强型工作台",
        "map": [["强化合金锭", null, "强化合金锭"], ["强化合金锭", "能量水晶", "强化合金锭"], ["钢推进器", "中型储能电容", "钢推进器"]],
        "ingredients": [["强化合金锭", 4], ["能量水晶"], ["钢推进器", 2], ["中型储能电容"]]
    },
    "电力喷气背包-VII": {
        "type": "增强型工作台",
        "map": [["碳块", null, "碳块"], ["黑金刚石", "能量水晶", "黑金刚石"], ["钢推进器", "巨型储能电容", "钢推进器"]],
        "ingredients": [["碳块", 2], ["黑金刚石", 2], ["能量水晶"], ["钢推进器", 2], ["巨型储能电容"]]
    },
    "装甲喷气背包": {
        "type": "增强型工作台",
        "map": [["钢板", null, "钢板"], ["钢板", "能量水晶", "钢板"], ["钢推进器", "中型储能电容", "钢推进器"]],
        "ingredients": [["钢板", 4], ["能量水晶"], ["钢推进器", 2], ["中型储能电容"]]
    },
    "光伏电池": {
        "type": "增强型工作台",
        "map": [["玻璃", "玻璃", "玻璃"], ["硅", "硅", "硅"], ["硅铁", "硅铁", "硅铁"]],
        "ingredients": [["玻璃", 3], ["硅", 3], ["硅铁", 3]]
    },
    "还魂丹": {
        "type": "魔法工作台",
        "map": [["金锭", "魔法结晶-II", "金锭"], ["苹果", "虚弱药水", "苹果"], ["金锭", "魔法结晶-II", "金锭"]],
        "ingredients": [["金锭", 4], ["魔法结晶-II", 2], ["苹果", 2], ["虚弱药水"]]
    },
    "农夫护身符": {
        "type": "魔法工作台",
        "map": [["魔法结晶-III", null, "魔法结晶-III"], ["钻石锄", "普通护身符", "钻石锄"], ["魔法结晶-III", null, "魔法结晶-III"]],
        "ingredients": [["魔法结晶-III", 4], ["钻石锄", 2], ["普通护身符"]]
    },
    "末影农夫护身符": {
        "type": "魔法工作台",
        "map": [["末影结晶-III", null, "末影结晶-III"], [null, "农夫护身符", null], ["末影结晶-III", null, "末影结晶-III"]],
        "ingredients": [["末影结晶-III", 4], ["农夫护身符"]]
    },
    "穴居人护身符": {
        "type": "魔法工作台",
        "map": [["魔法结晶-III", null, "魔法结晶-III"], ["金镐", "矿工护身符", "古代符文[地]"], ["魔法结晶-III", null, "魔法结晶-III"]],
        "ingredients": [["魔法结晶-III", 4], ["金镐"], ["矿工护身符"], ["古代符文[地]"]]
    },
    "末影穴居人护身符": {
        "type": "魔法工作台",
        "map": [["末影结晶-III", null, "末影结晶-III"], [null, "穴居人护身符", null], ["末影结晶-III", null, "末影结晶-III"]],
        "ingredients": [["末影结晶-III", 4], ["穴居人护身符"]]
    },
    "智者的护身符": {
        "type": "魔法工作台",
        "map": [["魔法结晶-III", "魔法玻璃", "魔法结晶-III"], ["学识之瓶(满)", "魔法师护身符", "学识之瓶(满)"], ["魔法结晶-III", "魔法玻璃", "魔法结晶-III"]],
        "ingredients": [["魔法结晶-III", 4], ["魔法玻璃", 2], ["学识之瓶(满)", 2], ["魔法师护身符"]]
    },
    "末影智者的护身符": {
        "type": "魔法工作台",
        "map": [["末影结晶-III", null, "末影结晶-III"], [null, "智者的护身符", null], ["末影结晶-III", null, "末影结晶-III"]],
        "ingredients": [["末影结晶-III", 4], ["智者的护身符"]]
    },
    "强化布料": {
        "type": "增强型工作台",
        "map": [[null, "布", null], ["布", "铅锭", "布"], [null, "布", null]],
        "ingredients": [["布", 4], ["铅锭"]]
    },
    "一小撮铀": {
        "type": "矿石粉碎机",
        "map": [["纯矿簇", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["纯矿簇"]]
    },
    "工业矿机": {
        "type": "多方块结构",
        "map": [[null, null, null], ["活塞 (朝上)", "箱子", "活塞 (朝上)"], ["铁块", "高炉", "铁块"]],
        "ingredients": [["活塞 (朝上)", 2], ["箱子"], ["铁块", 2], ["高炉"]]
    },
    "进阶工业矿机": {
        "type": "多方块结构",
        "map": [[null, null, null], ["活塞 (朝上)", "箱子", "活塞 (朝上)"], ["钻石块", "高炉", "钻石块"]],
        "ingredients": [["活塞 (朝上)", 2], ["箱子"], ["钻石块", 2], ["高炉"]]
    },
    "人造潜影壳": {
        "type": "古代祭坛",
        "map": [["末影结晶-III", "古代符文[末影]", "末影结晶-III"], ["钢筋板", "海龟壳", "钢筋板"], ["末影结晶-III", "古代符文[末影]", "末影结晶-III"]],
        "ingredients": [["末影结晶-III", 4], ["古代符文[末影]", 2], ["钢筋板", 2], ["海龟壳"]]
    },
    "攀岩镐": {
        "type": "增强型工作台",
        "map": [["钢锭", "硬化金属", "钢锭"], [null, "木棍", null], [null, "木棍", null]],
        "ingredients": [["钢锭", 2], ["硬化金属"], ["木棍", 2]]
    },
    "附魔金苹果": {
        "type": "增强型工作台",
        "map": [["金块(24克拉)", "金块(24克拉)", "金块(24克拉)"], ["金块(24克拉)", "苹果", "金块(24克拉)"], ["金块(24克拉)", "金块(24克拉)", "金块(24克拉)"]],
        "ingredients": [["金块(24克拉)", 8], ["苹果"]]
    },
    "已损坏的刷怪笼": {
        "type": "刷怪笼之镐",
        "map": [[null, null, null], [null, "刷怪笼", null], [null, null, null]],
        "ingredients": [["刷怪笼"]]
    },
    "学识巨著": {
        "type": "魔法工作台",
        "map": [[null, "羽毛", null], ["墨囊", "魔法书皮", "玻璃瓶"], [null, "书与笔", null]],
        "ingredients": [["羽毛"], ["墨囊"], ["魔法书皮"], ["玻璃瓶"], ["书与笔"]]
    },
    "学识之瓶(满)": {
        "type": "使用",
        "map": [["学识之瓶", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["学识之瓶"]]
    },
    "生日蛋糕": {
        "type": "增强型工作台",
        "map": [[null, "火把", null], ["糖", "蛋糕", "糖"], [null, null, null]],
        "ingredients": [["火把"], ["糖", 2], ["蛋糕"]]
    },
    "一杯牛奶": {
        "type": "增强型工作台",
        "map": [["奶桶", "玻璃瓶", null], [null, null, null], [null, null, null]],
        "ingredients": [["奶桶"], ["玻璃瓶"]]
    },
    "巧克力牛奶": {
        "type": "增强型工作台",
        "map": [["一杯牛奶", "可可豆", null], [null, null, null], [null, null, null]],
        "ingredients": [["一杯牛奶"], ["可可豆"]]
    },
    "蛋酒": {
        "type": "增强型工作台",
        "map": [["一杯牛奶", "鸡蛋", null], [null, null, null], [null, null, null]],
        "ingredients": [["一杯牛奶"], ["鸡蛋"]]
    },
    "苹果酒": {
        "type": "增强型工作台",
        "map": [["苹果汁", "糖", null], [null, null, null], [null, null, null]],
        "ingredients": [["苹果汁"], ["糖"]]
    },
    "圣诞曲奇": {
        "type": "增强型工作台",
        "map": [["曲奇", "糖", "黄绿色染料"], [null, null, null], [null, null, null]],
        "ingredients": [["曲奇"], ["糖"], ["黄绿色染料"]]
    },
    "水果蛋糕": {
        "type": "增强型工作台",
        "map": [["鸡蛋", "苹果", "西瓜"], ["糖", null, null], [null, null, null]],
        "ingredients": [["鸡蛋"], ["苹果"], ["西瓜"], ["糖"]]
    },
    "苹果派": {
        "type": "增强型工作台",
        "map": [["糖", "苹果", "鸡蛋"], [null, null, null], [null, null, null]],
        "ingredients": [["糖"], ["苹果"], ["鸡蛋"]]
    },
    "热可可": {
        "type": "冶炼炉",
        "map": [["巧克力牛奶", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["巧克力牛奶"]]
    },
    "圣诞蛋糕": {
        "type": "增强型工作台",
        "map": [["鸡蛋", "糖", "小麦粉"], ["奶桶", null, null], [null, null, null]],
        "ingredients": [["鸡蛋"], ["糖"], ["小麦粉"], ["奶桶"]]
    },
    "焦糖": {
        "type": "冶炼炉",
        "map": [["糖", "糖", null], [null, null, null], [null, null, null]],
        "ingredients": [["糖", 2]]
    },
    "焦糖苹果": {
        "type": "增强型工作台",
        "map": [[null, "焦糖", null], [null, "苹果", null], [null, "木棍", null]],
        "ingredients": [["焦糖"], ["苹果"], ["木棍"]]
    },
    "巧克力苹果": {
        "type": "增强型工作台",
        "map": [[null, "可可豆", null], [null, "苹果", null], [null, "木棍", null]],
        "ingredients": [["可可豆"], ["苹果"], ["木棍"]]
    },
    "圣诞礼物": {
        "type": "魔法工作台",
        "map": [[null, "命名牌", null], ["红色羊毛", "绿色羊毛", "红色羊毛"], ["红色羊毛", "绿色羊毛", "红色羊毛"]],
        "ingredients": [["命名牌"], ["红色羊毛", 4], ["绿色羊毛", 2]]
    },
    "胡萝卜派": {
        "type": "增强型工作台",
        "map": [["糖", "胡萝卜", "鸡蛋"], [null, null, null], [null, null, null]],
        "ingredients": [["糖"], ["胡萝卜"], ["鸡蛋"]]
    },
    "复活节彩蛋": {
        "type": "增强型工作台",
        "map": [[null, null, null], ["黄绿色染料", "鸡蛋", "紫色染料"], [null, null, null]],
        "ingredients": [["黄绿色染料"], ["鸡蛋"], ["紫色染料"]]
    },
    "能源连接器": {
        "type": "增强型工作台",
        "map": [["碳", "铜线", "碳"], ["铜线", "红石块", "铜线"], ["碳", "铜线", "碳"]],
        "ingredients": [["碳", 4], ["铜线", 4], ["红石块"]]
    },
    "终极储能电容": {
        "type": "增强型工作台",
        "map": [["黑金刚石", "红石合金锭", "黑金刚石"], ["下界之星", "黑金刚石镶边储能电容", "下界之星"], ["黑金刚石", "红石合金锭", "黑金刚石"]],
        "ingredients": [["黑金刚石", 4], ["红石合金锭", 2], ["下界之星", 2], ["黑金刚石镶边储能电容"]]
    },
    "电动淘金机(II)": {
        "type": "增强型工作台",
        "map": [[null, "淘金盘", null], ["铁锭", "电动淘金机", "铁锭"], ["硬铝锭", "硬铝锭", "硬铝锭"]],
        "ingredients": [["淘金盘"], ["铁锭", 2], ["电动淘金机"], ["硬铝锭", 3]]
    },
    "电动淘金机(III)": {
        "type": "增强型工作台",
        "map": [[null, "淘金盘", null], ["电动马达", "电动淘金机(II)", "电动马达"], ["钴锭", "起泡锭", "钴锭"]],
        "ingredients": [["淘金盘"], ["电动马达", 2], ["电动淘金机(II)"], ["钴锭", 2], ["起泡锭"]]
    },
    "电动洗矿机(II)": {
        "type": "增强型工作台",
        "map": [[null, "水桶", null], ["电磁铁", "电动洗矿机", "电磁铁"], ["大马士革钢锭", "大马士革钢锭", "大马士革钢锭"]],
        "ingredients": [["水桶"], ["电磁铁", 2], ["电动洗矿机"], ["大马士革钢锭", 3]]
    },
    "电动洗矿机(III)": {
        "type": "增强型工作台",
        "map": [[null, "水桶", null], ["电磁铁", "电动洗矿机(II)", "电磁铁"], ["科林斯青铜锭", "起泡锭", "科林斯青铜锭"]],
        "ingredients": [["水桶"], ["电磁铁", 2], ["电动洗矿机(II)"], ["科林斯青铜锭", 2], ["起泡锭"]]
    },
    "电动铸锭机(II)": {
        "type": "增强型工作台",
        "map": [["镀金铁锭", "打火石", "镀金铁锭"], ["加热线圈", "电动铸锭机", "加热线圈"], ["黄铜锭", "电动马达", "黄铜锭"]],
        "ingredients": [["镀金铁锭", 2], ["打火石"], ["加热线圈", 2], ["电动铸锭机"], ["黄铜锭", 2], ["电动马达"]]
    },
    "电动铸锭机(III)": {
        "type": "增强型工作台",
        "map": [["镀金铁锭", "打火石", "镀金铁锭"], ["加热线圈", "电动铸锭机(II)", "加热线圈"], ["黄铜锭", "起泡锭", "黄铜锭"]],
        "ingredients": [["镀金铁锭", 2], ["打火石"], ["加热线圈", 2], ["电动铸锭机(II)"], ["黄铜锭", 2], ["起泡锭"]]
    },
    "电力碎矿机(II)": {
        "type": "增强型工作台",
        "map": [[null, "钻石镐", null], ["加热线圈", "电力碎矿机", "加热线圈"], ["镀金铁锭", "起泡锭", "镀金铁锭"]],
        "ingredients": [["钻石镐"], ["加热线圈", 2], ["电力碎矿机"], ["镀金铁锭", 2], ["起泡锭"]]
    },
    "电力碎矿机(III)": {
        "type": "增强型工作台",
        "map": [["钢筋板", "加热线圈", "钢筋板"], [null, "电力碎矿机(II)", null], ["钢筋板", "起泡锭", "钢筋板"]],
        "ingredients": [["钢筋板", 4], ["加热线圈"], ["电力碎矿机(II)"], ["起泡锭"]]
    },
    "加热压力舱": {
        "type": "增强型工作台",
        "map": [["铅锭", "电动马达", "铅锭"], ["铅锭", "玻璃", "铅锭"], ["铅锭", "加热线圈", "铅锭"]],
        "ingredients": [["铅锭", 6], ["电动马达"], ["玻璃"], ["加热线圈"]]
    },
    "加热压力舱-II": {
        "type": "增强型工作台",
        "map": [["铅锭", "电动马达", "铅锭"], ["铅锭", "加热压力舱", "铅锭"], ["强化合金锭", "加热线圈", "强化合金锭"]],
        "ingredients": [["铅锭", 4], ["电动马达"], ["加热压力舱"], ["强化合金锭", 2], ["加热线圈"]]
    },
    "煤发电机(II)": {
        "type": "增强型工作台",
        "map": [["岩浆块", "加热线圈", "岩浆块"], ["硬化金属", "煤发电机", "硬化金属"], [null, "电动马达", null]],
        "ingredients": [["岩浆块", 2], ["加热线圈"], ["硬化金属", 2], ["煤发电机"], ["电动马达"]]
    },
    "生物发电机": {
        "type": "增强型工作台",
        "map": [["加热线圈", "搅拌机", "加热线圈"], ["铝黄铜锭", "电动马达", "铝黄铜锭"], [null, "铝黄铜锭", null]],
        "ingredients": [["加热线圈", 2], ["搅拌机"], ["铝黄铜锭", 3], ["电动马达"]]
    },
    "自动酿造机": {
        "type": "增强型工作台",
        "map": [[null, "加热线圈", null], ["钢筋板", "酿造台", "钢筋板"], [null, "电动马达", null]],
        "ingredients": [["加热线圈"], ["钢筋板", 2], ["酿造台"], ["电动马达"]]
    },
    "压缩机-II": {
        "type": "增强型工作台",
        "map": [["黏性活塞", "压缩机", "黏性活塞"], ["大马士革钢锭", "大型储能电容", "大马士革钢锭"], ["大马士革钢锭", "大马士革钢锭", "大马士革钢锭"]],
        "ingredients": [["黏性活塞", 2], ["压缩机"], ["大马士革钢锭", 5], ["大型储能电容"]]
    },
    "镁发电机": {
        "type": "增强型工作台",
        "map": [[null, "电动马达", null], ["压缩碳", "水桶", "压缩碳"], ["硬铝锭", "硬铝锭", "硬铝锭"]],
        "ingredients": [["电动马达"], ["压缩碳", 2], ["水桶"], ["硬铝锭", 3]]
    },
    "自动附魔机-II": {
        "type": "增强型工作台",
        "map": [["钢筋板", "大型储能电容", "钢筋板"], ["起泡锭", "自动附魔机", "起泡锭"], ["防凋灵黑曜石", "人造钻石", "防凋灵黑曜石"]],
        "ingredients": [["钢筋板", 2], ["大型储能电容"], ["起泡锭", 2], ["自动附魔机"], ["防凋灵黑曜石", 2], ["人造钻石"]]
    },
    "自动祛魔机": {
        "type": "增强型工作台",
        "map": [["红石粉", "铁砧", "红石粉"], ["黑金刚石", "自动附魔机", "黑金刚石"], ["防凋灵黑曜石", "防凋灵黑曜石", "防凋灵黑曜石"]],
        "ingredients": [["红石粉", 2], ["铁砧"], ["黑金刚石", 2], ["自动附魔机"], ["防凋灵黑曜石", 3]]
    },
    "自动祛魔机-II": {
        "type": "增强型工作台",
        "map": [["钢筋板", "铁砧", "钢筋板"], ["起泡锭", "自动祛魔机", "起泡锭"], ["防凋灵黑曜石", "大型储能电容", "防凋灵黑曜石"]],
        "ingredients": [["钢筋板", 2], ["铁砧"], ["起泡锭", 2], ["自动祛魔机"], ["防凋灵黑曜石", 2], ["大型储能电容"]]
    },
    "自动铁砧Mk.II": {
        "type": "增强型工作台",
        "map": [[null, "自动铁砧", null], ["钢板", "加热线圈", "钢板"], ["铁块", "铁块", "铁块"]],
        "ingredients": [["自动铁砧"], ["钢板", 2], ["加热线圈"], ["铁块", 3]]
    },
    "附魔书整合机": {
        "type": "增强型工作台",
        "map": [[null, "附魔台", null], ["书架", "硬化金属", "书架"], ["人造蓝宝石", "小型储能电容", "人造蓝宝石"]],
        "ingredients": [["附魔台"], ["书架", 2], ["硬化金属"], ["人造蓝宝石", 2], ["小型储能电容"]]
    },
    "黑金刚石GPS发射器": {
        "type": "增强型工作台",
        "map": [["高级GPS发射器", "科林斯青铜锭", "高级GPS发射器"], ["科林斯青铜锭", "黑金刚石", "科林斯青铜锭"], ["高级GPS发射器", "科林斯青铜锭", "高级GPS发射器"]],
        "ingredients": [["高级GPS发射器", 4], ["科林斯青铜锭", 4], ["黑金刚石"]]
    },
    "古代符文[附魔]": {
        "type": "古代祭坛",
        "map": [["魔法结晶-III", "魔法玻璃", "魔法结晶-III"], ["魔法玻璃", "古代符文[雷]", "魔法玻璃"], ["魔法结晶-III", "魔法玻璃", "魔法结晶-III"]],
        "ingredients": [["魔法结晶-III", 4], ["魔法玻璃", 4], ["古代符文[雷]"]]
    },
    "鞘翅(经验修补)": {
        "type": "古代祭坛",
        "map": [["学识之瓶", "鞘翅鳞片", "学识之瓶"], ["学识之瓶", "鞘翅", "学识之瓶"], ["学识之瓶", "鞘翅鳞片", "学识之瓶"]],
        "ingredients": [["学识之瓶", 6], ["鞘翅鳞片", 2], ["鞘翅"]]
    },
    "鞘翅(灵魂绑定)": {
        "type": "古代祭坛",
        "map": [["学识之瓶", "来世精华", "学识之瓶"], ["鞘翅鳞片", "鞘翅", "鞘翅鳞片"], ["学识之瓶", "来世精华", "学识之瓶"]],
        "ingredients": [["学识之瓶", 4], ["来世精华", 2], ["鞘翅鳞片", 2], ["鞘翅"]]
    },
    "三叉戟": {
        "type": "古代祭坛",
        "map": [["鹦鹉螺壳", "强化合金锭", "鹦鹉螺壳"], ["元素法杖-水", "钻石剑", "元素法杖-水"], ["魔法结晶-III", "下界之星", "魔法结晶-III"]],
        "ingredients": [["鹦鹉螺壳", 2], ["强化合金锭"], ["元素法杖-水", 2], ["钻石剑"], ["魔法结晶-III", 2], ["下界之星"]]
    },
    "彩虹混凝土": {
        "type": "古代祭坛",
        "map": [["白色混凝土", "白色混凝土", "白色混凝土"], ["白色混凝土", "古代符文[虹]", "白色混凝土"], ["白色混凝土", "白色混凝土", "白色混凝土"]],
        "ingredients": [["白色混凝土", 8], ["古代符文[虹]"]]
    },
    "彩虹带釉陶瓦": {
        "type": "古代祭坛",
        "map": [["白色带釉陶瓦", "白色带釉陶瓦", "白色带釉陶瓦"], ["白色带釉陶瓦", "古代符文[虹]", "白色带釉陶瓦"], ["白色带釉陶瓦", "白色带釉陶瓦", "白色带釉陶瓦"]],
        "ingredients": [["白色带釉陶瓦", 8], ["古代符文[虹]"]]
    },
    "彩虹羊毛(圣诞节版)": {
        "type": "古代祭坛",
        "map": [["红色染料", "圣诞曲奇", "绿色染料"], ["白色羊毛", "古代符文[虹]", "白色羊毛"], ["绿色染料", "圣诞曲奇", "红色染料"]],
        "ingredients": [["红色染料", 2], ["圣诞曲奇", 2], ["绿色染料", 2], ["白色羊毛", 2], ["古代符文[虹]"]]
    },
    "彩虹玻璃(圣诞节版)": {
        "type": "古代祭坛",
        "map": [["红色染料", "圣诞曲奇", "绿色染料"], ["白色染色玻璃", "古代符文[虹]", "白色染色玻璃"], ["绿色染料", "圣诞曲奇", "红色染料"]],
        "ingredients": [["红色染料", 2], ["圣诞曲奇", 2], ["绿色染料", 2], ["白色染色玻璃", 2], ["古代符文[虹]"]]
    },
    "彩虹玻璃板(圣诞节版)": {
        "type": "古代祭坛",
        "map": [["红色染料", "圣诞曲奇", "绿色染料"], ["白色染色玻璃板", "古代符文[虹]", "白色染色玻璃板"], ["绿色染料", "圣诞曲奇", "红色染料"]],
        "ingredients": [["红色染料", 2], ["圣诞曲奇", 2], ["绿色染料", 2], ["白色染色玻璃板", 2], ["古代符文[虹]"]]
    },
    "彩虹粘土块(圣诞节版)": {
        "type": "古代祭坛",
        "map": [["红色染料", "圣诞曲奇", "绿色染料"], ["白色陶瓦", "古代符文[虹]", "白色陶瓦"], ["绿色染料", "圣诞曲奇", "红色染料"]],
        "ingredients": [["红色染料", 2], ["圣诞曲奇", 2], ["绿色染料", 2], ["白色陶瓦", 2], ["古代符文[虹]"]]
    },
    "彩虹混凝土(圣诞节版)": {
        "type": "古代祭坛",
        "map": [["红色染料", "圣诞曲奇", "绿色染料"], ["白色混凝土", "古代符文[虹]", "白色混凝土"], ["绿色染料", "圣诞曲奇", "红色染料"]],
        "ingredients": [["红色染料", 2], ["圣诞曲奇", 2], ["绿色染料", 2], ["白色混凝土", 2], ["古代符文[虹]"]]
    },
    "彩虹带釉陶瓦(圣诞节版)": {
        "type": "古代祭坛",
        "map": [["红色染料", "圣诞曲奇", "绿色染料"], ["白色带釉陶瓦", "古代符文[虹]", "白色带釉陶瓦"], ["绿色染料", "圣诞曲奇", "红色染料"]],
        "ingredients": [["红色染料", 2], ["圣诞曲奇", 2], ["绿色染料", 2], ["白色带釉陶瓦", 2], ["古代符文[虹]"]]
    },
    "彩虹羊毛(情人节版)": {
        "type": "古代祭坛",
        "map": [["红色染料", "虞美人", "粉红色染料"], ["白色羊毛", "古代符文[虹]", "白色羊毛"], ["粉红色染料", "虞美人", "红色染料"]],
        "ingredients": [["红色染料", 2], ["虞美人", 2], ["粉红色染料", 2], ["白色羊毛", 2], ["古代符文[虹]"]]
    },
    "彩虹玻璃(情人节版)": {
        "type": "古代祭坛",
        "map": [["红色染料", "虞美人", "粉红色染料"], ["白色染色玻璃", "古代符文[虹]", "白色染色玻璃"], ["粉红色染料", "虞美人", "红色染料"]],
        "ingredients": [["红色染料", 2], ["虞美人", 2], ["粉红色染料", 2], ["白色染色玻璃", 2], ["古代符文[虹]"]]
    },
    "彩虹玻璃板(情人节版)": {
        "type": "古代祭坛",
        "map": [["红色染料", "虞美人", "粉红色染料"], ["白色染色玻璃板", "古代符文[虹]", "白色染色玻璃板"], ["粉红色染料", "虞美人", "红色染料"]],
        "ingredients": [["红色染料", 2], ["虞美人", 2], ["粉红色染料", 2], ["白色染色玻璃板", 2], ["古代符文[虹]"]]
    },
    "彩虹粘土块(情人节版)": {
        "type": "古代祭坛",
        "map": [["红色染料", "虞美人", "粉红色染料"], ["白色陶瓦", "古代符文[虹]", "白色陶瓦"], ["粉红色染料", "虞美人", "红色染料"]],
        "ingredients": [["红色染料", 2], ["虞美人", 2], ["粉红色染料", 2], ["白色陶瓦", 2], ["古代符文[虹]"]]
    },
    "彩虹混凝土(情人节版)": {
        "type": "古代祭坛",
        "map": [["红色染料", "虞美人", "粉红色染料"], ["白色混凝土", "古代符文[虹]", "白色混凝土"], ["粉红色染料", "虞美人", "红色染料"]],
        "ingredients": [["红色染料", 2], ["虞美人", 2], ["粉红色染料", 2], ["白色混凝土", 2], ["古代符文[虹]"]]
    },
    "彩虹带釉陶瓦(情人节版)": {
        "type": "古代祭坛",
        "map": [["红色染料", "虞美人", "粉红色染料"], ["白色带釉陶瓦", "古代符文[虹]", "白色带釉陶瓦"], ["粉红色染料", "虞美人", "红色染料"]],
        "ingredients": [["红色染料", 2], ["虞美人", 2], ["粉红色染料", 2], ["白色带釉陶瓦", 2], ["古代符文[虹]"]]
    },
    "彩虹羊毛(万圣节版)": {
        "type": "古代祭坛",
        "map": [["橙色染料", "南瓜", "黑色染料"], ["白色羊毛", "古代符文[虹]", "白色羊毛"], ["黑色染料", "南瓜", "橙色染料"]],
        "ingredients": [["橙色染料", 2], ["南瓜", 2], ["黑色染料", 2], ["白色羊毛", 2], ["古代符文[虹]"]]
    },
    "彩虹玻璃(万圣节版)": {
        "type": "古代祭坛",
        "map": [["橙色染料", "南瓜", "黑色染料"], ["白色染色玻璃", "古代符文[虹]", "白色染色玻璃"], ["黑色染料", "南瓜", "橙色染料"]],
        "ingredients": [["橙色染料", 2], ["南瓜", 2], ["黑色染料", 2], ["白色染色玻璃", 2], ["古代符文[虹]"]]
    },
    "彩虹玻璃板(万圣节版)": {
        "type": "古代祭坛",
        "map": [["橙色染料", "南瓜", "黑色染料"], ["白色染色玻璃板", "古代符文[虹]", "白色染色玻璃板"], ["黑色染料", "南瓜", "橙色染料"]],
        "ingredients": [["橙色染料", 2], ["南瓜", 2], ["黑色染料", 2], ["白色染色玻璃板", 2], ["古代符文[虹]"]]
    },
    "彩虹粘土块(万圣节版)": {
        "type": "古代祭坛",
        "map": [["橙色染料", "南瓜", "黑色染料"], ["白色陶瓦", "古代符文[虹]", "白色陶瓦"], ["黑色染料", "南瓜", "橙色染料"]],
        "ingredients": [["橙色染料", 2], ["南瓜", 2], ["黑色染料", 2], ["白色陶瓦", 2], ["古代符文[虹]"]]
    },
    "彩虹混凝土(万圣节版)": {
        "type": "古代祭坛",
        "map": [["橙色染料", "南瓜", "黑色染料"], ["白色混凝土", "古代符文[虹]", "白色混凝土"], ["黑色染料", "南瓜", "橙色染料"]],
        "ingredients": [["橙色染料", 2], ["南瓜", 2], ["黑色染料", 2], ["白色混凝土", 2], ["古代符文[虹]"]]
    },
    "彩虹带釉陶瓦(万圣节版)": {
        "type": "古代祭坛",
        "map": [["橙色染料", "南瓜", "黑色染料"], ["白色带釉陶瓦", "古代符文[虹]", "白色带釉陶瓦"], ["黑色染料", "南瓜", "橙色染料"]],
        "ingredients": [["橙色染料", 2], ["南瓜", 2], ["黑色染料", 2], ["白色带釉陶瓦", 2], ["古代符文[虹]"]]
    },
    "自然资源开采机": {
        "type": "增强型工作台",
        "map": [["钻石镐", "中型储能电容", "钻石镐"], ["强化合金锭", "原油泵", "强化合金锭"], [null, "电动马达", null]],
        "ingredients": [["钻石镐", 2], ["中型储能电容"], ["强化合金锭", 2], ["原油泵"], ["电动马达"]]
    },
    "下界冰": {
        "type": "自然资源开采机",
        "map": [[null, null, null], [null, null, null], [null, null, null]],
        "ingredients": []
    },
    "炼油机": {
        "type": "增强型工作台",
        "map": [["钢化玻璃", "红石合金锭", "钢化玻璃"], ["钢化玻璃", "红石合金锭", "钢化玻璃"], ["活塞", "电动马达", "活塞"]],
        "ingredients": [["钢化玻璃", 4], ["红石合金锭", 2], ["活塞", 2], ["电动马达"]]
    },
    "岩浆发电机(II)": {
        "type": "增强型工作台",
        "map": [["科林斯青铜锭", "科林斯青铜锭", "科林斯青铜锭"], ["压缩碳", "岩浆发电机", "压缩碳"], ["加热线圈", "压缩碳", "加热线圈"]],
        "ingredients": [["科林斯青铜锭", 3], ["压缩碳", 3], ["岩浆发电机"], ["加热线圈", 2]]
    },
    "GPS信号塔": {
        "type": "增强型工作台",
        "map": [["锌锭", "玻璃", "锌锭"], ["玻璃", "加热线圈", "玻璃"], ["锌锭", "玻璃", "锌锭"]],
        "ingredients": [["锌锭", 4], ["玻璃", 4], ["加热线圈"]]
    },
    "便携式传送器": {
        "type": "增强型工作台",
        "map": [["电磁铁", "黑金刚石GPS发射器", "电磁铁"], ["钢筋板", "GPS传送矩阵", "钢筋板"], ["起泡锭", "中型储能电容", "起泡锭"]],
        "ingredients": [["电磁铁", 2], ["黑金刚石GPS发射器"], ["钢筋板", 2], ["GPS传送矩阵"], ["起泡锭", 2], ["中型储能电容"]]
    },
    "食品加工机(II)": {
        "type": "增强型工作台",
        "map": [["硬化金属", "强化合金锭", "硬化金属"], ["电动马达", "食品加工机", "电动马达"], [null, "电磁铁", null]],
        "ingredients": [["硬化金属", 2], ["强化合金锭"], ["电动马达", 2], ["食品加工机"], ["电磁铁"]]
    },
    "有机食物": {
        "type": "食品加工机",
        "map": [["锡罐", "海草", null], [null, null, null], [null, null, null]],
        "ingredients": [["锡罐"], ["海草"]]
    },
    "树木生长加速器": {
        "type": "增强型工作台",
        "map": [[null, "黑金刚石", null], ["电动马达", "钻石斧", "电动马达"], ["镁盐", "大型储能电容", "镁盐"]],
        "ingredients": [["黑金刚石"], ["电动马达", 2], ["钻石斧"], ["镁盐", 2], ["大型储能电容"]]
    },
    "食品堆肥器(II)": {
        "type": "增强型工作台",
        "map": [["硬化金属", "强化合金锭", "硬化金属"], ["电动马达", "食品堆肥器", "电动马达"], [null, "电磁铁", null]],
        "ingredients": [["硬化金属", 2], ["强化合金锭"], ["电动马达", 2], ["食品堆肥器"], ["电磁铁"]]
    },
    "作物生长加速器(II)": {
        "type": "增强型工作台",
        "map": [[null, "起泡锭", null], ["电动马达", "作物生长加速器", "电动马达"], ["电磁铁", "高级电路板", "电磁铁"]],
        "ingredients": [["起泡锭"], ["电动马达", 2], ["作物生长加速器"], ["电磁铁", 2], ["高级电路板"]]
    },
    "冰箱(II)": {
        "type": "增强型工作台",
        "map": [[null, "银锭", null], ["电磁铁", "冰箱", "电磁铁"], ["冷却装置", "铝黄铜锭", "冷却装置"]],
        "ingredients": [["银锭"], ["电磁铁", 2], ["冰箱"], ["冷却装置", 2], ["铝黄铜锭"]]
    },
    "冰箱(III)": {
        "type": "增强型工作台",
        "map": [["强化合金锭", "强化合金锭", "强化合金锭"], ["电磁铁", "冰箱(II)", "电磁铁"], ["冷却装置", "冷却装置", "冷却装置"]],
        "ingredients": [["强化合金锭", 3], ["电磁铁", 2], ["冰箱(II)"], ["冷却装置", 3]]
    },
    "钚铀混合氧化物核燃料": {
        "type": "加热压力舱",
        "map": [["钚", "铀", null], [null, null, null], [null, null, null]],
        "ingredients": [["钚"], ["铀"]]
    },
    "电力冶炼炉": {
        "type": "增强型工作台",
        "map": [["下界砖块", "电动马达", "下界砖块"], ["加热线圈", "电动铸锭机", "加热线圈"], ["镀金铁锭", "电动马达", "镀金铁锭"]],
        "ingredients": [["下界砖块", 2], ["电动马达", 2], ["加热线圈", 2], ["电动铸锭机"], ["镀金铁锭", 2]]
    },
    "电力冶炼炉-II": {
        "type": "增强型工作台",
        "map": [["大马士革钢锭", "能量水晶", "大马士革钢锭"], ["加热线圈", "电力冶炼炉", "加热线圈"], ["镀金铁锭", "电动马达", "镀金铁锭"]],
        "ingredients": [["大马士革钢锭", 2], ["能量水晶"], ["加热线圈", 2], ["电力冶炼炉"], ["镀金铁锭", 2], ["电动马达"]]
    },
    "铁傀儡装配机": {
        "type": "增强型工作台",
        "map": [["起泡锭", "高级电路板", "起泡锭"], ["铁块", "机器人内存核心", "铁块"], ["电动马达", "强化合金锭", "黑金刚石镶边储能电容"]],
        "ingredients": [["起泡锭", 2], ["高级电路板"], ["铁块", 2], ["机器人内存核心"], ["电动马达"], ["强化合金锭"], ["黑金刚石镶边储能电容"]]
    },
    "凋灵装配机": {
        "type": "增强型工作台",
        "map": [["起泡锭", "下界之星", "起泡锭"], ["防凋灵黑曜石", "机器人内存核心", "防凋灵黑曜石"], ["电动马达", "强化合金锭", "黑金刚石镶边储能电容"]],
        "ingredients": [["起泡锭", 2], ["下界之星"], ["防凋灵黑曜石", 2], ["机器人内存核心"], ["电动马达"], ["强化合金锭"], ["黑金刚石镶边储能电容"]]
    },
    "卷尺": {
        "type": "增强型工作台",
        "map": [["硅", "黄色染料", "硅"], ["黄色染料", "线", "黄色染料"], ["镀金铁锭", "黄色染料", "硅"]],
        "ingredients": [["硅", 3], ["黄色染料", 4], ["线"], ["镀金铁锭"]]
    },
    "蜜蜂头盔": {
        "type": "盔甲锻造台",
        "map": [["金锭(8克拉)", "蜂蜜块", "金锭(8克拉)"], ["蜜脾块", null, "蜜脾块"], [null, null, null]],
        "ingredients": [["金锭(8克拉)", 2], ["蜂蜜块"], ["蜜脾块", 2]]
    },
    "蜂翅": {
        "type": "盔甲锻造台",
        "map": [["金锭(8克拉)", null, "金锭(8克拉)"], ["蜜脾块", "鞘翅", "蜜脾块"], ["蜂蜜块", "金锭(8克拉)", "蜂蜜块"]],
        "ingredients": [["金锭(8克拉)", 3], ["蜜脾块", 2], ["鞘翅"], ["蜂蜜块", 2]]
    },
    "蜜蜂护腿": {
        "type": "盔甲锻造台",
        "map": [["金锭(8克拉)", "蜂蜜块", "金锭(8克拉)"], ["蜜脾块", null, "蜜脾块"], ["蜜脾块", null, "蜜脾块"]],
        "ingredients": [["金锭(8克拉)", 2], ["蜂蜜块"], ["蜜脾块", 4]]
    },
    "蜜蜂护靴": {
        "type": "盔甲锻造台",
        "map": [[null, null, null], ["金锭(8克拉)", null, "金锭(8克拉)"], ["蜂蜜块", null, "蜂蜜块"]],
        "ingredients": [["金锭(8克拉)", 2], ["蜂蜜块", 2]]
    },
    "古代符文[村民]": {
        "type": "古代祭坛",
        "map": [["魔法结晶-III", "魔法玻璃", "哭泣的黑曜石"], ["奇怪的下界粘液", "古代符文[火]", "奇怪的下界粘液"], ["哭泣的黑曜石", "魔法玻璃", "魔法结晶-III"]],
        "ingredients": [["魔法结晶-III", 2], ["魔法玻璃", 2], ["哭泣的黑曜石", 2], ["奇怪的下界粘液", 2], ["古代符文[火]"]]
    },
    "奇怪的下界粘液": {
        "type": "交易",
        "map": [[null, null, null], [null, "§fPiglin", null], [null, null, null]],
        "ingredients": [["§fPiglin"]]
    },
    "发光浆果汁": {
        "type": "榨汁机",
        "map": [["发光浆果", null, null], [null, null, null], [null, null, null]],
        "ingredients": [["发光浆果"]]
    },
    "鞘翅帽": {
        "type": "盔甲锻造台",
        "map": [["黏液球", "黏液球", "黏液球"], ["鞘翅鳞片", "鞘翅鳞片", "鞘翅鳞片"], ["黏液球", "皮革帽子", "黏液球"]],
        "ingredients": [["黏液球", 5], ["鞘翅鳞片", 3], ["皮革帽子"]]
    },
    "彩虹皮革": {
        "type": "古代祭坛",
        "map": [["绿宝石", "皮革", "魔法结晶-II"], ["兔子皮", "古代符文[虹]", "兔子皮"], ["魔法结晶-II", "皮革", "绿宝石"]],
        "ingredients": [["绿宝石", 2], ["皮革", 2], ["魔法结晶-II", 2], ["兔子皮", 2], ["古代符文[虹]"]]
    },
    "合成机马达": {
        "type": "增强型工作台",
        "map": [["工作台", "起泡锭", "工作台"], ["红石合金锭", "货运马达", "红石合金锭"], ["工作台", "起泡锭", "工作台"]],
        "ingredients": [["工作台", 4], ["起泡锭", 2], ["红石合金锭", 2], ["货运马达"]]
    },
    "自动合成机(原版)": {
        "type": "增强型工作台",
        "map": [[null, "货运马达", null], ["工作台", "合成机马达", "工作台"], [null, "电动马达", null]],
        "ingredients": [["货运马达"], ["工作台", 2], ["合成机马达"], ["电动马达"]]
    },
    "自动合成机(高级)": {
        "type": "增强型工作台",
        "map": [[null, "合成机马达", null], ["工作台", "发射器", "工作台"], [null, "货运马达", null]],
        "ingredients": [["合成机马达"], ["工作台", 2], ["发射器"], ["货运马达"]]
    },
    "自动合成机(盔甲锻造)": {
        "type": "增强型工作台",
        "map": [[null, "合成机马达", null], ["发射器", "铁砧", "发射器"], ["工作台", "电动马达", "工作台"]],
        "ingredients": [["合成机马达"], ["发射器", 2], ["铁砧"], ["工作台", 2], ["电动马达"]]
    },
    "全自动收集机": {
        "type": "增强型工作台",
        "map": [[null, "干草捆", null], ["铁桶", "中型储能电容", "铁桶"], ["铝黄铜锭", "电动马达", "铝黄铜锭"]],
        "ingredients": [["干草捆"], ["铁桶", 2], ["中型储能电容"], ["铝黄铜锭", 2], ["电动马达"]]
    },
    "合成机智能交互接口": {
        "type": "增强型工作台",
        "map": [[null, "货运马达", null], ["箱子", "合成机马达", "箱子"], [null, "电动马达", null]],
        "ingredients": [["货运马达"], ["箱子", 2], ["合成机马达"], ["电动马达"]]
    }
};