let recipes = {
    //武器
    '奶奶的拐杖': {
        type: '高级工作台',
        ingredients: [
            ['橡木原木', 3]
        ]
    },
    '爷爷的拐杖': {
        type: '高级工作台',
        ingredients: [
            ['橡木原木', 3],
            ['皮革', 2]
        ]
    },
    '处决之剑': {
        type: '高级工作台',
        ingredients: [
            ['绿宝石', 2],
            ['魔法因子-II', 2],
            ['烈焰棒']
        ]
    },
    '吸血鬼之刀': {
        type: '魔法工作台',
        ingredients: [
            ['凋灵骷髅头颅', 2],
            ['烈焰棒']
        ]
    },
    '地震斧': {
        type: '魔法工作台',
        ingredients: [
            ['硬化金属', 3],
            ['元素法杖', 2]
        ]
    },
    '灵魂绑定剑': {
        type: '魔法工作台',
        ingredients: [
            ['来世精华', 2],
            ['钻石剑']
        ]
    },
    '灵魂绑定剑': {
        type: '魔法工作台',
        ingredients: [
            ['来世精华', 2],
            ['钻石剑']
        ]
    },
    '灵魂绑定三叉戟': {
        type: '魔法工作台',
        ingredients: [
            ['来世精华', 2],
            ['三叉戟']
        ]
    },
    '灵魂绑定弓': {
        type: '魔法工作台',
        ingredients: [
            ['来世精华', 2],
            ['弓']
        ]
    },
    '灵魂绑定剑': {
        type: '魔法工作台',
        ingredients: [
            ['来世精华', 2],
            ['钻石剑']
        ]
    },
    '爆裂之弓': {
        type: '魔法工作台',
        ingredients: [
            ['木棍', 2],
            ['火药', 2],
            ['硫酸盐'],
            ['元素法杖-火']
        ]
    },
    '冰封之弓': {
        type: '魔法工作台',
        ingredients: [
            ['木棍', 2],
            ['冰', 2],
            ['浮冰'],
            ['元素法杖-水']
        ]
    },
    //物品
    '便携工作台': {
        type: '高级工作台',
        ingredients: [
            ['书'],
            ['工作台']
        ]
    },
    '便携垃圾箱': {
        type: '高级工作台',
        ingredients: [
            ['铁锭', 8]
        ]
    },
    '破布': {
        type: '高级工作台',
        ingredients: [
            ['布', 6],
            ['线', 2]
        ]
    },
    '绷带': {
        type: '高级工作台',
        ingredients: [
            ['破布', 2],
            ['线']
        ]
    },
    '夹板': {
        type: '高级工作台',
        ingredients: [
            ['木棍', 3],
            ['铁锭', 2]
        ],
        'count': 4
    },
    '维他命': {
        type: '高级工作台',
        ingredients: [
            ['锡罐'],
            ['苹果'],
            ['红色蘑菇'],
            ['糖']
        ]
    },
    '药物': {
        type: '高级工作台',
        ingredients: [
            ['维他命'],
            ['浓奶油'],
            ['糖']
        ]
    },
    '小型背包': {
        type: '高级工作台',
        ingredients: [
            ['皮革', 5],
            ['金锭(6克拉)', 2],
            ['箱子']
        ]
    },
    '普通背包': {
        type: '高级工作台',
        ingredients: [
            ['皮革', 5],
            ['金锭(10克拉)', 2],
            ['小型背包']
        ]
    },
    '中型背包': {
        type: '高级工作台',
        ingredients: [
            ['皮革', 5],
            ['金锭(14克拉)', 2],
            ['普通背包']
        ]
    },
    '编织背包': {
        type: '高级工作台',
        ingredients: [
            ['布', 5],
            ['金锭(16克拉)', 2],
            ['中型背包']
        ]
    },
    '镀金背包': {
        type: '高级工作台',
        ingredients: [
            ['皮革', 2],
            ['金锭(22克拉)', 4],
            ['编织背包']
        ]
    },
    '金光闪闪的背包': {
        type: '高级工作台',
        ingredients: [
            ['皮革', 2],
            ['金锭(24克拉)', 4],
            ['镀金背包']
        ]
    },
    '灵魂绑定背包': {
        type: '魔法工作台',
        ingredients: [
            ['来世精华', 2],
            ['末影因子-II', 4],
            ['编织背包']
        ]
    },
    '小冰柜': {
        type: '高级工作台',
        ingredients: [
            ['铝锭', 5],
            ['布', 3],
            ['冷却装置']
        ]
    },
    //基础机器
    '高级工作台': {
        type: '多方块结构',
        ingredients: [
            ['工作台'],
            ['发射器']
        ]
    },
    '磨石': {
        type: '多方块结构',
        ingredients: [
            ['橡木栅栏'],
            ['发射器']
        ]
    },
    '盔甲锻造台': {
        type: '多方块结构',
        ingredients: [
            ['铁砧'],
            ['发射器']
        ]
    },
    '矿石粉碎机': {
        type: '多方块结构',
        ingredients: [
            ['铁栏杆', 2],
            ['地狱砖栅栏'],
            ['发射器']
        ]
    },
    '压缩机': {
        type: '多方块结构',
        ingredients: [
            ['活塞', 2],
            ['地狱砖栅栏'],
            ['发射器']
        ]
    },
    '冶炼炉': {
        type: '多方块结构',
        ingredients: [
            ['地狱砖块', 2],
            ['地狱砖栅栏'],
            ['发射器'],
            ['打火石']
        ]
    },
    '压力机': {
        type: '多方块结构',
        ingredients: [
            ['活塞', 4],
            ['平滑石台阶', 2],
            ['炼药锅'],
            ['玻璃'],
            ['发射器']
        ]
    },
    '魔法工作台': {
        type: '多方块结构',
        ingredients: [
            ['书架'],
            ['工作台'],
            ['发射器']
        ]
    },
    '洗矿机': {
        type: '多方块结构',
        ingredients: [
            ['炼药锅'],
            ['橡木栅栏'],
            ['发射器']
        ]
    },
    '台锯': {
        type: '多方块结构',
        ingredients: [
            ['平滑石台阶', 2],
            ['铁块'],
            ['切石机']
        ]
    },
    '挖矿机': {
        type: '多方块结构',
        ingredients: [
            ['铁块', 4],
            ['太阳能板', 2],
            ['箱子'],
            ['漏斗'],
            ['发射器']
        ]
    },
    '高级挖矿机': {
        type: '多方块结构',
        ingredients: [
            ['金块(24克拉)', 4],
            ['太阳能板', 2],
            ['箱子'],
            ['漏斗'],
            ['发射器']
        ]
    },
    '自动淘金机': {
        type: '多方块结构',
        ingredients: [
            ['橡木活板门'],
            ['炼药锅']
        ]
    },
    '榨汁机': {
        type: '多方块结构',
        ingredients: [
            ['地狱砖栅栏'],
            ['玻璃'],
            ['发射器']
        ]
    },
    '物品输出箱': {
        type: '高级工作台',
        ingredients: [
            ['铅锭', 5],
            ['漏斗'],
            ['箱子']
        ]
    },
    '自动点火机': {
        type: '高级工作台',
        ingredients: [
            ['电动马达', 2],
            ['钢板', 2],
            ['基础电路板'],
            ['打火石'],
            ['漏斗']
        ]
    },
    '搅拌机': {
        type: '多方块结构',
        ingredients: [
            ['橡木台阶', 6],
            ['炼药锅']
        ]
    },
    '坩埚': {
        type: '高级工作台',
        ingredients: [
            ['陶瓦', 6],
            ['打火石']
        ]
    },
    '强化熔炉-I': {
        type: '高级工作台',
        ingredients: [
            ['加热线圈', 2],
            ['电动马达'],
            ['基础电路板'],
            ['熔炉']
        ]
    },
    '强化熔炉-II': {
        type: '高级工作台',
        ingredients: [
            ['加热线圈', 2],
            ['电动马达'],
            ['基础电路板'],
            ['强化熔炉-I']
        ]
    },
    '强化熔炉-III': {
        type: '高级工作台',
        ingredients: [
            ['加热线圈', 2],
            ['电动马达'],
            ['基础电路板'],
            ['强化熔炉-II']
        ]
    },
    '强化熔炉-IV': {
        type: '高级工作台',
        ingredients: [
            ['加热线圈', 2],
            ['电动马达'],
            ['基础电路板'],
            ['强化熔炉-III']
        ]
    },
    '强化熔炉-V': {
        type: '高级工作台',
        ingredients: [
            ['加热线圈', 2],
            ['电动马达'],
            ['基础电路板'],
            ['强化熔炉-IV']
        ]
    },
    '强化熔炉-VI': {
        type: '高级工作台',
        ingredients: [
            ['加热线圈', 2],
            ['电动马达'],
            ['基础电路板'],
            ['强化熔炉-V']
        ]
    },
    '强化熔炉-VII': {
        type: '高级工作台',
        ingredients: [
            ['加热线圈', 2],
            ['电动马达'],
            ['基础电路板'],
            ['强化熔炉-VI']
        ]
    },
    '强化熔炉-VIII': {
        type: '高级工作台',
        ingredients: [
            ['加热线圈', 2],
            ['电动马达'],
            ['基础电路板'],
            ['强化熔炉-VII']
        ]
    },
    '强化熔炉-IX': {
        type: '高级工作台',
        ingredients: [
            ['加热线圈', 2],
            ['电动马达'],
            ['基础电路板'],
            ['强化熔炉-VIII']
        ]
    },
    '强化熔炉-X': {
        type: '高级工作台',
        ingredients: [
            ['加热线圈', 2],
            ['电动马达'],
            ['基础电路板'],
            ['强化熔炉-IX']
        ]
    },
    '强化熔炉-XI': {
        type: '高级工作台',
        ingredients: [
            ['加热线圈', 2],
            ['电动马达'],
            ['基础电路板'],
            ['强化熔炉-X']
        ]
    },
    '强化合金熔炉': {
        type: '高级工作台',
        ingredients: [
            ['强化合金锭', 4],
            ['加热线圈', 2],
            ['电动马达'],
            ['基础电路板'],
            ['强化熔炉-XI']
        ]
    },
    '黑金刚石镶边熔炉': {
        type: '高级工作台',
        ingredients: [
            ['黑金刚石', 4],
            ['加热线圈', 2],
            ['电动马达'],
            ['基础电路板'],
            ['强化合金熔炉']
        ]
    },
    '方块放置机': {
        type: '高级工作台',
        ingredients: [
            ['金锭(4克拉)', 4],
            ['铁锭', 2],
            ['活塞', 2],
            ['电动马达']
        ]
    },
    //工具
    '淘金盘': {
        type: '高级工作台',
        ingredients: [
            ['石头', 5],
            ['碗']
        ]
    },
    '下界淘金盘': {
        type: '高级工作台',
        ingredients: [
            ['地狱砖', 5],
            ['淘金盘']
        ]
    },
    '抓钩': {
        type: '高级工作台',
        ingredients: [
            ['锁链', 2],
            ['钩子']
        ]
    },
    '熔炉镐': {
        type: '高级工作台',
        ingredients: [
            ['岩浆水晶', 3],
            ['硅铁', 2]
        ]
    },
    '伐木斧': {
        type: '魔法工作台',
        ingredients: [
            ['人造钻石', 2],
            ['镀金铁锭', 2],
            ['人造绿宝石']
        ]
    },
    '刷怪笼之镐': {
        type: '魔法工作台',
        ingredients: [
            ['硅铁', 3],
            ['镀金铁锭', 2]
        ]
    },
    '赫拉克勒斯之镐': {
        type: '魔法工作台',
        ingredients: [
            ['硬化金属', 3],
            ['硅铁', 2]
        ]
    },
    '爆炸镐': {
        type: '魔法工作台',
        ingredients: [
            ['硅铁', 2],
            ['TNT', 2],
            ['人造钻石']
        ]
    },
    '爆炸铲': {
        type: '魔法工作台',
        ingredients: [
            ['硅铁'],
            ['TNT'],
            ['人造钻石']
        ]
    },
    '寻矿镐': {
        type: '魔法工作台',
        ingredients: [
            ['硅铁', 2],
            ['指南针', 2],
            ['人造钻石']
        ]
    },
    '钴镐': {
        type: '高级工作台',
        ingredients: [
            ['钴锭', 2],
            ['镍锭', 3],
        ]
    },
    '矿脉镐': {
        type: '魔法工作台',
        ingredients: [
            ['镀金铁锭', 2],
            ['绿宝石矿石', 2],
            ['人造钻石']
        ]
    },
    '灵魂绑定镐': {
        type: '魔法工作台',
        ingredients: [
            ['来世精华', 2],
            ['钻石镐']
        ]
    },
    '灵魂绑定斧': {
        type: '魔法工作台',
        ingredients: [
            ['来世精华', 2],
            ['钻石斧']
        ]
    },
    '灵魂绑定铲': {
        type: '魔法工作台',
        ingredients: [
            ['来世精华', 2],
            ['钻石铲']
        ]
    },
    '灵魂绑定锄': {
        type: '魔法工作台',
        ingredients: [
            ['来世精华', 2],
            ['钻石锄']
        ]
    },
    //资源
    '强化合金锭': {
        type: '冶炼炉',
        ingredients: [
            ['大马士革钢锭'],
            ['硬化金属'],
            ['科林斯青铜锭'],
            ['焊锡锭'],
            ['银铜合金锭'],
            ['金锭(24克拉)']
        ]
    },
    '硬化金属': {
        type: '冶炼炉',
        ingredients: [
            ['大马士革钢锭'],
            ['硬铝锭'],
            ['压缩碳'],
            ['铝青铜锭']
        ]
    },
    '大马士革钢锭': {
        type: '冶炼炉',
        ingredients: [
            ['钢锭'],
            ['铁粉'],
            ['碳'],
            ['铁锭']
        ]
    },
    '钢锭': {
        type: '冶炼炉',
        ingredients: [
            ['铁粉'],
            ['碳'],
            ['铁锭']
        ]
    },
    '青铜锭': {
        type: '冶炼炉',
        ingredients: [
            ['铜粉'],
            ['锡粉'],
            ['铜锭']
        ]
    },
    '硬铝锭': {
        type: '冶炼炉',
        ingredients: [
            ['铝粉'],
            ['铜粉'],
            ['铝锭']
        ]
    },
    '银铜合金锭': {
        type: '冶炼炉',
        ingredients: [
            ['银粉'],
            ['铜粉'],
            ['银锭']
        ]
    },
    '黄铜锭': {
        type: '冶炼炉',
        ingredients: [
            ['铜粉'],
            ['锌粉'],
            ['铜锭']
        ]
    },
    '铝黄铜锭': {
        type: '冶炼炉',
        ingredients: [
            ['铝粉'],
            ['黄铜锭'],
            ['铝锭']
        ]
    },
    '铝青铜锭': {
        type: '冶炼炉',
        ingredients: [
            ['铝粉'],
            ['青铜锭'],
            ['铝锭']
        ]
    },
    '科林斯青铜锭': {
        type: '冶炼炉',
        ingredients: [
            ['银粉'],
            ['金粉'],
            ['铜粉'],
            ['青铜锭']
        ]
    },
    '焊锡锭': {
        type: '冶炼炉',
        ingredients: [
            ['铅粉'],
            ['锡粉'],
            ['铅锭']
        ]
    },
    '人造蓝宝石': {
        type: '冶炼炉',
        ingredients: [
            ['铝粉'],
            ['玻璃'],
            ['玻璃板'],
            ['铝锭'],
            ['青金石']
        ]
    },
    '黑金刚石原矿': {
        type: '冶炼炉',
        ingredients: [
            ['人造钻石'],
            ['碳块'],
            ['玻璃板']
        ]
    },
    '镍锭': {
        type: '冶炼炉',
        ingredients: [
            ['铁粉'],
            ['铁锭'],
            ['铜粉']
        ]
    },
    '钴锭': {
        type: '冶炼炉',
        ingredients: [
            ['铁粉'],
            ['铜粉'],
            ['镍锭']
        ]
    },
    '硅铁': {
        type: '冶炼炉',
        ingredients: [
            ['铁锭'],
            ['铁粉'],
            ['硅']
        ]
    },
    '镀金铁锭': {
        type: '冶炼炉',
        ingredients: [
            ['金锭(24克拉)'],
            ['铁粉']
        ]
    },
    '人造绿宝石': {
        type: '冶炼炉',
        ingredients: [
            ['人造蓝宝石'],
            ['铝粉'],
            ['铝锭'],
            ['玻璃板']
        ]
    },
    '红石合金锭': {
        type: '冶炼炉',
        ingredients: [
            ['红石粉'],
            ['红石块'],
            ['硅铁'],
            ['硬化金属']
        ]
    },
    '人造钻石': {
        type: '压力机',
        ingredients: [
            ['碳块']
        ]
    },
    '黑金刚石': {
        type: '压力机',
        ingredients: [
            ['黑金刚石原矿']
        ]
    },
    '铜锭': {
        type: '冶炼炉',
        ingredients: [
            ['铜粉']
        ]
    },
    '锡锭': {
        type: '冶炼炉',
        ingredients: [
            ['锡粉']
        ]
    },
    '银锭': {
        type: '冶炼炉',
        ingredients: [
            ['银粉']
        ]
    },
    '铅锭': {
        type: '冶炼炉',
        ingredients: [
            ['铅粉']
        ]
    },
    '铝锭': {
        type: '冶炼炉',
        ingredients: [
            ['铝粉']
        ]
    },
    '锌锭': {
        type: '冶炼炉',
        ingredients: [
            ['锌粉']
        ]
    },
    '镁锭': {
        type: '冶炼炉',
        ingredients: [
            ['镁粉']
        ]
    },
    '硫酸盐': {
        type: '矿石粉碎机',
        ingredients: [
            ['地狱岩', 16]
        ]
    },
    '碳': {
        type: '压缩机',
        ingredients: [
            ['煤炭', 8]
        ]
    },
    '压缩碳': {
        type: '压缩机',
        ingredients: [
            ['碳', 4]
        ]
    },
    '碳块': {
        type: '高级工作台',
        ingredients: [
            ['压缩碳', 8],
            ['燧石']
        ]
    },
    '金锭(24克拉)': {
        type: '冶炼炉',
        ingredients: [
            ['金粉'],
            ['金锭(22克拉)']
        ]
    },
    '金锭(22克拉)': {
        type: '冶炼炉',
        ingredients: [
            ['金粉'],
            ['金锭(20克拉)']
        ]
    },
    '金锭(20克拉)': {
        type: '冶炼炉',
        ingredients: [
            ['金粉'],
            ['金锭(18克拉)']
        ]
    },
    '金锭(18克拉)': {
        type: '冶炼炉',
        ingredients: [
            ['金粉'],
            ['金锭(16克拉)']
        ]
    },
    '金锭(16克拉)': {
        type: '冶炼炉',
        ingredients: [
            ['金粉'],
            ['金锭(14克拉)']
        ]
    },
    '金锭(14克拉)': {
        type: '冶炼炉',
        ingredients: [
            ['金粉'],
            ['金锭(12克拉)']
        ]
    },
    '金锭(12克拉)': {
        type: '冶炼炉',
        ingredients: [
            ['金粉'],
            ['金锭(10克拉)']
        ]
    },
    '金锭(10克拉)': {
        type: '冶炼炉',
        ingredients: [
            ['金粉'],
            ['金锭(8克拉)']
        ]
    },
    '金锭(8克拉)': {
        type: '冶炼炉',
        ingredients: [
            ['金粉'],
            ['金锭(6克拉)']
        ]
    },
    '金锭(6克拉)': {
        type: '冶炼炉',
        ingredients: [
            ['金粉'],
            ['金锭(4克拉)']
        ]
    },
    '金锭(4克拉)': {
        type: '冶炼炉',
        ingredients: [
            ['金粉'],
        ]
    },
    '硅': {
        type: '冶炼炉',
        ingredients: [
            ['石英块']
        ]
    },
    '铀': {
        type: '高级工作台',
        ingredients: [
            ['一小堆铀', 4]
        ]
    },
    '镁盐': {
        type: '加热压力仓',
        ingredients: [
            ['镁'],
            ['盐']
        ]
    },
    '原油桶': {
        type: '原油泵',
        ingredients: [
            ['桶']
        ]
    },
    '燃料桶': {
        type: '炼油厂',
        ingredients: [
            ['原油桶']
        ]
    },
    '起泡锭(33%)': {
        type: '加热压力仓',
        ingredients: [
            ['金锭(24克拉)'],
            ['铀']
        ]
    },
    '起泡锭(66%)': {
        type: '加热压力仓',
        ingredients: [
            ['起泡锭(33%)'],
            ['黑金刚石']
        ]
    },
    '起泡锭': {
        type: '加热压力仓',
        ingredients: [
            ['起泡锭(66%)'],
            ['下界之星']
        ]
    },
    '浓缩下界冰': {
        type: '加热压力仓',
        ingredients: [
            ['下界冰'],
            ['钚']
        ]
    },
    '镎': {
        type: '核反应堆',
        ingredients: [
            ['铀']
        ]
    },
    '钚': {
        type: '核反应堆',
        ingredients: [
            ['镎']
        ]
    },
    '高纯度铀': {
        type: '加热压力仓',
        ingredients: [
            ['钚'],
            ['铀']
        ]
    },
    //食物
    '幸运饼干': {
        type: '高级工作台',
        ingredients: [
            ['曲奇'],
            ['纸']
        ]
    },
    '减肥曲奇': {
        type: '魔法工作台',
        ingredients: [
            ['曲奇'],
            ['鞘翅鳞片']
        ]
    },
    '幸运饼干': {
        type: '高级工作台',
        ingredients: [
            ['曲奇'],
            ['纸']
        ]
    },
    '牛肉干': {
        type: '高级工作台',
        ingredients: [
            ['盐'],
            ['牛排']
        ]
    },
    '猪肉干': {
        type: '高级工作台',
        ingredients: [
            ['盐'],
            ['熟猪排']
        ]
    },
    '鸡肉干': {
        type: '高级工作台',
        ingredients: [
            ['盐'],
            ['熟鸡肉']
        ]
    },
    '羊肉干': {
        type: '高级工作台',
        ingredients: [
            ['盐'],
            ['熟羊肉']
        ]
    },
    '兔肉干': {
        type: '高级工作台',
        ingredients: [
            ['盐'],
            ['熟兔肉']
        ]
    },
    '鱼干': {
        type: '高级工作台',
        ingredients: [
            ['盐'],
            ['熟鳕鱼']
        ]
    },
    '魔法糖': {
        type: '高级工作台',
        ingredients: [
            ['糖'],
            ['红石粉'],
            ['萤石粉']
        ]
    },
    '怪物肉干': {
        type: '高级工作台',
        ingredients: [
            ['盐'],
            ['腐肉']
        ]
    },
    '苹果汁': {
        type: '榨汁机',
        ingredients: [
            ['苹果']
        ]
    },
    '胡萝卜汁': {
        type: '榨汁机',
        ingredients: [
            ['胡萝卜']
        ]
    },
    '西瓜汁': {
        type: '榨汁机',
        ingredients: [
            ['西瓜']
        ]
    },
    '南瓜汁': {
        type: '榨汁机',
        ingredients: [
            ['南瓜']
        ]
    },
    '浆果汁': {
        type: '榨汁机',
        ingredients: [
            ['甜浆果']
        ]
    },
    '金苹果汁': {
        type: '榨汁机',
        ingredients: [
            ['金苹果']
        ]
    },
    //魔法物品
    '魔法因子-I': {
        type: '磨石',
        ingredients: [
            ['地狱疣']
        ],
        'count': 2
    },
    '魔法因子-II': {
        type: '高级工作台',
        ingredients: [
            ['魔法因子-I', 4]
        ]
    },
    '魔法因子-III': {
        type: '高级工作台',
        ingredients: [
            ['魔法因子-II', 4]
        ]
    },
    '末影因子-I': {
        type: '高级工作台',
        ingredients: [
            ['末影之眼']
        ],
        'count': 2
    },
    '末影因子-II': {
        type: '高级工作台',
        ingredients: [
            ['末影因子-I', 4]
        ]
    },
    '末影因子-III': {
        type: '高级工作台',
        ingredients: [
            ['末影因子-II', 4]
        ]
    },
    '魔法书皮': {
        type: '高级工作台',
        ingredients: [
            ['魔法因子-II', 4],
            ['书']
        ]
    },
    '岩浆水晶': {
        type: '高级工作台',
        ingredients: [
            ['魔法因子-I', 4],
            ['烈焰粉', 4],
            ['古代符文[火]']
        ]
    },
    '普通护身符': {
        type: '魔法工作台',
        ingredients: [
            ['魔法因子-II', 4],
            ['金锭(8克拉)', 2],
            ['绿宝石']
        ]
    },
    '坏死颅骨': {
        type: '魔法工作台',
        ingredients: [
            ['魔法因子-III', 4],
            ['凋零骷髅头颅']
        ]
    },
    '来世精华': {
        type: '古代祭坛',
        ingredients: [
            ['末影因子-III', 4],
            ['古代符文[气]'],
            ['古代符文[地]'],
            ['古代符文[火]'],
            ['古代符文[水]'],
            ['坏死颅骨']
        ]
    },
    '古代基座': {
        type: '魔法工作台',
        ingredients: [
            ['黑曜石', 4],
            ['金锭(8克拉)', 2],
            ['石头']
        ],
        count: 4
    },
    '空白符文': {
        type: '古代祭坛',
        ingredients: [
            ['魔法因子-I', 4],
            ['石头', 4],
            ['黑曜石']
        ]
    },
    '古代符文[气]': {
        type: '古代祭坛',
        ingredients: [
            ['魔法因子-I', 2],
            ['羽毛', 4],
            ['恶魂之泪', 2],
            ['空白符文']
        ],
        count: 4
    },
    '古代符文[地]': {
        type: '古代祭坛',
        ingredients: [
            ['魔法因子-I', 2],
            ['泥土', 2],
            ['石头', 2],
            ['黑曜石', 2],
            ['空白符文']
        ],
        count: 4
    },
    '古代符文[火]': {
        type: '古代祭坛',
        ingredients: [
            ['魔法因子-II', 2],
            ['火焰弹', 4],
            ['烈焰粉'],
            ['打火石'],
            ['古代符文[地]']
        ],
        count: 4
    },
    '古代符文[水]': {
        type: '古代祭坛',
        ingredients: [
            ['魔法因子-II', 2],
            ['水桶', 2],
            ['沙子', 2],
            ['生鲑鱼'],
            ['生鳕鱼'],
            ['空白符文']
        ],
        count: 4
    },
    '古代符文[末影]': {
        type: '古代祭坛',
        ingredients: [
            ['末影因子-III', 2],
            ['末影之眼', 2],
            ['末影珍珠', 4],
            ['空白符文']
        ],
        count: 6
    },
    '古代符文[雷]': {
        type: '古代祭坛',
        ingredients: [
            ['魔法因子-III', 2],
            ['铁锭', 4],
            ['幻翼膜'],
            ['古代符文[气]'],
            ['古代符文[水]']
        ],
        count: 4
    },
    '古代符文[虹]': {
        type: '古代祭坛',
        ingredients: [
            ['魔法因子-III', 2],
            ['羊毛', 2],
            ['红色染料'],
            ['青色染料'],
            ['黄色染料'],
            ['品红色染料'],
            ['古代符文[末影]']
        ]
    },
    '古代符文[灵魂绑定]': {
        type: '古代祭坛',
        ingredients: [
            ['魔法因子-III', 4],
            ['末影因子-III', 2],
            ['来世精华', 2],
            ['古代符文[末影]']
        ]
    },
    //魔法防具
    '末影头盔': {
        type: '盔甲锻造台',
        ingredients: [
            ['末影因子-I', 2],
            ['黑曜石', 2],
            ['末影之眼']
        ]
    },
    '末影胸甲': {
        type: '盔甲锻造台',
        ingredients: [
            ['末影因子-I', 2],
            ['黑曜石', 5],
            ['末影之眼']
        ]
    },
    '末影护腿': {
        type: '盔甲锻造台',
        ingredients: [
            ['末影因子-I', 2],
            ['黑曜石', 4],
            ['末影之眼']
        ]
    },
    '末影靴子': {
        type: '盔甲锻造台',
        ingredients: [
            ['末影因子-I', 2],
            ['黑曜石', 2]
        ]
    },
    '史莱姆头盔': {
        type: '盔甲锻造台',
        ingredients: [
            ['铁锭', 3],
            ['粘液球', 2]
        ]
    },
    '史莱姆胸甲': {
        type: '盔甲锻造台',
        ingredients: [
            ['铁锭', 4],
            ['粘液球', 4]
        ]
    },
    '史莱姆护腿': {
        type: '盔甲锻造台',
        ingredients: [
            ['铁锭', 5],
            ['粘液球', 2]
        ]
    },
    '史莱姆靴子': {
        type: '盔甲锻造台',
        ingredients: [
            ['铁锭', 2],
            ['粘液球', 2]
        ]
    },
    '萤石头盔': {
        type: '盔甲锻造台',
        ingredients: [
            ['萤石', 5]
        ]
    },
    '萤石胸甲': {
        type: '盔甲锻造台',
        ingredients: [
            ['萤石', 8]
        ]
    },
    '萤石护腿': {
        type: '盔甲锻造台',
        ingredients: [
            ['萤石', 7]
        ]
    },
    '萤石靴子': {
        type: '盔甲锻造台',
        ingredients: [
            ['萤石', 4]
        ]
    },
    '史莱姆头盔': {
        type: '盔甲锻造台',
        ingredients: [
            ['粘液球', 4],
            ['钢板']
        ]
    },
    '史莱姆胸甲': {
        type: '盔甲锻造台',
        ingredients: [
            ['粘液球', 7],
            ['钢板']
        ]
    },
    '史莱姆护腿': {
        type: '盔甲锻造台',
        ingredients: [
            ['粘液球', 6],
            ['钢板']
        ]
    },
    '史莱姆靴子': {
        type: '盔甲锻造台',
        ingredients: [
            ['粘液球', 4],
            ['钢板']
        ]
    },
    '农夫的靴子': {
        type: '盔甲锻造台',
        ingredients: [
            ['干草块', 4]
        ]
    },
    '践踏者之靴': {
        type: '盔甲锻造台',
        ingredients: [
            ['黄色羊毛', 2],
            ['活塞', 2]
        ]
    },
    '灵魂绑定头盔': {
        type: '魔法工作台',
        ingredients: [
            ['来世精华', 2],
            ['钻石头盔']
        ]
    },
    '灵魂绑定胸甲': {
        type: '魔法工作台',
        ingredients: [
            ['来世精华', 2],
            ['钻石胸甲']
        ]
    },
    '灵魂绑定护腿': {
        type: '魔法工作台',
        ingredients: [
            ['来世精华', 2],
            ['钻石护腿']
        ]
    },
    '灵魂绑定靴子': {
        type: '魔法工作台',
        ingredients: [
            ['来世精华', 2],
            ['钻石靴子']
        ]
    },
    //科技零件
    '磁铁': {
        type: '冶炼炉',
        ingredients: [
            ['镍锭'],
            ['铝粉'],
            ['铁粉'],
            ['钴锭']
        ]
    },
    '高级电路板': {
        type: '高级工作台',
        ingredients: [
            ['红石块', 2],
            ['青金石块', 6],
            ['基础电路板']
        ]
    },
    '电池': {
        type: '高级工作台',
        ingredients: [
            ['锌锭', 2],
            ['铜锭', 2],
            ['硫酸盐', 2],
            ['红石粉']
        ]
    },
    '钢推进器': {
        type: '高级工作台',
        ingredients: [
            ['铝青铜锭', 3],
            ['钢板', 2],
            ['火焰弹'],
            ['红石粉']
        ]
    },
    '能量水晶': {
        type: '高级工作台',
        ingredients: [
            ['红石粉', 4],
            ['人造蓝宝石', 4],
            ['人造钻石']
        ]
    },
    '太阳能板': {
        type: '高级工作台',
        ingredients: [
            ['玻璃', 3],
            ['硅', 3],
            ['硅铁', 3]
        ]
    },
    '电磁铁': {
        type: '高级工作台',
        ingredients: [
            ['电池'],
            ['磁铁'],
            ['镍锭'],
            ['钴锭']
        ]
    },
    '电动马达': {
        type: '高级工作台',
        ingredients: [
            ['铜线', 6],
            ['电磁铁']
        ]
    },
    '加热线圈': {
        type: '高级工作台',
        ingredients: [
            ['铜线', 8],
            ['电动马达']
        ]
    },
    '铜线': {

        type: '高级工作台',
        ingredients: [
            ['铜锭', 3]
        ],
        count: 8
    },
    '钢化玻璃': {
        type: '高级工作台',
        ingredients: [
            ['玻璃', 8],
            ['钢筋板']
        ],
        count: 16
    },
    '太阳能阵列': {
        type: '高级工作台',
        ingredients: [
            ['钢化玻璃', 6],
            ['太阳能板', 3]
        ]
    },
    '冷却装置': {
        type: '高级工作台',
        ingredients: [
            ['冰', 6],
            ['铝锭', 2],
            ['电动马达']
        ]
    },
    '防凋灵黑曜石': {
        type: '高级工作台',
        ingredients: [
            ['铅锭', 4],
            ['黑曜石', 4],
            ['钢化玻璃']
        ],
        count: 4
    },
    '防凋灵玻璃': {
        type: '高级工作台',
        ingredients: [
            ['铅锭', 4],
            ['防凋灵黑曜石', 4],
            ['钢化玻璃']
        ],
        count: 4
    },
    '反应堆冷却剂': {
        type: '冰箱',
        ingredients: [
            ['蓝冰']
        ]
    },
    '下界冰冷却剂': {
        type: '加热压力仓',
        ingredients: [
            ['浓缩下界冰']
        ]
    },
    //杂项
    '筛矿': {
        type: '淘金盘',
        ingredients: [
            ['沙砾']
        ]
    },
    '小麦粉': {
        type: '磨石',
        ingredients: [
            ['小麦']
        ]
    },
    '钢板': {
        type: '压缩机',
        ingredients: [
            ['钢锭', 8]
        ]
    },
    '锁链': {
        type: '高级工作台',
        ingredients: [
            ['钢锭', 3]
        ],
        count: 8
    },
    '钩子': {
        type: '高级工作台',
        ingredients: [
            ['钢锭', 3]
        ]
    },
    '石块': {
        type: '洗矿机',
        ingredients: [
            ['筛矿']
        ]
    },
    '盐': {
        type: '洗矿机',
        ingredients: [
            ['沙子', 4]
        ]
    },
    '浓奶油': {
        type: '高级工作台',
        ingredients: [
            ['牛奶桶']
        ]
    },
    '黄油': {
        type: '高级工作台',
        ingredients: [
            ['牛奶桶'],
            ['盐']
        ]
    },
    '奶酪': {
        type: '高级工作台',
        ingredients: [
            ['浓奶油'],
            ['盐']
        ]
    },
    '已粉碎的矿石': {
        type: '矿石粉碎机',
        ingredients: [
            ['筛矿']
        ]
    },
    '粉末状的矿石': {
        type: '矿石粉碎机',
        ingredients: [
            ['已粉碎的矿石']
        ]
    },
    '纯矿簇': {
        type: '洗矿机',
        ingredients: [
            ['粉末状的矿石']
        ]
    },
    '一小块铀': {
        type: '矿石粉碎机',
        ingredients: [
            ['纯矿簇']
        ]
    },
    '一小堆铀': {
        type: '高级工作台',
        ingredients: [
            ['一小块铀', 9]
        ]
    },
    '布': {
        type: '高级工作台',
        ingredients: [
            ['白色羊毛']
        ],
        count: 8
    },
    '锡罐': {
        type: '高级工作台',
        ingredients: [
            ['锡锭', 8]
        ],
        count: 4
    },
    '金块(24克拉)': {
        type: '高级工作台',
        ingredients: [
            ['金锭(24克拉)', 9]
        ]
    },
    '钢筋板': {
        type: '压缩机',
        ingredients: [
            ['强化合金锭', 8]
        ]
    },
    '强力胶布': {
        type: '高级工作台',
        ingredients: [
            ['铝粉', 3],
            ['纸', 3],
            ['粘液球', 2],
            ['白色羊毛']
        ],
        count: 2
    },
    '塑料纸': {
        type: '加热压力仓',
        ingredients: [
            ['原油桶']
        ]
    },
    '机器人内存核心': {
        type: '高级工作台',
        ingredients: [
            ['黄铜锭', 4],
            ['能量水晶', 2],
            ['橙色染色玻璃', 2],
            ['锡粉']
        ]
    },
    '有机肥料': {
        type: '食品堆肥器',
        ingredients: [
            ['有机食物']
        ]
    },
    //防具
    '大马士革钢头盔': {
        type: '盔甲锻造台',
        ingredients: [
            ['大马士革钢锭', 5]
        ]
    },
    '大马士革钢胸甲': {
        type: '盔甲锻造台',
        ingredients: [
            ['大马士革钢锭', 8]
        ]
    },
    '大马士革钢护腿': {
        type: '盔甲锻造台',
        ingredients: [
            ['大马士革钢锭', 7]
        ]
    },
    '大马士革钢靴子': {
        type: '盔甲锻造台',
        ingredients: [
            ['大马士革钢锭', 4]
        ]
    },
    '强化合金头盔': {
        type: '盔甲锻造台',
        ingredients: [
            ['强化合金锭', 5]
        ]
    },
    '强化合金胸甲': {
        type: '盔甲锻造台',
        ingredients: [
            ['强化合金锭', 8]
        ]
    },
    '强化合金护腿': {
        type: '盔甲锻造台',
        ingredients: [
            ['强化合金锭', 7]
        ]
    },
    '强化合金靴子': {
        type: '盔甲锻造台',
        ingredients: [
            ['强化合金锭', 4]
        ]
    },
    '仙人掌头盔': {
        type: '盔甲锻造台',
        ingredients: [
            ['仙人掌', 5]
        ]
    },
    '仙人掌胸甲': {
        type: '盔甲锻造台',
        ingredients: [
            ['仙人掌', 8]
        ]
    },
    '仙人掌护腿': {
        type: '盔甲锻造台',
        ingredients: [
            ['仙人掌', 7]
        ]
    },
    '仙人掌靴子': {
        type: '盔甲锻造台',
        ingredients: [
            ['仙人掌', 4]
        ]
    },
    '锁链头盔': {
        type: '盔甲锻造台',
        ingredients: [
            ['锁链', 5]
        ]
    },
    '锁链胸甲': {
        type: '盔甲锻造台',
        ingredients: [
            ['锁链', 8]
        ]
    },
    '锁链护腿': {
        type: '盔甲锻造台',
        ingredients: [
            ['锁链', 7]
        ]
    },
    '锁链靴子': {
        type: '盔甲锻造台',
        ingredients: [
            ['锁链', 4]
        ]
    },
    '镀金铁头盔': {
        type: '盔甲锻造台',
        ingredients: [
            ['镀金铁锭', 5]
        ]
    },
    '镀金铁胸甲': {
        type: '盔甲锻造台',
        ingredients: [
            ['镀金铁锭', 8]
        ]
    },
    '镀金铁护腿': {
        type: '盔甲锻造台',
        ingredients: [
            ['镀金铁锭', 7]
        ]
    },
    '镀金铁靴子': {
        type: '盔甲锻造台',
        ingredients: [
            ['镀金铁锭', 4]
        ]
    },
    '潜水头盔': {
        type: '盔甲锻造台',
        ingredients: [
            ['橙色羊毛', 3],
            ['黑色羊毛', 2],
            ['玻璃板']
        ]
    },
    '防化服': {
        type: '盔甲锻造台',
        ingredients: [
            ['橙色羊毛', 5],
            ['黑色羊毛', 3]
        ]
    },
    '防化护腿': {
        type: '盔甲锻造台',
        ingredients: [
            ['橙色羊毛', 4],
            ['黑色羊毛', 3]
        ]
    },
    '橡胶靴': {
        type: '盔甲锻造台',
        ingredients: [
            ['黑色羊毛', 4]
        ]
    },
    '金头盔': {
        type: '盔甲锻造台',
        ingredients: [
            ['金锭(12克拉)', 5]
        ]
    },
    '金胸甲': {
        type: '盔甲锻造台',
        ingredients: [
            ['金锭(12克拉)', 8]
        ]
    },
    '金护腿': {
        type: '盔甲锻造台',
        ingredients: [
            ['金锭(12克拉)', 7]
        ]
    },
    '金靴子': {
        type: '盔甲锻造台',
        ingredients: [
            ['金锭(12克拉)', 4]
        ]
    },
    //护身符-1级
    '铁砧护身符': {
        type: '魔法工作台',
        ingredients: [
            ['魔法因子-III', 4],
            ['铁砧', 2],
            ['普通护身符']
        ],
        count: 4
    },
    '矿工护身符': {
        type: '魔法工作台',
        ingredients: [
            ['魔法因子-III', 4],
            ['筛矿'],
            ['人造蓝宝石'],
            ['普通护身符']
        ]
    },
    '猎人护身符': {
        type: '魔法工作台',
        ingredients: [
            ['魔法因子-III', 4],
            ['怪物肉干'],
            ['人造蓝宝石'],
            ['普通护身符']
        ]
    },
    '岩浆行者护身符': {
        type: '魔法工作台',
        ingredients: [
            ['魔法因子-III', 4],
            ['熔岩桶'],
            ['人造蓝宝石'],
            ['普通护身符']
        ],
        count: 4
    },
    '潜水者护身符': {
        type: '魔法工作台',
        ingredients: [
            ['魔法因子-III', 4],
            ['水桶'],
            ['钓鱼竿'],
            ['普通护身符']
        ],
        count: 4
    },
    '天使护身符': {
        type: '魔法工作台',
        ingredients: [
            ['魔法因子-III', 4],
            ['羽毛', 2],
            ['普通护身符']
        ]
    },
    '消防员护身符': {
        type: '魔法工作台',
        ingredients: [
            ['魔法因子-III', 4],
            ['岩浆水晶', 2],
            ['普通护身符']
        ],
        count: 4
    },
    '魔法师护身符': {
        type: '魔法工作台',
        ingredients: [
            ['末影因子-III', 4],
            ['附魔台', 2],
            ['普通护身符']
        ]
    },
    '旅行者护身符': {
        type: '魔法工作台',
        ingredients: [
            ['魔法因子-III', 4],
            ['元素法杖-风', 2],
            ['天使护身符']
        ]
    },
    '战士护身符': {
        type: '魔法工作台',
        ingredients: [
            ['魔法因子-III', 4],
            ['强化合金锭', 2],
            ['普通护身符']
        ],
        count: 4
    },
    '骑士护身符': {
        type: '魔法工作台',
        ingredients: [
            ['魔法因子-III', 4],
            ['镀金铁锭', 2],
            ['战术护身符']
        ],
        count: 4
    },
    '旋风护身符': {
        type: '魔法工作台',
        ingredients: [
            ['魔法因子-III', 4],
            ['元素法杖-风', 2],
            ['旅行者护身符']
        ]
    },
    '巫师护身符': {
        type: '魔法工作台',
        ingredients: [
            ['末影因子-III', 4],
            ['魔法末影之眼', 2],
            ['魔法师护身符']
        ]
    },
    //魔法工具
    '末影背包': {
        type: '魔法工作台',
        ingredients: [
            ['末影因子-II', 4],
            ['皮革', 4],
            ['箱子']
        ]
    },
    '魔法末影之眼': {
        type: '魔法工作台',
        ingredients: [
            ['末影因子-II', 4],
            ['末影珍珠', 4],
            ['末影之眼']
        ]
    },
    '元素法杖': {
        type: '魔法工作台',
        ingredients: [
            ['魔法因子-III', 2],
            ['魔法书皮', 2],
            ['木棍']
        ]
    },
    '元素法杖-风': {
        type: '魔法工作台',
        ingredients: [
            ['元素法杖', 2],
            ['羽毛', 2],
            ['末影因子-III']
        ]
    },
    '元素法杖-水': {
        type: '魔法工作台',
        ingredients: [
            ['元素法杖', 2],
            ['睡莲', 2],
            ['魔法因子-II']
        ]
    },
    '元素法杖-火': {
        type: '魔法工作台',
        ingredients: [
            ['元素法杖', 2],
            ['岩浆水晶']
        ]
    },
    '元素法杖-雷': {
        type: '古代祭坛',
        ingredients: [
            ['末影因子-III', 2],
            ['古代符文[雷]', 4],
            ['元素法杖-风'],
            ['元素法杖-水'],
            ['魔法糖']
        ]
    },
    '吸入磁铁': {
        type: '魔法工作台',
        ingredients: [
            ['魔法因子-III', 4],
            ['末影因子-II', 2],
            ['磁铁']
        ]
    },
    '已修复的刷怪笼': {
        type: '古代祭坛',
        ingredients: [
            ['学识之瓶', 4],
            ['古代符文[末影]', 2],
            ['来世精华', 2],
            ['已损坏的刷怪笼']
        ]
    },
    '维度传送卷轴': {
        type: '魔法工作台',
        ingredients: [
            ['末影因子-III', 4],
            ['魔法末影之眼', 2],
            ['魔法书皮']
        ]
    },
    '知识共享之书': {
        type: '魔法工作台',
        ingredients: [
            ['羽毛'],
            ['玻璃瓶'],
            ['墨囊'],
            ['书与笔'],
            ['魔法书皮']
        ]
    },
    '学识之瓶': {
        type: '魔法工作台',
        ingredients: [
            ['魔法因子-II', 3],
            ['玻璃板']
        ],
        count: 8
    },
    '古代祭坛': {
        type: '魔法工作台',
        ingredients: [
            ['魔法因子-III', 2],
            ['黑曜石', 2],
            ['金锭(8克拉)', 2],
            ['附魔台']
        ]
    },
    '地狱骨粉': {
        type: '古代祭坛',
        ingredients: [
            ['魔法因子-II', 2],
            ['地狱疣', 4],
            ['古代符文[地]'],
            ['烈焰粉'],
            ['骨粉']
        ]
    },
    '鞘翅鳞片': {
        type: '古代祭坛',
        ingredients: [
            ['末影因子-III', 4],
            ['古代符文[气]', 2],
            ['幻翼膜', 2],
            ['羽毛']
        ]
    },
    '鞘翅': {
        type: '古代祭坛',
        ingredients: [
            ['鞘翅鳞片', 4],
            ['古代符文[气]', 4],
            ['皮革外套']
        ]
    },
    '经验修补鞘翅': {
        type: '古代祭坛',
        ingredients: [
            ['学识之瓶', 6],
            ['鞘翅鳞片', 2],
            ['鞘翅']
        ]
    },
    '灵魂绑定鞘翅': {
        type: '古代祭坛',
        ingredients: [
            ['学识之瓶', 4],
            ['鞘翅鳞片', 2],
            ['来世精华'],
            ['鞘翅']
        ]
    },
    '不死图腾': {
        type: '古代祭坛',
        ingredients: [
            ['魔法因子-III', 2],
            ['来世精华', 4],
            ['绿宝石块', 2],
            ['普通护身符']
        ]
    },
    '彩虹羊毛': {
        type: '古代祭坛',
        ingredients: [
            ['白色羊毛', 8],
            ['古代符文[虹]']
        ],
        count: 8
    },
    '彩虹玻璃': {
        type: '古代祭坛',
        ingredients: [
            ['白色染色玻璃', 8],
            ['古代符文[虹]']
        ],
        count: 8
    },
    '彩虹玻璃板': {
        type: '古代祭坛',
        ingredients: [
            ['白色染色玻璃板', 8],
            ['古代符文[虹]']
        ],
        count: 8
    },
    '彩虹粘土块': {
        type: '古代祭坛',
        ingredients: [
            ['白色陶瓦', 8],
            ['古代符文[虹]']
        ],
        count: 8
    },
    '吸入漏斗': {
        type: '古代祭坛',
        ingredients: [
            ['黑曜石', 2],
            ['漏斗', 2],
            ['古代符文[地]', 2],
            ['古代符文[末影]', 2],
            ['吸入磁铁']
        ]
    },
    //科技工具
    '电力喷射背包-I': {
        type: '高级工作台',
        ingredients: [
            ['硬铝锭', 4],
            ['钢推进器', 2],
            ['能量水晶'],
            ['小型储能电容']
        ]
    },
    '电力喷射背包-II': {
        type: '高级工作台',
        ingredients: [
            ['焊锡锭', 4],
            ['钢推进器', 2],
            ['能量水晶'],
            ['小型储能电容']
        ]
    },
    '电力喷射背包-III': {
        type: '高级工作台',
        ingredients: [
            ['银铜合金锭', 4],
            ['钢推进器', 2],
            ['能量水晶'],
            ['小型储能电容']
        ]
    },
    '电力喷射背包-IV': {
        type: '高级工作台',
        ingredients: [
            ['钢锭', 4],
            ['钢推进器', 2],
            ['能量水晶'],
            ['小型储能电容']
        ]
    },
    '电力喷射背包-V': {
        type: '高级工作台',
        ingredients: [
            ['大马士革钢锭', 4],
            ['钢推进器', 2],
            ['能量水晶'],
            ['小型储能电容']
        ]
    },
    '电力喷射背包-VI': {
        type: '高级工作台',
        ingredients: [
            ['强化合金锭', 4],
            ['钢推进器', 2],
            ['能量水晶'],
            ['中型储能电容']
        ]
    },
    '电力喷射背包-VII': {
        type: '高级工作台',
        ingredients: [
            ['黑金刚石', 4],
            ['钢推进器', 2],
            ['能量水晶'],
            ['巨型储能电容']
        ]
    },
    '降落伞': {
        type: '高级工作台',
        ingredients: [
            ['布', 3],
            ['锁链', 2]
        ]
    },
    '全息投影仪': {
        type: '高级工作台',
        ingredients: [
            ['铝黄铜锭', 3],
            ['能量水晶'],
            ['电动马达']
        ],
        count: 3
    },
    '多功能工具-I': {
        type: '高级工作台',
        ingredients: [
            ['硬铝锭', 5],
            ['小型储能电容']
        ]
    },
    '多功能工具-II': {
        type: '高级工作台',
        ingredients: [
            ['焊锡锭', 5],
            ['小型储能电容']
        ]
    },
    '多功能工具-III': {
        type: '高级工作台',
        ingredients: [
            ['银铜合金锭', 5],
            ['小型储能电容']
        ]
    },
    '多功能工具-IV': {
        type: '高级工作台',
        ingredients: [
            ['钢锭', 5],
            ['小型储能电容']
        ]
    },
    '多功能工具-V': {
        type: '高级工作台',
        ingredients: [
            ['大马士革钢锭', 5],
            ['小型储能电容']
        ]
    },
    '多功能工具-VI': {
        type: '高级工作台',
        ingredients: [
            ['强化合金锭', 5],
            ['中型储能电容']
        ]
    },
    '多功能工具-VII': {
        type: '高级工作台',
        ingredients: [
            ['黑金刚石', 5],
            ['巨型储能电容']
        ]
    },
    '太阳能头盔': {
        type: '高级工作台',
        ingredients: [
            ['强化合金锭', 4],
            ['中型储能电容', 2],
            ['太阳能板']
        ]
    },
    '夜视眼镜': {
        type: '盔甲锻造台',
        ingredients: [
            ['煤炭块', 6],
            ['黄绿色染色玻璃板', 2]
        ]
    },
    '喷气靴-I': {
        type: '高级工作台',
        ingredients: [
            ['硬铝锭', 2],
            ['钢推进器', 2],
            ['能量水晶'],
            ['小型储能电容']
        ]
    },
    '喷气靴-II': {
        type: '高级工作台',
        ingredients: [
            ['焊锡锭', 2],
            ['钢推进器', 2],
            ['能量水晶'],
            ['小型储能电容']
        ]
    },
    '喷气靴-III': {
        type: '高级工作台',
        ingredients: [
            ['银铜合金锭', 2],
            ['钢推进器', 2],
            ['能量水晶'],
            ['小型储能电容']
        ]
    },
    '喷气靴-IV': {
        type: '高级工作台',
        ingredients: [
            ['钢锭', 2],
            ['钢推进器', 2],
            ['能量水晶'],
            ['小型储能电容']
        ]
    },
    '喷气靴-V': {
        type: '高级工作台',
        ingredients: [
            ['大马士革钢锭', 2],
            ['钢推进器', 2],
            ['能量水晶'],
            ['小型储能电容']
        ]
    },
    '喷气靴-VI': {
        type: '高级工作台',
        ingredients: [
            ['强化合金锭', 2],
            ['钢推进器', 2],
            ['能量水晶'],
            ['中型储能电容']
        ]
    },
    '喷气靴-VII': {
        type: '高级工作台',
        ingredients: [
            ['黑金刚石', 2],
            ['钢推进器', 2],
            ['能量水晶'],
            ['巨型储能电容']
        ]
    },
    '装甲喷气靴': {
        type: '高级工作台',
        ingredients: [
            ['钢板', 2],
            ['钢推进器', 2],
            ['能量水晶'],
            ['中型储能电容']
        ]
    },
    //护身符-2级
    '末影铁砧护身符': {
        type: '魔法工作台',
        ingredients: [
            ['末影因子-III', 4],
            ['铁砧护身符']
        ],
        count: 4
    },
    '末影矿工护身符': {
        type: '魔法工作台',
        ingredients: [
            ['末影因子-III', 4],
            ['矿工护身符']
        ]
    },
    '末影猎人护身符': {
        type: '魔法工作台',
        ingredients: [
            ['末影因子-III', 4],
            ['猎人护身符']
        ]
    },
    '末影岩浆行者护身符': {
        type: '魔法工作台',
        ingredients: [
            ['末影因子-III', 4],
            ['岩浆行者护身符']
        ],
        count: 4
    },
    '末影潜水者护身符': {
        type: '魔法工作台',
        ingredients: [
            ['末影因子-III', 4],
            ['潜水者护身符']
        ],
        count: 4
    },
    '末影天使护身符': {
        type: '魔法工作台',
        ingredients: [
            ['末影因子-III', 4],
            ['天使护身符']
        ]
    },
    '末影消防员护身符': {
        type: '魔法工作台',
        ingredients: [
            ['末影因子-III', 4],
            ['消防员护身符']
        ],
        count: 4
    },
    '末影魔法师护身符': {
        type: '魔法工作台',
        ingredients: [
            ['末影因子-III', 4],
            ['魔法师护身符']
        ]
    },
    '末影旅行者护身符': {
        type: '魔法工作台',
        ingredients: [
            ['末影因子-III', 4],
            ['旅行者护身符']
        ]
    },
    '末影战士护身符': {
        type: '魔法工作台',
        ingredients: [
            ['末影因子-III', 4],
            ['战士护身符']
        ],
        count: 4
    },
    '末影骑士护身符': {
        type: '魔法工作台',
        ingredients: [
            ['末影因子-III', 4],
            ['骑士护身符']
        ],
        count: 4
    },
    '末影旋风护身符': {
        type: '魔法工作台',
        ingredients: [
            ['末影因子-III', 4],
            ['旋风护身符']
        ]
    },
    '末影巫师护身符': {
        type: '魔法工作台',
        ingredients: [
            ['末影因子-III', 4],
            ['巫师护身符']
        ]
    },
    //能源与电力
    '能源调节器': {
        type: '高级工作台',
        ingredients: [
            ['银锭', 4],
            ['大马士革钢锭', 4],
            ['电动马达']
        ]
    },
    '小型储能电容': {
        map: [
            ["硬铝锭", "硫酸盐", "硬铝锭"],
            ["红石合金锭", "能源连接器", "红石合金锭"],
            ["硬铝锭", "红石粉", "硬铝锭"],
        ],
        type: '高级工作台',
        ingredients: [
            ['硬铝锭', 4],
            ['红石合金锭', 2],
            ['红石粉'],
            ['硫酸盐'],
            ['能源连接器']
        ]
    },
    '中型储能电容': {
        map: [
            ["银铜合金锭", "红石合金锭", "银铜合金锭"],
            ["红石粉", "小型储能电容", "红石粉"],
            ["银铜合金锭", "红石合金锭", "银铜合金锭"],
        ],
        type: '高级工作台',
        ingredients: [
            ['银铜合金锭', 4],
            ['红石合金锭', 2],
            ['红石粉', 2],
            ['小型储能电容']
        ]
    },
    '大型储能电容': {
        map: [
            ["钢锭", "红石合金锭", "钢锭"],
            ["红石粉", "中型储能电容", "红石粉"],
            ["钢锭", "红石合金锭", "钢锭"],
        ],
        type: '高级工作台',
        ingredients: [
            ['钢锭', 4],
            ['红石合金锭', 2],
            ['红石粉', 2],
            ['中型储能电容']
        ]
    },
    '巨型储能电容': {
        map: [
            ["强化合金锭", "红石合金锭", "强化合金锭"],
            ["红石粉", "大型储能电容", "红石粉"],
            ["强化合金锭", "红石合金锭", "强化合金锭"],
        ],
        type: '高级工作台',
        ingredients: [
            ['强化合金锭', 4],
            ['红石合金锭', 2],
            ['红石粉', 2],
            ['大型储能电容']
        ]
    },
    '黑金刚石镶边储能电容': {
        map: [
            ["黑金刚石", "红石合金锭", "黑金刚石"],
            ["红石粉", "巨型储能电容", "红石粉"],
            ["黑金刚石", "红石合金锭", "黑金刚石"],
        ],
        type: '高级工作台',
        ingredients: [
            ['黑金刚石', 4],
            ['红石合金锭', 2],
            ['红石粉', 2],
            ['巨型储能电容']
        ]
    },
    '终极储能电容': {
        map: [
            ["黑金刚石", "红石合金锭", "黑金刚石"],
            ["下界之星", "黑金刚石镶边储能电容", "下界之星"],
            ["黑金刚石", "红石合金锭", "黑金刚石"],
        ],
        type: '高级工作台',
        ingredients: [
            ['黑金刚石', 4],
            ['红石合金锭', 2],
            ['下界之星', 2],
            ['黑金刚石镶边储能电容']
        ]
    },
    '太阳能发电机': {
        type: '高级工作台',
        ingredients: [
            ['太阳能板', 3],
            ['铝锭', 3],
            ['电动马达']
        ]
    },
    '高级太阳能发电机': {
        type: '高级工作台',
        ingredients: [
            ['太阳能发电机', 4],
            ['铝锭', 4],
            ['红石粉']
        ]
    },
    '黑金刚石太阳能发电机': {
        type: '高级工作台',
        ingredients: [
            ['高级太阳能发电机', 4],
            ['铝锭', 4],
            ['黑金刚石']
        ]
    },
    '充能太阳能发电机': {
        type: '高级工作台',
        ingredients: [
            ['黑金刚石太阳能发电机', 4],
            ['起泡锭', 4],
            ['电磁铁']
        ]
    },
    '充电台': {
        type: '高级工作台',
        ingredients: [
            ['电池', 2],
            ['小型储能电容'],
            ['电磁铁'],
            ['工作台']
        ]
    },
    '电炉': {
        type: '高级工作台',
        ingredients: [
            ['镀金铁锭', 4],
            ['熔炉'],
            ['加热线圈'],
            ['电动马达']
        ]
    },
    '电炉-II': {
        type: '高级工作台',
        ingredients: [
            ['镀金铁锭', 4],
            ['电炉'],
            ['加热线圈'],
            ['电动马达']
        ]
    },
    '电炉-III': {
        type: '高级工作台',
        ingredients: [
            ['镀金铁锭', 2],
            ['钢锭', 2],
            ['电炉-II'],
            ['加热线圈'],
            ['电动马达']
        ]
    },
    '电动淘金机': {
        type: '高级工作台',
        ingredients: [
            ['铝锭', 3],
            ['燧石', 2],
            ['淘金盘'],
            ['电动马达']
        ]
    },
    '电动淘金机-II': {
        type: '高级工作台',
        ingredients: [
            ['硬铝锭', 3],
            ['铁锭', 2],
            ['淘金盘'],
            ['电动淘金机']
        ]
    },
    '电动淘金机-III': {
        type: '高级工作台',
        ingredients: [
            ['钴锭', 2],
            ['电动马达', 2],
            ['起泡锭'],
            ['淘金盘'],
            ['电动淘金机-II']
        ]
    },
    '电动洗矿机': {
        type: '高级工作台',
        ingredients: [
            ['铜锭', 3],
            ['电磁铁', 2],
            ['水桶'],
            ['电动淘金机']
        ]
    },
    '电动洗矿机-II': {
        type: '高级工作台',
        ingredients: [
            ['大马士革钢锭', 3],
            ['电磁铁', 2],
            ['水桶'],
            ['电动洗矿机']
        ]
    },
    '电动洗矿机-III': {
        type: '高级工作台',
        ingredients: [
            ['科林斯青铜锭', 2],
            ['电磁铁', 2],
            ['水桶'],
            ['起泡锭'],
            ['电动洗矿机-II']
        ]
    },
    '电动铸锭机': {
        type: '高级工作台',
        ingredients: [
            ['大马士革钢锭', 2],
            ['加热线圈', 2],
            ['电动马达'],
            ['打火石'],
            ['电动洗矿机']
        ]
    },
    '电动铸锭机-II': {
        type: '高级工作台',
        ingredients: [
            ['镀金铁锭', 2],
            ['黄铜锭', 2],
            ['加热线圈', 2],
            ['电动马达'],
            ['打火石'],
            ['电动铸锭机']
        ]
    },
    '电动铸锭机-III': {
        type: '高级工作台',
        ingredients: [
            ['镀金铁锭', 2],
            ['黄铜锭', 2],
            ['加热线圈', 2],
            ['起泡锭'],
            ['打火石'],
            ['电动铸锭机-II']
        ]
    },
    '电动坩埚': {
        map: [
            ["铅锭", "坩埚", "铅锭"],
            ["大马士革钢锭", "加热线圈", "大马士革钢锭"],
            ["铅锭", "巨型储能电容", "铅锭"],
        ],
        type: '高级工作台',
        ingredients: [
            ['铅锭', 4],
            ['大马士革钢锭', 2],
            ['加热线圈'],
            ['坩埚'],
            ['巨型储能电容']
        ]
    },
    '电动坩埚-II': {
        type: '高级工作台',
        ingredients: [
            ['大马士革钢锭', 2],
            ['科林斯青铜锭', 2],
            ['铅锭', 2],
            ['加热线圈'],
            ['电动马达'],
            ['电动坩埚']
        ]
    },
    '电动坩埚-III': {
        type: '高级工作台',
        ingredients: [
            ['铅锭', 3],
            ['科林斯青铜锭', 2],
            ['钢板', 2],
            ['能量水晶'],
            ['电动坩埚-II']
        ]
    },
    '电力碎矿机': {
        type: '高级工作台',
        ingredients: [
            ['镀金铁锭', 4],
            ['加热线圈'],
            ['电动马达'],
            ['钻石镐']
        ]
    },
    '电力碎矿机-II': {
        type: '高级工作台',
        ingredients: [
            ['镀金铁锭', 2],
            ['加热线圈', 2],
            ['起泡锭'],
            ['钻石镐'],
            ['电力碎矿机']
        ]
    },
    '加热压力仓': {
        type: '高级工作台',
        ingredients: [
            ['铅锭', 6],
            ['加热线圈'],
            ['电动马达'],
            ['玻璃']
        ]
    },
    '加热压力仓-II': {
        type: '高级工作台',
        ingredients: [
            ['铅锭', 4],
            ['强化合金锭', 2],
            ['加热线圈'],
            ['电动马达'],
            ['加热压力仓']
        ]
    },
    '电力打粉机': {
        type: '高级工作台',
        ingredients: [
            ['铅锭', 4],
            ['加热线圈'],
            ['中型储能电容'],
            ['电力碎矿机']
        ]
    },
    '煤发电机': {
        type: '高级工作台',
        ingredients: [
            ['镍锭', 3],
            ['加热线圈', 2],
            ['电动马达'],
            ['熔炉']
        ]
    },
    '煤发电机-II': {
        type: '高级工作台',
        ingredients: [
            ['硬化金属', 2],
            ['岩浆块', 2],
            ['电动马达'],
            ['加热线圈'],
            ['煤发电机']
        ]
    },
    '生物反应器': {
        type: '高级工作台',
        ingredients: [
            ['铝黄铜锭', 3],
            ['加热线圈', 2],
            ['电动马达'],
            ['搅拌机']
        ]
    },
    '自动烘干机': {
        type: '高级工作台',
        ingredients: [
            ['加热线圈', 2],
            ['营火'],
            ['烟熏炉']
        ]
    },
    '电力碳压机': {
        type: '高级工作台',
        ingredients: [
            ['大马士革钢锭', 3],
            ['活塞', 2],
            ['电动马达'],
            ['中型储能电容']
        ]
    },
    '电力碳压机-II': {
        type: '高级工作台',
        ingredients: [
            ['大马士革钢锭', 5],
            ['粘性活塞', 2],
            ['电力碳压机'],
            ['大型储能电容']
        ]
    },
    '镁盐发电机': {
        type: '高级工作台',
        ingredients: [
            ['硬铝锭', 3],
            ['压缩碳', 2],
            ['电动马达'],
            ['水桶']
        ]
    },
    '自动附魔机': {
        type: '高级工作台',
        ingredients: [
            ['防凋灵黑曜石', 3],
            ['黑金刚石', 2],
            ['电动马达'],
            ['附魔台']
        ]
    },
    '自动袪魔机': {
        type: '高级工作台',
        ingredients: [
            ['防凋灵黑曜石', 3],
            ['黑金刚石', 2],
            ['红石粉', 2],
            ['铁砧'],
            ['自动附魔机']
        ]
    },
    '自动铁砧': {
        type: '高级工作台',
        ingredients: [
            ['铁块', 3],
            ['强化合金锭', 2],
            ['电动马达'],
            ['铁砧']
        ]
    },
    '自动铁砧-II': {
        type: '高级工作台',
        ingredients: [
            ['铁块', 3],
            ['钢板', 2],
            ['加热线圈'],
            ['自动铁砧']
        ]
    },
    '万用表': {
        type: '高级工作台',
        ingredients: [
            ['铜锭', 2],
            ['红石合金锭'],
            ['金锭(6克拉)']
        ]
    },
    '电力碳压机': {
        type: '高级工作台',
        ingredients: [
            ['大马士革钢锭', 3],
            ['活塞', 2],
            ['电动马达'],
            ['中型储能电容']
        ]
    },
    '可编程式机器人(普通)': {
        type: '高级工作台',
        ingredients: [
            ['塑料纸', 5],
            ['煤发电机'],
            ['箱子'],
            ['电动马达'],
            ['机器人内存核心']
        ]
    },
    '可编程式机器人(矿工)': {
        type: '高级工作台',
        ingredients: [
            ['钻石镐', 2],
            ['电动马达'],
            ['可编程式机器人(普通)']
        ]
    },
    '可编程式机器人(农夫)': {
        type: '高级工作台',
        ingredients: [
            ['钻石锄', 2],
            ['电动马达'],
            ['可编程式机器人(普通)']
        ]
    },
    '可编程式机器人(樵夫)': {
        type: '高级工作台',
        ingredients: [
            ['钻石斧', 2],
            ['电动马达'],
            ['可编程式机器人(普通)']
        ]
    },
    '可编程式机器人(渔夫)': {
        type: '高级工作台',
        ingredients: [
            ['钓鱼竿', 2],
            ['电动马达'],
            ['可编程式机器人(普通)']
        ]
    },
    '可编程式机器人(屠夫)': {
        type: '高级工作台',
        ingredients: [
            ['钻石剑', 2],
            ['电动马达'],
            ['GPS发射器'],
            ['可编程式机器人(普通)']
        ]
    },
    '机器人交互接口(物品)': {
        type: '高级工作台',
        ingredients: [
            ['塑料纸', 7],
            ['基础电路板'],
            ['蓝色染色玻璃']
        ]
    },
    '机器人交互接口(燃料)': {
        type: '高级工作台',
        ingredients: [
            ['塑料纸', 7],
            ['基础电路板'],
            ['红色染色玻璃']
        ]
    },
    '高级可编程式机器人(普通)': {
        type: '高级工作台',
        ingredients: [
            ['塑料纸', 4],
            ['箱子'],
            ['燃烧反应机'],
            ['能量水晶'],
            ['机器人内存核心'],
            ['可编程式机器人(普通)']
        ]
    },
    '高级可编程式机器人(渔夫)': {
        type: '高级工作台',
        ingredients: [
            ['钓鱼竿', 2],
            ['电动马达'],
            ['高级可编程式机器人(普通)']
        ]
    },
    '高级可编程式机器人(屠夫)': {
        type: '高级工作台',
        ingredients: [
            ['钻石剑', 2],
            ['电动马达'],
            ['GPS发射器'],
            ['高级可编程式机器人(屠夫)']
        ]
    },
    '高级可编程式机器人(农夫)': {
        type: '高级工作台',
        ingredients: [
            ['钻石锄', 2],
            ['电动马达'],
            ['GPS发射器'],
            ['高级可编程式机器人(普通)']
        ]
    },
    '可授权式可编程式机器人(普通)': {
        type: '高级工作台',
        ingredients: [
            ['塑料纸', 2],
            ['起泡锭', 2],
            ['箱子'],
            ['核反应堆'],
            ['能量水晶'],
            ['机器人内存核心'],
            ['高级可编程式机器人(普通)']
        ]
    },
    '可授权式可编程式机器人(渔夫)': {
        type: '高级工作台',
        ingredients: [
            ['钓鱼竿', 2],
            ['电动马达'],
            ['可授权式可编程式机器人(渔夫)']
        ]
    },
    '可授权式可编程式机器人(屠夫)': {
        type: '高级工作台',
        ingredients: [
            ['钻石剑', 2],
            ['电动马达'],
            ['黑金刚石GPS发射器'],
            ['可授权式可编程式机器人(屠夫)']
        ]
    },
    '炼油厂': {
        type: '高级工作台',
        ingredients: [
            ['钢化玻璃', 4],
            ['红石合金锭', 2],
            ['活塞', 2],
            ['电动马达']
        ]
    },
    '岩浆发电机': {
        type: '高级工作台',
        ingredients: [
            ['大马士革钢锭', 3],
            ['加热线圈', 2],
            ['金锭(16克拉)'],
            ['电动马达']
        ]
    },
    '岩浆发电机-II': {
        type: '高级工作台',
        ingredients: [
            ['科林斯青铜锭', 3],
            ['压缩碳', 3],
            ['加热线圈', 2],
            ['岩浆发电机']
        ]
    },
    '燃烧反应机': {
        type: '高级工作台',
        ingredients: [
            ['钢锭', 4],
            ['加热线圈', 2],
            ['电动马达']
        ]
    },
    '食品加工机': {
        type: '高级工作台',
        ingredients: [
            ['锡罐', 2],
            ['银铜合金锭', 2],
            ['银锭'],
            ['电动马达'],
            ['小型储能电容']
        ]
    },
    '食品加工机': {
        type: '高级工作台',
        ingredients: [
            ['硬化金属', 2],
            ['电动马达', 2],
            ['强化合金锭'],
            ['电磁铁'],
            ['食品加工机']
        ]
    },
    '自动喂食机': {
        type: '高级工作台',
        ingredients: [
            ['金锭(18克拉)', 2],
            ['铅锭', 2],
            ['电动马达', 2],
            ['锡罐'],
            ['干草块'],
            ['食品加工机']
        ]
    },
    '动物生长加速器': {
        type: '高级工作台',
        ingredients: [
            ['强化合金锭', 2],
            ['电动马达', 2],
            ['起泡锭'],
            ['有机食物(小麦)'],
            ['自动喂食机']
        ]
    },
    '经验收集器': {
        type: '高级工作台',
        ingredients: [
            ['铝青铜锭', 2],
            ['防凋灵黑曜石', 2],
            ['起泡锭'],
            ['电动马达'],
            ['自动附魔机']
        ]
    },
    '食品堆肥器': {
        type: '高级工作台',
        ingredients: [
            ['大马士革钢锭', 2],
            ['锡罐', 2],
            ['电动马达'],
            ['中型储能电容'],
            ['食品加工机']
        ]
    },
    '食品堆肥器-II': {
        type: '高级工作台',
        ingredients: [
            ['硬化金属', 2],
            ['电动马达', 2],
            ['强化合金锭'],
            ['电磁铁'],
            ['食品堆肥器']
        ]
    },
    '作物生长加速器': {
        type: '高级工作台',
        ingredients: [
            ['电动马达', 2],
            ['电磁铁', 2],
            ['起泡锭'],
            ['可编程式机器人(农夫)'],
            ['动物生长加速器']
        ]
    },
    '作物生长加速器-II': {
        type: '高级工作台',
        ingredients: [
            ['电动马达', 2],
            ['电磁铁', 2],
            ['起泡锭'],
            ['高级电路板'],
            ['作物生长加速器']
        ]
    },
    '冰箱': {
        type: '高级工作台',
        ingredients: [
            ['冷却装置', 2],
            ['电动马达', 2],
            ['银锭'],
            ['浮冰'],
            ['中型储能电容']
        ]
    },
    '冰箱-II': {
        type: '高级工作台',
        ingredients: [
            ['冷却装置', 2],
            ['电磁铁', 2],
            ['银锭'],
            ['铝黄铜锭'],
            ['冰箱']
        ]
    },
    '核反应堆': {
        type: '高级工作台',
        ingredients: [
            ['铅锭', 2],
            ['起泡锭', 2],
            ['钢筋板', 3],
            ['冷却装置'],
        ]
    },
    '下界之星反应堆': {
        type: '高级工作台',
        ingredients: [
            ['科林斯青铜锭', 2],
            ['高纯度铀', 2],
            ['钢筋板', 3],
            ['下界之星'],
            ['黑金刚石镶边储能电容']
        ]
    },
    '自动合成机': {
        type: '高级工作台',
        ingredients: [
            ['货运马达', 2],
            ['起泡锭'],
            ['电动马达'],
            ['工作台']
        ]
    },
    '反应堆访问接口': {
        type: '高级工作台',
        ingredients: [
            ['铅锭', 2],
            ['起泡锭'],
            ['电动马达'],
            ['货运马达']
        ]
    },
    '流体泵': {
        type: '高级工作台',
        ingredients: [
            ['桶', 2],
            ['货运马达'],
            ['原油泵'],
            ['中型储能电容']
        ]
    },
    '碳压机': {
        type: '高级工作台',
        ingredients: [
            ['碳', 4],
            ['加热线圈', 2],
            ['黑金刚石'],
            ['电动马达'],
            ['加热压力仓']
        ]
    },
    '碳压机-II': {
        type: '高级工作台',
        ingredients: [
            ['碳', 2],
            ['加热线圈', 2],
            ['黑金刚石', 2],
            ['电动马达'],
            ['电磁铁'],
            ['碳压机']
        ]
    },
    '碳压机-III': {
        type: '高级工作台',
        ingredients: [
            ['强化合金锭', 2],
            ['加热线圈', 2],
            ['黑金刚石', 2],
            ['电动马达'],
            ['电磁铁'],
            ['碳压机-II']
        ]
    },
    '电力冶炼机': {
        type: '高级工作台',
        ingredients: [
            ['地狱砖块', 2],
            ['镀金铁锭', 2],
            ['加热线圈', 2],
            ['电动马达', 2],
            ['电动铸锭机']
        ]
    },
    '电力冶炼机-II': {
        type: '高级工作台',
        ingredients: [
            ['大马士革钢锭', 2],
            ['镀金铁锭', 2],
            ['加热线圈', 2],
            ['电动马达'],
            ['能量水晶'],
            ['电力冶炼机']
        ]
    },
    '凋灵汇编器': {
        type: '高级工作台',
        ingredients: [
            ['起泡锭', 2],
            ['防凋灵黑曜石', 2],
            ['强化合金锭'],
            ['机器人内存核心'],
            ['电动马达'],
            ['下界之星'],
            ['黑金刚石镶边储能电容']
        ]
    },
    //基于GPS的机器
    'GPS发射器': {
        type: '高级工作台',
        ingredients: [
            ['钢锭', 4],
            ['电动马达'],
            ['电磁铁'],
            ['高级电路板']
        ]
    },
    '高级GPS发射器': {
        type: '高级工作台',
        ingredients: [
            ['GPS发射器', 4],
            ['青铜锭', 4],
            ['碳']
        ]
    },
    '高级GPS发射器': {
        type: '高级工作台',
        ingredients: [
            ['高级GPS发射器', 4],
            ['科林斯青铜锭', 4],
            ['黑金刚石']
        ]
    },
    '充能GPS发射器': {
        type: '高级工作台',
        ingredients: [
            ['黑金刚石GPS发射器', 4],
            ['镍锭', 2],
            ['起泡锭', 2],
            ['黑金刚石']
        ]
    },
    'GPS控制面板': {
        type: '高级工作台',
        ingredients: [
            ['铝黄铜锭', 3],
            ['钴锭', 2],
            ['电磁铁'],
            ['高级电路板']
        ]
    },
    'GPS设置路径点工具': {
        type: '高级工作台',
        ingredients: [
            ['青金石', 2],
            ['红石粉', 2],
            ['红石合金锭'],
            ['电磁铁'],
            ['基础电路板']
        ]
    },
    'GPS应急发射器': {
        type: '高级工作台',
        ingredients: [
            ['来世精华'],
            ['电磁铁'],
            ['GPS发射器']
        ]
    },
    'GPS地形扫描器': {
        type: '高级工作台',
        ingredients: [
            ['电磁铁', 3],
            ['钢锭', 2],
            ['电动马达']
        ]
    },
    '便携式资源扫描器': {
        type: '高级工作台',
        ingredients: [
            ['钢锭', 2],
            ['焊锡锭', 2],
            ['电磁铁', 2],
            ['电动马达'],
            ['指南针'],
            ['GPS设置路径点工具']
        ]
    },
    '原油泵': {
        type: '高级工作台',
        ingredients: [
            ['钢锭', 4],
            ['桶'],
            ['电动马达'],
            ['中型储能电容']
        ]
    },
    'GEO矿机': {
        type: '高级工作台',
        ingredients: [
            ['钻石镐', 2],
            ['强化合金锭', 2],
            ['电动马达'],
            ['原油泵'],
            ['中型储能电容']
        ]
    },
    'GPS传送塔': {
        type: '高级工作台',
        ingredients: [
            ['锌锭', 4],
            ['玻璃', 4],
            ['加热线圈']
        ],
        count: 8
    },
    'GPS传送矩阵': {
        type: '高级工作台',
        ingredients: [
            ['GPS传送塔', 4],
            ['强化合金锭', 2],
            ['电磁铁', 2],
            ['GPS控制面板']
        ]
    },
    'GPS激活设备(公共)': {
        type: '高级工作台',
        ingredients: [
            ['银铜合金锭', 3],
            ['红石粉', 2],
            ['石质压力板'],
            ['GPS发射器']
        ]
    },
    'GPS激活设备(私人)': {
        type: '高级工作台',
        ingredients: [
            ['铅锭', 2],
            ['钴锭', 2],
            ['GPS激活设备(公共)']
        ]
    },
    '电梯板': {
        type: '高级工作台',
        ingredients: [
            ['铝青铜锭', 3],
            ['活塞', 2],
            ['电动马达'],
            ['石质压力板']
        ],
        count: 2
    },
    //货物管理
    '货运马达': {
        type: '高级工作台',
        ingredients: [
            ['钢化玻璃', 4],
            ['银锭', 2],
            ['电磁铁', 2],
            ['电动马达']
        ],
        count: 4
    },
    '货运管理器': {
        type: '高级工作台',
        ingredients: [
            ['钢筋板', 2],
            ['铝青铜锭', 2],
            ['全息投影仪'],
            ['货运马达'],
            ['机器人内存核心']
        ],
    },
    '货运节点(连接器)': {
        type: '高级工作台',
        ingredients: [
            ['青铜锭', 4],
            ['银锭', 4],
            ['货运马达']
        ],
        count: 4
    },
    '货运节点(输入)': {
        type: '高级工作台',
        ingredients: [
            ['银铜合金锭', 2],
            ['漏斗', 2],
            ['货运节点(连接器)']
        ],
        count: 2
    },
    '货运节点(输出)': {
        type: '高级工作台',
        ingredients: [
            ['黄铜锭', 2],
            ['漏斗', 2],
            ['货运节点(连接器)']
        ],
        count: 2
    },
    '高级货运节点(输出)': {
        type: '高级工作台',
        ingredients: [
            ['钴锭', 2],
            ['货运马达', 2],
            ['货运节点(输出)']
        ]
    },
    '垃圾箱': {
        type: '高级工作台',
        ingredients: [
            ['铅锭', 5],
            ['货运马达'],
            ['便携垃圾箱']
        ]
    },
};